-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/adult_health_long_term.lo
> g
  log type:  text
 opened on:  29 Nov 2019, 15:56:04

. use "$data/investments_data.dta";
(Complete Investments Data Base)

. *==============================
>  Estimation Sample  -- households with information on consumption in Nov 2003 
>                                         -- drop consumption outliers for sample consistency with estimation sample in Table
>  5
> *==============================;
. keep if wave == 7;
(136,857 observations deleted)

. tab wave;

       Wave |      Freq.     Percent        Cum.
------------+-----------------------------------
          7 |     21,114      100.00      100.00
------------+-----------------------------------
      Total |     21,114      100.00

. drop if consumo_pp_ae ==0 | consumo_pp_ae ==.;
(291 observations deleted)

. foreach x in consumo_pp_ae2 {;
  2.         xtile `x'_tl_t2 = `x' if t2_c1_op ~=., nq(200);
  3.         xtile `x'_tl_tr = `x' if treatcom ~=. & ineligible ==1, nq(200);
  4. };

. sort state muni local folio wave;

. tempfile investments;

. save `investments';
file C:\Users\Claud\AppData\Local\Temp\ST_1e80_000001.tmp saved

. *==============================
>  Merge Adult Morbidity Data
> ==============================;
. u "$data/adults_morbidity_03.dta", clear;

. sort state muni local folio wave;

. merge state muni local folio wave using `investments';
(note: you are using old merge syntax; see [D] merge for new syntax)
variables state muni local folio wave do not uniquely identify observations in the master data

. keep if _merge ==3;
(31,359 observations deleted)

. sort state muni local folio numero wave;

. dups state muni local folio numero wave;

group by: state muni local folio numero wave

groups formed: 0

. sort state muni local folio numero wave;

. *=================*
>  Globals Variables
> *=================*;
. gl adl_d sick inactivity;

. gl adl_c days_sick days_inactivity nb_km moderate_adl vigorous_adl;

. foreach y in moderate vigorous {;
  2.         replace `y'_adl =. if `y'_adl ==0;
  3. };
(70 real changes made, 70 to missing)
(70 real changes made, 70 to missing)

.                         g age_sq =age*age;
(262 missing values generated)

. gl basic                nbani197 nbani297 ha97;

. gl controls_all no497 big497
>                                 age age_sq female educ1_hh ethnicity_hh educ1_sp                        
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p 
>                                 homeown97 dirtfloor97 electricity97  
>                                 org_faenas min_dist lnup_cwagepm up2_mcwagepm
>                                 dummy_age_hh dummy_educ_hh dummy_ethnicity_hh dummy_age_sp dummy_educ_sp
>                                 dummy_dage0_7_97 dummy_dirtfloor97 dummy_electricity97;

. *======================================================
>  Regressions Table 7 (ITT Eligibles)
> ========================================================;
. foreach x of global adl_d {;
  2.         reg `x' t2_c1_op $basic hhsize_97 $controls_all if age<=64 & consumo_pp_ae2_tl_t2 >1 & consumo_pp_ae2_tl_t2 <200
> , cl(comuid);
  3.         sum `x' if e(sample) & t2_c1_op ==0;
  4.         scalar mean =r(mean);
  5.         estadd scalar mean;
  6.         est store `x', title (`x');
  7. };
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     24,679
                                                F(31, 498)        =      20.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0317
                                                Root MSE          =     .33577

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               sick |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0070474   .0091933     0.77   0.444     -.011015    .0251098
           nbani197 |  -.0011481    .003163    -0.36   0.717    -.0073625    .0050662
           nbani297 |   .0031367   .0016323     1.92   0.055    -.0000703    .0063437
               ha97 |  -.0024174   .0016006    -1.51   0.132    -.0055623    .0007274
          hhsize_97 |  -.0020877   .0014559    -1.43   0.152    -.0049482    .0007728
              no497 |   .0026496   .0105998     0.25   0.803    -.0181763    .0234756
             big497 |    .026892   .0103103     2.61   0.009     .0066349    .0471491
                age |   .0053347   .0011715     4.55   0.000      .003033    .0076364
             age_sq |  -.0000222   .0000157    -1.42   0.157     -.000053    8.59e-06
             female |   .0559808   .0039033    14.34   0.000     .0483119    .0636498
           educ1_hh |  -.0084124   .0068658    -1.23   0.221     -.021902    .0050771
       ethnicity_hh |  -.0201729   .0086286    -2.34   0.020     -.037126   -.0032199
           educ1_sp |   -.011089   .0074699    -1.48   0.138    -.0257653    .0035873
         dage0_7_97 |  -.0051583   .0078896    -0.65   0.514    -.0206592    .0103426
        dage8_17_97 |  -.0095082    .008266    -1.15   0.251    -.0257487    .0067323
       dage18_54_97 |  -.0443458   .0300279    -1.48   0.140    -.1033428    .0146512
         dage55p_97 |  -.0288091   .0068808    -4.19   0.000    -.0423281   -.0152901
          homeown97 |  -.0041501   .0122322    -0.34   0.735    -.0281832     .019883
        dirtfloor97 |   .0010332   .0069845     0.15   0.882    -.0126895    .0147558
      electricity97 |   .0109204   .0080308     1.36   0.175     -.004858    .0266988
         org_faenas |  -.0002234    .013155    -0.02   0.986    -.0260695    .0256228
           min_dist |  -.0004348   .0001079    -4.03   0.000    -.0006469   -.0002228
       lnup_cwagepm |   .0009149   .0014101     0.65   0.517    -.0018556    .0036853
       up2_mcwagepm |  -.0224063   .0179887    -1.25   0.214    -.0577494    .0129367
       dummy_age_hh |   .0155435   .0464049     0.33   0.738      -.07563    .1067169
      dummy_educ_hh |  -.0345185   .0393345    -0.88   0.381    -.1118006    .0427635
 dummy_ethnicity_hh |    -.05691   .0523622    -1.09   0.278    -.1597881    .0459682
       dummy_age_sp |   .0314049   .0258964     1.21   0.226    -.0194748    .0822847
      dummy_educ_sp |  -.0195683   .0272364    -0.72   0.473    -.0730808    .0339443
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   .0008313   .0447802     0.02   0.985    -.0871501    .0888126
dummy_electricity97 |   .1060443   .0967473     1.10   0.274    -.0840388    .2961275
              _cons |   .0715696   .0414653     1.73   0.085    -.0098988    .1530381
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        sick |      9,367    .1313121    .3377593          0          1

added scalar:
               e(mean) =  .13131205
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     24,679
                                                F(31, 498)        =       9.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0141
                                                Root MSE          =     .23106

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
         inactivity |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0006742   .0047682     0.14   0.888    -.0086941    .0100424
           nbani197 |  -.0018032   .0016316    -1.11   0.270    -.0050088    .0014023
           nbani297 |   .0000302   .0008098     0.04   0.970    -.0015608    .0016212
               ha97 |  -.0003524   .0010556    -0.33   0.739    -.0024262    .0017215
          hhsize_97 |  -.0013868    .000972    -1.43   0.154    -.0032964    .0005229
              no497 |  -.0026255   .0067853    -0.39   0.699    -.0159569    .0107059
             big497 |   .0127012   .0067616     1.88   0.061    -.0005836    .0259859
                age |   .0013459   .0008154     1.65   0.099    -.0002561    .0029479
             age_sq |   7.22e-06   .0000109     0.66   0.509    -.0000143    .0000287
             female |    .013386   .0028287     4.73   0.000     .0078284    .0189437
           educ1_hh |  -.0079503   .0043449    -1.83   0.068    -.0164869    .0005864
       ethnicity_hh |   .0006536   .0052782     0.12   0.901    -.0097167     .011024
           educ1_sp |  -.0007016   .0043587    -0.16   0.872    -.0092652     .007862
         dage0_7_97 |  -.0006932   .0046403    -0.15   0.881    -.0098102    .0084237
        dage8_17_97 |  -.0044875   .0053524    -0.84   0.402    -.0150036    .0060285
       dage18_54_97 |  -.0185684   .0182685    -1.02   0.310    -.0544612    .0173245
         dage55p_97 |  -.0089383    .004277    -2.09   0.037    -.0173414   -.0005352
          homeown97 |   .0015912   .0075286     0.21   0.833    -.0132005     .016383
        dirtfloor97 |   .0064156   .0037876     1.69   0.091     -.001026    .0138572
      electricity97 |   .0031235   .0047332     0.66   0.510     -.006176    .0124229
         org_faenas |   .0041628    .007756     0.54   0.592    -.0110757    .0194013
           min_dist |  -.0002408   .0000691    -3.48   0.001    -.0003766   -.0001049
       lnup_cwagepm |  -.0010676   .0007978    -1.34   0.181     -.002635    .0004999
       up2_mcwagepm |  -.0133441   .0104741    -1.27   0.203     -.033923    .0072347
       dummy_age_hh |  -.0231009   .0361171    -0.64   0.523    -.0940616    .0478598
      dummy_educ_hh |  -.0476389   .0134791    -3.53   0.000    -.0741219    -.021156
 dummy_ethnicity_hh |   .0485299   .0470991     1.03   0.303    -.0440075    .1410674
       dummy_age_sp |   .0046316   .0127031     0.36   0.716    -.0203267      .02959
      dummy_educ_sp |    .005267   .0134132     0.39   0.695    -.0210865    .0316204
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -.0091818    .024165    -0.38   0.704    -.0566596     .038296
dummy_electricity97 |   .1492587   .0917131     1.63   0.104    -.0309335    .3294509
              _cons |   .0454629    .024522     1.85   0.064    -.0027163    .0936422
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  inactivity |      9,368    .0574295     .232674          0          1

added scalar:
               e(mean) =  .05742955

. foreach x of global adl_c {;
  2.         reg `x' t2_c1_op $basic hhsize_97 $controls_all if age <=64 & consumo_pp_ae2_tl_t2 >1 & consumo_pp_ae2_tl_t2 <20
> 0, cl(comuid);
  3.         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
  4.         scalar mean =r(mean);
  5.         estadd scalar mean;
  6.         est store `x', title (`x');
  7. };
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     24,679
                                                F(31, 498)        =      11.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0208
                                                Root MSE          =     3.8294

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
          days_sick |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    .113303   .0796282     1.42   0.155    -.0431457    .2697517
           nbani197 |  -.0470401   .0294655    -1.60   0.111    -.1049321    .0108519
           nbani297 |   .0354007   .0200072     1.77   0.077    -.0039083    .0747096
               ha97 |  -.0238993   .0175837    -1.36   0.175    -.0584466    .0106481
          hhsize_97 |   .0188148   .0162254     1.16   0.247    -.0130639    .0506935
              no497 |  -.0213564   .1060416    -0.20   0.840    -.2297005    .1869876
             big497 |    .282586   .1102497     2.56   0.011     .0659741     .499198
                age |   .0426342   .0129593     3.29   0.001     .0171726    .0680959
             age_sq |  -.0000888   .0001774    -0.50   0.617    -.0004374    .0002598
             female |   .3444733   .0448016     7.69   0.000     .2564498    .4324968
           educ1_hh |   -.050488   .0675344    -0.75   0.455    -.1831756    .0821995
       ethnicity_hh |  -.2604829   .0822044    -3.17   0.002     -.421993   -.0989728
           educ1_sp |  -.0749247   .0738896    -1.01   0.311    -.2200984    .0702491
         dage0_7_97 |  -.2798445   .0870311    -3.22   0.001    -.4508379   -.1088511
        dage8_17_97 |   -.149485   .0796459    -1.88   0.061    -.3059684    .0069984
       dage18_54_97 |  -.2366425   .3461203    -0.68   0.494    -.9166786    .4433936
         dage55p_97 |  -.2286178   .0716553    -3.19   0.002    -.3694018   -.0878338
          homeown97 |   .0148298   .1209736     0.12   0.902    -.2228517    .2525113
        dirtfloor97 |  -.0819472   .0770611    -1.06   0.288     -.233352    .0694577
      electricity97 |  -.0129214   .0767868    -0.17   0.866    -.1637874    .1379446
         org_faenas |  -.0740597   .1349224    -0.55   0.583    -.3391469    .1910276
           min_dist |  -.0030042   .0010027    -3.00   0.003    -.0049742   -.0010341
       lnup_cwagepm |   .0048912   .0140002     0.35   0.727    -.0226156     .032398
       up2_mcwagepm |  -.1498989   .1649788    -0.91   0.364    -.4740391    .1742413
       dummy_age_hh |   .4529365   .6092132     0.74   0.458    -.7440085    1.649881
      dummy_educ_hh |   -.562366   .2054159    -2.74   0.006    -.9659546   -.1587775
 dummy_ethnicity_hh |  -.6729395   .5461761    -1.23   0.218    -1.746033     .400154
       dummy_age_sp |   .1121912   .2324293     0.48   0.630    -.3444718    .5688541
      dummy_educ_sp |  -.0237776   .2469674    -0.10   0.923     -.509004    .4614488
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   .1305276   .4931778     0.26   0.791     -.838438    1.099493
dummy_electricity97 |   5.310175   2.898706     1.83   0.068     -.385026    11.00538
              _cons |   .4154538   .4258798     0.98   0.330    -.4212888    1.252196
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   days_sick |      1,230    7.226829    7.723756          1         31

added scalar:
               e(mean) =  7.2268293
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     24,679
                                                F(31, 498)        =       5.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0084
                                                Root MSE          =     2.5837

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
    days_inactivity |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0739494   .0504003    -1.47   0.143    -.1729728    .0250739
           nbani197 |  -.0264077   .0153676    -1.72   0.086    -.0566009    .0037855
           nbani297 |  -.0054531   .0086828    -0.63   0.530    -.0225127    .0116064
               ha97 |  -.0054651    .011217    -0.49   0.626    -.0275036    .0165734
          hhsize_97 |   .0044064   .0131108     0.34   0.737    -.0213528    .0301656
              no497 |    .001785   .0698218     0.03   0.980    -.1353967    .1389667
             big497 |   .1691119   .0926663     1.82   0.069    -.0129532     .351177
                age |   .0058687   .0098149     0.60   0.550    -.0134151    .0251525
             age_sq |   .0001275   .0001357     0.94   0.348    -.0001391    .0003941
             female |   .0186483   .0320108     0.58   0.560    -.0442446    .0815412
           educ1_hh |  -.0266228   .0499755    -0.53   0.594    -.1248115     .071566
       ethnicity_hh |  -.0370172   .0437294    -0.85   0.398    -.1229341    .0488997
           educ1_sp |   .0224824   .0558971     0.40   0.688    -.0873408    .1323055
         dage0_7_97 |  -.1112072    .056866    -1.96   0.051    -.2229341    .0005196
        dage8_17_97 |  -.0990483   .0601178    -1.65   0.100    -.2171642    .0190676
       dage18_54_97 |  -.1127236   .2242214    -0.50   0.615    -.5532602    .3278129
         dage55p_97 |   -.064218   .0557012    -1.15   0.250    -.1736564    .0452204
          homeown97 |   .0095457   .0780198     0.12   0.903    -.1437429    .1628343
        dirtfloor97 |  -.0259511    .043141    -0.60   0.548     -.110712    .0588097
      electricity97 |  -.0028475   .0426388    -0.07   0.947    -.0866216    .0809267
         org_faenas |  -.0316622   .0771852    -0.41   0.682     -.183311    .1199865
           min_dist |  -.0009857   .0005977    -1.65   0.100      -.00216    .0001887
       lnup_cwagepm |  -.0117736   .0076852    -1.53   0.126     -.026873    .0033258
       up2_mcwagepm |  -.0902125   .1171537    -0.77   0.442     -.320389     .139964
       dummy_age_hh |   .0008299   .7985541     0.00   0.999     -1.56812     1.56978
      dummy_educ_hh |   -.561403    .240571    -2.33   0.020    -1.034062   -.0887437
 dummy_ethnicity_hh |    .573961   .9473177     0.61   0.545    -1.287271    2.435193
       dummy_age_sp |  -.1762682    .082636    -2.13   0.033    -.3386264     -.01391
      dummy_educ_sp |   .3057908   .1095638     2.79   0.005     .0905266    .5210549
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   .0276249   .3479792     0.08   0.937    -.6560634    .7113131
dummy_electricity97 |   2.934994   1.561717     1.88   0.061    -.1333727     6.00336
              _cons |   .4961436   .2767471     1.79   0.074    -.0475923    1.039879
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
days_inact~y |        538    8.137546    8.873393          1         31

added scalar:
               e(mean) =  8.1375465
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     24,253
                                                F(31, 498)        =      86.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1230
                                                Root MSE          =      3.149

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              nb_km |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0130706   .1504205    -0.09   0.931    -.3086076    .2824665
           nbani197 |  -.0402284   .0398474    -1.01   0.313    -.1185181    .0380612
           nbani297 |    -.01749   .0167316    -1.05   0.296    -.0503633    .0153832
               ha97 |   .0239627   .0205295     1.17   0.244    -.0163725    .0642979
          hhsize_97 |   .0016575   .0216632     0.08   0.939    -.0409051    .0442201
              no497 |  -.2451103   .1243655    -1.97   0.049     -.489456   -.0007646
             big497 |   .0778031   .1201212     0.65   0.517    -.1582037    .3138099
                age |   .0604328   .0105662     5.72   0.000     .0396729    .0811926
             age_sq |   -.001391   .0001393    -9.98   0.000    -.0016647   -.0011172
             female |  -1.975434   .0454572   -43.46   0.000    -2.064745   -1.886122
           educ1_hh |  -.0968615   .0879883    -1.10   0.271    -.2697356    .0760126
       ethnicity_hh |   .4226397   .1575049     2.68   0.008     .1131836    .7320957
           educ1_sp |   .0726658   .0885999     0.82   0.413    -.1014099    .2467415
         dage0_7_97 |   .1165604   .0974977     1.20   0.232    -.0749971    .3081178
        dage8_17_97 |   .1231881   .0910391     1.35   0.177    -.0556799    .3020561
       dage18_54_97 |   .3468685   .2658173     1.30   0.193    -.1753931    .8691301
         dage55p_97 |  -.0449662   .0868643    -0.52   0.605    -.2156319    .1256994
          homeown97 |  -.0534661   .1411504    -0.38   0.705    -.3307899    .2238577
        dirtfloor97 |   .1901042   .0846996     2.24   0.025     .0236915    .3565169
      electricity97 |   .0101684   .1366254     0.07   0.941    -.2582649    .2786016
         org_faenas |   .0041478   .2859552     0.01   0.988    -.5576795    .5659751
           min_dist |  -.0014134   .0019904    -0.71   0.478    -.0053241    .0024973
       lnup_cwagepm |   .0288905   .0262428     1.10   0.271    -.0226698    .0804507
       up2_mcwagepm |  -.5975878   .3942562    -1.52   0.130    -1.372198    .1770227
       dummy_age_hh |  -.4020322   .5566055    -0.72   0.470    -1.495617    .6915524
      dummy_educ_hh |  -.8032237   .4046659    -1.98   0.048    -1.598286   -.0081608
 dummy_ethnicity_hh |   1.368465   .6469413     2.12   0.035     .0973944    2.639536
       dummy_age_sp |  -.3449216   .2815132    -1.23   0.221    -.8980215    .2081783
      dummy_educ_sp |   .3475936   .2957677     1.18   0.240    -.2335128    .9286999
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   .3601367   .4744485     0.76   0.448    -.5720307    1.292304
dummy_electricity97 |  -2.845049   .3718762    -7.65   0.000    -3.575688   -2.114409
              _cons |   5.342851   .5179273    10.32   0.000     4.325259    6.360443
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       nb_km |      8,799    5.408456    3.222132          1         19

added scalar:
               e(mean) =  5.4084555
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     24,689
                                                F(31, 498)        =      32.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1118
                                                Root MSE          =     .36148

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
       moderate_adl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0049022   .0082407    -0.59   0.552     -.021093    .0112885
           nbani197 |   .0001536   .0032524     0.05   0.962    -.0062365    .0065437
           nbani297 |   .0012435   .0014266     0.87   0.384    -.0015594    .0040464
               ha97 |  -.0000749   .0018027    -0.04   0.967    -.0036167    .0034668
          hhsize_97 |   -.000251   .0015633    -0.16   0.873    -.0033225    .0028205
              no497 |   .0326621   .0116436     2.81   0.005     .0097855    .0555388
             big497 |   .0014581   .0103258     0.14   0.888    -.0188294    .0217456
                age |  -.0150469   .0015689    -9.59   0.000    -.0181293   -.0119645
             age_sq |   .0003039   .0000224    13.58   0.000     .0002599    .0003478
             female |   .0890155   .0052044    17.10   0.000     .0787903    .0992407
           educ1_hh |   .0065935   .0062985     1.05   0.296    -.0057814    .0189685
       ethnicity_hh |  -.0090239   .0086478    -1.04   0.297    -.0260146    .0079667
           educ1_sp |  -.0013641   .0064234    -0.21   0.832    -.0139845    .0112563
         dage0_7_97 |  -.0336944   .0091013    -3.70   0.000     -.051576   -.0158128
        dage8_17_97 |  -.0305948   .0078655    -3.89   0.000    -.0460485   -.0151411
       dage18_54_97 |  -.1351833   .0393018    -3.44   0.001     -.212401   -.0579656
         dage55p_97 |   .0163253    .007068     2.31   0.021     .0024385     .030212
          homeown97 |   .0176589   .0095526     1.85   0.065    -.0011096    .0364273
        dirtfloor97 |   .0141106   .0065708     2.15   0.032     .0012006    .0270205
      electricity97 |   .0136801   .0076117     1.80   0.073    -.0012749    .0286352
         org_faenas |  -.0043036   .0162409    -0.26   0.791    -.0362127    .0276054
           min_dist |  -.0000914   .0000969    -0.94   0.346    -.0002818    .0000991
       lnup_cwagepm |  -.0011166   .0013565    -0.82   0.411    -.0037817    .0015486
       up2_mcwagepm |    .014877   .0220943     0.67   0.501    -.0285325    .0582865
       dummy_age_hh |  -.0219643   .0797064    -0.28   0.783    -.1785666    .1346381
      dummy_educ_hh |   .0023741    .050762     0.05   0.963      -.09736    .1021083
 dummy_ethnicity_hh |  -.0030835   .0921863    -0.03   0.973    -.1842056    .1780386
       dummy_age_sp |   .0017093   .0232716     0.07   0.941    -.0440134     .047432
      dummy_educ_sp |   .0154937   .0260745     0.59   0.553    -.0357359    .0667232
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   .0011785   .0489293     0.02   0.981    -.0949547    .0973118
dummy_electricity97 |   .4309604     .23702     1.82   0.070    -.0347221    .8966429
              _cons |   1.335771   .0491543    27.18   0.000     1.239196    1.432347
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
moderate_adl |      9,369    1.131071    .3897498          1          3

added scalar:
               e(mean) =  1.1310706
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     24,685
                                                F(31, 498)        =      47.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1462
                                                Root MSE          =     .43342

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
       vigorous_adl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0066503   .0100285    -0.66   0.508    -.0263537    .0130531
           nbani197 |   .0020724   .0040088     0.52   0.605    -.0058039    .0099487
           nbani297 |   .0014996   .0016253     0.92   0.357    -.0016936    .0046928
               ha97 |  -.0009634   .0021159    -0.46   0.649    -.0051206    .0031938
          hhsize_97 |  -.0009299   .0019074    -0.49   0.626    -.0046775    .0028178
              no497 |   .0289391   .0125418     2.31   0.021     .0042977    .0535805
             big497 |   .0072842   .0127454     0.57   0.568    -.0177571    .0323255
                age |  -.0162091   .0016886    -9.60   0.000    -.0195267   -.0128915
             age_sq |   .0003667   .0000243    15.07   0.000     .0003189    .0004145
             female |   .1322853    .006025    21.96   0.000     .1204477    .1441229
           educ1_hh |   .0060285    .008146     0.74   0.460    -.0099762    .0220332
       ethnicity_hh |  -.0111688     .01082    -1.03   0.302    -.0324273    .0100897
           educ1_sp |   .0008855   .0077294     0.11   0.909    -.0143007    .0160717
         dage0_7_97 |   -.049127   .0106049    -4.63   0.000    -.0699629   -.0282911
        dage8_17_97 |  -.0292377   .0097265    -3.01   0.003    -.0483476   -.0101277
       dage18_54_97 |  -.1395052   .0439651    -3.17   0.002    -.2258852   -.0531252
         dage55p_97 |   .0193335   .0083903     2.30   0.022     .0028488    .0358182
          homeown97 |   .0038933   .0132686     0.29   0.769    -.0221761    .0299627
        dirtfloor97 |   .0185351   .0083954     2.21   0.028     .0020404    .0350299
      electricity97 |   .0102286   .0096921     1.06   0.292    -.0088138     .029271
         org_faenas |  -.0168733   .0171212    -0.99   0.325    -.0505119    .0167653
           min_dist |  -.0001384   .0001258    -1.10   0.272    -.0003855    .0001087
       lnup_cwagepm |  -.0022475   .0016207    -1.39   0.166    -.0054318    .0009368
       up2_mcwagepm |   .0073465   .0285395     0.26   0.797    -.0487261    .0634191
       dummy_age_hh |    .013245   .0813239     0.16   0.871    -.1465353    .1730252
      dummy_educ_hh |  -.0531849   .0490886    -1.08   0.279    -.1496311    .0432614
 dummy_ethnicity_hh |  -.0067865   .0927717    -0.07   0.942    -.1890586    .1754856
       dummy_age_sp |  -.0118822   .0269851    -0.44   0.660    -.0649009    .0411365
      dummy_educ_sp |   .0276681   .0299458     0.92   0.356    -.0311676    .0865037
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   .0557922   .0726647     0.77   0.443    -.0869749    .1985593
dummy_electricity97 |   .4889564   .2858484     1.71   0.088    -.0726611    1.050574
              _cons |   1.374246   .0583297    23.56   0.000     1.259643    1.488848
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
vigorous_adl |      9,366    1.193572    .4769154          1          3

added scalar:
               e(mean) =  1.1935725

. ***Output Table 7;
. estout sick days_sick inactivity days_inactivity nb_km moderate_adl vigorous_adl
>         using "$out_p/adl_w7.text", stats(N mean, fmt(%9.0fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var (Control Households)")) keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%
> 9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles - Health HH) replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/adl_w7.text not found)
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/adl_w7.text)

. log close;
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/adult_health_long_term.lo
> g
  log type:  text
 closed on:  29 Nov 2019, 15:56:10
-----------------------------------------------------------------------------------------------------------------------------
