-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/consumption_income_long_t
> erm4.log
  log type:  text
 opened on:   7 Dec 2019, 20:57:14

. use "$data/investments_data.dta";
(Complete Investments Data Base)

. *==============================
>  Estimation Sample -- households with information on consumption in Nov 2003
> *==============================;
. keep if wave == 7;
(136,857 observations deleted)

. drop if consumo_pp_ae ==0 | consumo_pp_ae ==.;
(291 observations deleted)

. *================================================================*
>  Private & Public Transfers & Out of the Hh Earnings - PP AE & Compare Values/Trimming
> *=================================================================*;
. gl public       solidaridad INI probecat empleotemp procampo liconsa DIF tortilla progbecas progpapilla progmonetario
>                         amount_solidaridad amount_INI amount_probecat amount_empleotemp amount_procampo;

. sum $public;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 solidaridad |          0
         INI |          0
    probecat |          0
  empleotemp |     19,822    .0064575    .0801005          0          1
    procampo |     19,830    .3292486    .4699522          0          1
-------------+---------------------------------------------------------
     liconsa |     19,833    .0152776    .1226577          0          1
         DIF |     19,832     .086073    .2804789          0          1
    tortilla |     19,836    .0009579    .0309352          0          1
   progbecas |          0
 progpapilla |          0
-------------+---------------------------------------------------------
progmoneta~o |     19,839    .7176773    .4501409          0          1
amount_sol~d |          0
  amount_INI |          0
amount_pro~t |          0
amount_emp~p |     19,804    1.842095    44.43933          0   3709.103
-------------+---------------------------------------------------------
amount_pro~o |     19,341     64.1147    972.0523          0   92772.59

. des $public;

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------
solidaridad     byte    %8.0g      p40b1      (hh) =1 if hh receives solidaridad support
INI             byte    %8.0g      p40c1      (hh) =1 if hh receives INI support (anti-poverty program for indigenous)
probecat        byte    %8.0g      p40d1      (hh) =1 if hh receives probecat support
empleotemp      byte    %8.0g      p40e1      (hh) =1 if hh receives empleo temporal support
procampo        byte    %9.0g                 (hh) =1 if hh receives procampo support (agricultural subsidies)
liconsa         byte    %8.0g      p41b1      (hh) =1 if hh receives liconsao support
DIF             byte    %8.0g      p40a1      (hh) =1 if hh receives DIF support (despensas -- package of basic food
                                                products)
tortilla        byte    %8.0g      p41a1      (hh) =1 if hh receives tortilla support
progbecas       byte    %9.0g                 (hh) =1 if hh receives becas progresa
progpapilla     byte    %9.0g                 (hh) =1 if hh receives papilla progresa
progmonetario   byte    %9.0g                 (hh) =1 if hh receives nutritional stipend progresa
amount_solida~d double  %9.0g                 (hh) Monthly amount solidaridad support (deflated)
amount_INI      double  %9.0g                 (hh) Monthly amount INI support (deflated)
amount_probecat double  %9.0g                 (hh) Monthly amount probecat support (deflated)
amount_empleo~p double  %9.0g                 (hh) Monthly amount empleotemp support (deflated)
amount_procampo double  %9.0g                 (hh) Monthly amount procampo support (deflated)

. **Procampo and progmonetario (progresa) are the most common public subsidies hh receives -- consider amount_procampo;
. ren amount_procampo     amount_p;

.                         *public transfers;
. ren amount_t                    amount_t_pr;

.                 *private transfers;
. ren nonfood nonfoodexp;

. foreach x in foodexp nonfoodexp {;
  2.         drop `x'_pp `x'_pp_ae;
  3. };

. foreach x in amount_p amount_t_pr amount_borrowed_m outwage_lw_hh foodexp nonfoodexp {;
  2.         g `x'_pp_ae = `x'/hhsize_ae;
  3.         g `x'_pp_ae2 = `x'/hhsize_ae2;
  4. };
(1,482 missing values generated)
(1,482 missing values generated)
(951 missing values generated)
(951 missing values generated)
(890 missing values generated)
(890 missing values generated)
(2,217 missing values generated)
(2,217 missing values generated)

. egen amount_t_pb                        =rsum(amount_p witransfer_act_m);

. replace amount_t_pb                     =. if amount_p ==. & witransfer_act_m ==.;
(200 real changes made, 200 to missing)

. egen amount_t_pb_pp_ae          =rsum(amount_p_pp_ae witransfer_act_m_pp_ae);

. replace amount_t_pb_pp_ae       =. if amount_p_pp_ae ==. & witransfer_act_m_pp_ae ==.;
(200 real changes made, 200 to missing)

. egen amount_t_pb_pp_ae2         =rsum(amount_p_pp_ae2 witransfer_act_m_pp_ae2);

. replace amount_t_pb_pp_ae2      =. if amount_p_pp_ae2 ==. & witransfer_act_m_pp_ae2 ==.;
(200 real changes made, 200 to missing)

.  ** Dummies for Proportions;
. foreach x in consumo homeprod foodexp nonfoodexp witransfer_act_m amount_p amount_t_pb amount_t_pr amount_borrowed_m outwag
> e_lw_hh
> consumo_pp_ae homeprod_pp_ae foodexp_pp_ae nonfoodexp_pp_ae witransfer_act_m_pp_ae amount_p_pp_ae amount_t_pb_pp_ae amount_
> t_pr_pp_ae 
> amount_borrowed_m_pp_ae outwage_lw_hh_pp_ae
> consumo_pp_ae2 homeprod_pp_ae2 foodexp_pp_ae2 nonfoodexp_pp_ae2 witransfer_act_m_pp_ae2 amount_p_pp_ae2 amount_t_pb_pp_ae2 
> amount_t_pr_pp_ae2 
> amount_borrowed_m_pp_ae2 outwage_lw_hh_pp_ae2 {;
  2.         g d`x' =(`x'>0);
  3. };

. *============================*
>  Trim Outliers
> *============================*;
. sum amount_p amount_t_pr amount_borrowed_m outwage_lw_hh amount_p_pp_ae2 witransfer_act_m_pp_ae2 amount_p_pp_ae2 amount_t_p
> b_pp_ae2 
> amount_t_pr_pp_ae2 outwage_lw_hh_pp_ae2 amount_borrowed_m_pp_ae2 consumo_pp_ae2 foodexp nonfoodexp foodexp_pp_ae2 nonfoodex
> p_pp_ae2 
> if t2_c1_op~=., d;

       (hh) Monthly amount procampo support (deflated)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               9,858
25%            0              0       Sum of Wgt.       9,858

50%            0                      Mean           55.65801
                        Largest       Std. Dev.      1075.038
75%      40.0119       21606.42
90%     90.02677        25207.5       Variance        1155707
95%     142.5424       27008.03       Skewness       69.63105
99%      390.116       92772.59       Kurtosis       5709.872

        (hh) Total monthly amount received by hh from
               migrants or friends (deflated)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,092
25%            0              0       Sum of Wgt.      10,092

50%            0                      Mean           21.81441
                        Largest       Std. Dev.      81.00085
75%            0       984.6155
90%     50.75338       994.7662       Variance       6561.138
95%     126.8834       994.7662       Skewness       5.318407
99%     497.3831       1020.143       Kurtosis       36.41679

       Monthly Amount Borrowed Deflated (borrowed over
              last 12 mths -- both active & fu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,070
25%            0              0       Sum of Wgt.      10,070

50%            0                      Mean           15.21801
                        Largest       Std. Dev.      105.5583
75%            0       2537.669
90%     10.15068       3552.736       Variance       11142.55
95%     60.90405       3552.736       Skewness       22.57731
99%     329.8969       4973.831       Kurtosis       798.8026

     (hh) Monthly Wage from work in outside hh activity
                 during last week (deflated)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               9,428
25%            0              0       Sum of Wgt.       9,428

50%     681.4026                      Mean           1065.761
                        Largest       Std. Dev.      3729.517
75%     1300.387       109268.9
90%     2340.696       132470.4       Variance       1.39e+07
95%     3120.928       160756.4       Skewness       30.42033
99%     6501.933       175448.2       Kurtosis       1174.544

                       amount_p_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               9,858
25%            0              0       Sum of Wgt.       9,858

50%            0                      Mean           13.14853
                        Largest       Std. Dev.       291.916
75%     7.081752        4180.81
90%     20.00595       4711.401       Variance       85214.95
95%     32.06081       5123.475       Skewness       80.34398
99%      95.2519       26812.89       Kurtosis       7234.042

           Actual Transfer - monthly PPAE (DiMaro)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     10.83989              0       Obs              10,414
25%     26.20657              0       Sum of Wgt.      10,414

50%     43.59727                      Mean             51.695
                        Largest       Std. Dev.      41.49997
75%     69.15729       424.0025
90%     98.71634       491.5764       Variance       1722.248
95%     123.8651        503.549       Skewness       2.445173
99%     193.7883       649.9241       Kurtosis       17.71808

                       amount_p_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               9,858
25%            0              0       Sum of Wgt.       9,858

50%            0                      Mean           13.14853
                        Largest       Std. Dev.       291.916
75%     7.081752        4180.81
90%     20.00595       4711.401       Variance       85214.95
95%     32.06081       5123.475       Skewness       80.34398
99%      95.2519       26812.89       Kurtosis       7234.042

                     amount_t_pb_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%     15.14731              0       Obs              10,414
25%     28.36475              0       Sum of Wgt.      10,414

50%     46.98993                      Mean           64.14154
                        Largest       Std. Dev.      288.2988
75%     77.12783       4234.964
90%     110.7623       4716.642       Variance        83116.2
95%     141.6071       5218.009       Skewness       80.14252
99%     237.8058       27000.82       Kurtosis       7345.669

                     amount_t_pr_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,092
25%            0              0       Sum of Wgt.      10,092

50%            0                      Mean           6.166622
                        Largest       Std. Dev.      26.29208
75%            0       497.3831
90%     11.73488       497.3831       Variance       691.2737
95%     32.79701       497.3831       Skewness       8.129972
99%     126.8834       497.3831       Kurtosis       98.63375

                    outwage_lw_hh_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               9,428
25%            0              0       Sum of Wgt.       9,428

50%     139.0005                      Mean           219.8474
                        Largest       Std. Dev.      625.7688
75%     279.1437       19669.08
90%     468.1392       20297.53       Variance       391586.5
95%     637.3577       20763.38       Skewness       23.38202
99%     1310.164        26078.5       Kurtosis       737.0471

                  amount_borrowed_m_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              10,070
25%            0              0       Sum of Wgt.      10,070

50%            0                      Mean           3.277272
                        Largest       Std. Dev.        22.575
75%            0       536.5051
90%     2.063145       549.9592       Variance       509.6306
95%     13.47435       840.1741       Skewness        18.8998
99%     73.34303       847.9084       Kurtosis       529.2096

             Consumption - monthly PPAE (DiMaro)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     31.34734       .4772817
 5%     58.78982       2.321737
10%     75.69051       5.306687       Obs              10,414
25%     113.4545        5.79399       Sum of Wgt.      10,414

50%     171.1318                      Mean           211.3988
                        Largest       Std. Dev.      198.2381
75%     254.4672       3224.009
90%     365.6441       3487.435       Variance       39298.34
95%     471.0854       4089.742       Skewness       10.65133
99%     825.9859       7968.342       Kurtosis       281.3149

                      Food expenditures
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     124.1504              0
10%     175.8798              0       Obs              10,414
25%     279.3385              0       Sum of Wgt.      10,414

50%     426.7671                      Mean           533.9393
                        Largest       Std. Dev.      704.0939
75%     628.5116       13674.65
90%     878.1057        14085.9       Variance       495748.2
95%     1095.369       14329.03       Skewness       11.38919
99%      2115.73        16475.8       Kurtosis        175.517

                    Non-Food expenditures
-------------------------------------------------------------
      Percentiles      Smallest
 1%     6.056705              0
 5%     34.21017              0
10%     57.01696              0       Obs              10,414
25%      117.749              0       Sum of Wgt.      10,414

50%     232.9399                      Mean           338.9211
                        Largest       Std. Dev.      346.8007
75%     438.5696       3227.631
90%     742.6486       3253.116       Variance       120270.7
95%     1005.642       3415.623       Skewness       2.725149
99%     1690.616       4080.458       Kurtosis       14.83089

                       foodexp_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     27.61492              0
10%     39.60309              0       Obs              10,414
25%     61.10884              0       Sum of Wgt.      10,414

50%     95.18599                      Mean           125.7729
                        Largest       Std. Dev.      227.1235
75%     141.9779       5729.025
90%     205.0735        5794.98       Variance       51585.07
95%       260.19        6750.68       Skewness        18.1098
99%     554.4923       9104.365       Kurtosis       478.0616

                      nonfoodexp_pp_ae2
-------------------------------------------------------------
      Percentiles      Smallest
 1%      2.02763              0
 5%      9.27247              0
10%     14.33813              0       Obs              10,414
25%     26.75799              0       Sum of Wgt.      10,414

50%     50.39221                      Mean           75.76732
                        Largest       Std. Dev.      87.40511
75%     93.85594       1357.454
90%     162.9501       1480.582       Variance       7639.653
95%      222.066       1555.965       Skewness       5.141206
99%       403.38       1635.335       Kurtosis       56.39658

. foreach x in consumo consumo_pp_ae consumo_pp_ae2 
> homeprod homeprod_pp_ae homeprod_pp_ae2 foodexp foodexp_pp_ae foodexp_pp_ae2 nonfoodexp nonfoodexp_pp_ae nonfoodexp_pp_ae2 
>  
> witransfer_act_m witransfer_act_m_pp_ae witransfer_act_m_pp_ae2 amount_p amount_p_pp_ae amount_p_pp_ae2 
> amount_t_pb amount_t_pb_pp_ae amount_t_pb_pp_ae2 amount_t_pr amount_t_pr_pp_ae amount_t_pr_pp_ae2 
> amount_borrowed_m amount_borrowed_m_pp_ae amount_borrowed_m_pp_ae2 outwage_lw_hh outwage_lw_hh_pp_ae outwage_lw_hh_pp_ae2 {
> ;
  2.         xtile `x'_tl_t2 = `x' if t2_c1_op ~=., nq(200);
  3.         xtile `x'_tl_tr = `x' if treatcom ~=. & ineligible ==1, nq(200);
  4. };

. *=================*
>  Final Globals - final set of controls
> *=================*;
. gl basic                nbani197 nbani297 ha97;

. gl controls             no497 big497
>                                 age_hh age_hh2 female_hh educ1_hh ethnicity_hh 
>                                 age_sp age_sp2 educ1_sp                         
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p 
>                                 homeown97 dirtfloor97 electricity97 
>                                 org_faenas min_dist lnup_cwagepm up2_mcwagepm
>                                 dummy_age_hh dummy_educ_hh dummy_ethnicity_hh dummy_age_sp dummy_educ_sp
>                                 dummy_dage0_7_97 dummy_dirtfloor97 dummy_electricity97 /*i.state*/;

.                         *======================================================
>  ITT results: wave 7 - Eligibles -- Consumption & Other Income Sources (Table 5)
>                 Trim top & bottom 1% consumption distribution, top 2% of distrib of other vars (5% for wages).
> *=======================================================;
. foreach x in consumo_pp_ae2 foodexp_pp_ae2 nonfoodexp_pp_ae2 {;
  2.         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_t2 >2 & consumo_pp_ae2_tl_t2 <199, cl(comui
> d);
  3.         sum `x' if e(sample) & t2_c1_op ==0;
  4.         scalar mean =r(mean);
  5.         estadd scalar mean;
  6.         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
  7.         scalar mean_p =r(mean);
  8.         estadd scalar mean_p;
  9.         scalar sd =r(sd);
 10.         estadd scalar sd;
 11.         sum d`x' if e(sample);
 12.         scalar prop =r(mean);
 13.         estadd scalar prop;
 14.         est store `x', title (`x');
 15. };
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     10,166
                                                F(33, 499)        =      19.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1240
                                                Root MSE          =     115.48

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
     consumo_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   10.83634   4.832307     2.24   0.025     1.342163    20.33051
           nbani197 |   .2379948   1.698291     0.14   0.889    -3.098687    3.574677
           nbani297 |   3.438168   .9896848     3.47   0.001     1.493705    5.382631
               ha97 |  -.2730041   .8025509    -0.34   0.734    -1.849799    1.303791
      hhsize_ae2_97 |  -6.179905   .9165484    -6.74   0.000    -7.980674   -4.379135
              no497 |   1.085243   4.512022     0.24   0.810    -7.779659    9.950144
             big497 |    6.95862   4.825458     1.44   0.150      -2.5221    16.43934
             age_hh |   .7025292     .57342     1.23   0.221    -.4240859    1.829144
            age_hh2 |  -.0099408   .0052795    -1.88   0.060    -.0203137     .000432
          female_hh |   28.17649   6.146205     4.58   0.000     16.10086    40.25212
           educ1_hh |  -14.04889   3.734194    -3.76   0.000    -21.38557   -6.712208
       ethnicity_hh |   -29.6915   5.127286    -5.79   0.000    -39.76523   -19.61777
             age_sp |   .7487252   .4031718     1.86   0.064    -.0433983    1.540849
            age_sp2 |  -.0008526   .0036046    -0.24   0.813    -.0079347    .0062295
           educ1_sp |  -20.88502   3.378223    -6.18   0.000    -27.52232   -14.24773
         dage0_7_97 |  -20.87082   3.741907    -5.58   0.000    -28.22265   -13.51899
        dage8_17_97 |    16.3706   3.053788     5.36   0.000     10.37074    22.37047
       dage18_54_97 |  -3.219529   7.712168    -0.42   0.677    -18.37185    11.93279
         dage55p_97 |  -2.937272   3.384102    -0.87   0.386    -9.586116    3.711573
          homeown97 |   1.286654   4.952931     0.26   0.795    -8.444516    11.01782
        dirtfloor97 |  -30.54875    4.11342    -7.43   0.000     -38.6305   -22.46699
      electricity97 |   15.02415   4.543082     3.31   0.001     6.098227    23.95008
         org_faenas |   7.758002   6.175353     1.26   0.210    -4.374895     19.8909
           min_dist |  -.2556581   .0605242    -4.22   0.000    -.3745717   -.1367445
       lnup_cwagepm |   2.969595   .8421861     3.53   0.000     1.314927    4.624263
       up2_mcwagepm |   -21.6765   10.09914    -2.15   0.032    -41.51859   -1.834421
       dummy_age_hh |     41.261   28.61554     1.44   0.150     -14.9608     97.4828
      dummy_educ_hh |  -26.76971   17.26064    -1.55   0.122    -60.68221    7.142777
 dummy_ethnicity_hh |   94.44654   36.10854     2.62   0.009     23.50303      165.39
       dummy_age_sp |   17.97877   27.60907     0.65   0.515    -36.26558    72.22312
      dummy_educ_sp |  -6.937665   27.01907    -0.26   0.797    -60.02283    46.14751
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -23.93444   26.76296    -0.89   0.372    -76.51642    28.64754
dummy_electricity97 |   168.1055   33.10655     5.08   0.000     103.0601     233.151
              _cons |    245.582   19.07488    12.87   0.000     208.1051     283.059
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
consumo_p~e2 |      3,860    193.7149    118.3447   31.50829   825.9859

added scalar:
               e(mean) =  193.71492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
consumo_p~e2 |      3,860    193.7149    118.3447   31.50829   825.9859

added scalar:
             e(mean_p) =  193.71492

added scalar:
                 e(sd) =  118.34466

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dconsumo_p~2 |     10,166           1           0          1          1

added scalar:
               e(prop) =  1
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     10,166
                                                F(33, 499)        =       8.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0281
                                                Root MSE          =     157.41

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
     foodexp_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   7.947446   4.458956     1.78   0.075    -.8131953    16.70809
           nbani197 |  -.3231093   1.317126    -0.25   0.806    -2.910906    2.264687
           nbani297 |  -.5407342   .6639092    -0.81   0.416    -1.845136    .7636678
               ha97 |  -1.410952   .7208822    -1.96   0.051     -2.82729    .0053866
      hhsize_ae2_97 |  -5.489123   1.190141    -4.61   0.000    -7.827428   -3.150818
              no497 |   6.339326   9.242837     0.69   0.493    -11.82035      24.499
             big497 |   11.24703   5.400444     2.08   0.038     .6366203    21.85744
             age_hh |   .6913893   .5541651     1.25   0.213    -.3973951    1.780174
            age_hh2 |  -.0096588   .0053272    -1.81   0.070    -.0201252    .0008077
          female_hh |   16.35356   8.576669     1.91   0.057    -.4972712     33.2044
           educ1_hh |   6.824994   4.675322     1.46   0.145    -2.360748    16.01074
       ethnicity_hh |   -12.8917   4.174488    -3.09   0.002    -21.09344   -4.689965
             age_sp |  -.4854869   .5840853    -0.83   0.406    -1.633057    .6620827
            age_sp2 |   .0089448   .0057323     1.56   0.119    -.0023175    .0202071
           educ1_sp |  -13.73828   4.535541    -3.03   0.003    -22.64939   -4.827164
         dage0_7_97 |  -12.98028   4.625471    -2.81   0.005    -22.06807   -3.892478
        dage8_17_97 |   4.537423   4.427206     1.02   0.306    -4.160839    13.23568
       dage18_54_97 |  -27.00601   17.71032    -1.52   0.128      -61.802    7.789987
         dage55p_97 |  -1.777448   3.843118    -0.46   0.644    -9.328135    5.773239
          homeown97 |  -4.525045   6.569649    -0.69   0.491    -17.43263    8.382537
        dirtfloor97 |  -11.91086   3.756114    -3.17   0.002    -19.29061   -4.531112
      electricity97 |   5.267682   4.078028     1.29   0.197     -2.74454     13.2799
         org_faenas |   9.496031    5.86019     1.62   0.106    -2.017657    21.00972
           min_dist |   .0365394   .0511852     0.71   0.476    -.0640257    .1371044
       lnup_cwagepm |   1.799441   .7685492     2.34   0.020     .2894498    3.309432
       up2_mcwagepm |  -20.37747   5.828702    -3.50   0.001    -31.82929   -8.925649
       dummy_age_hh |   4.789707   21.14942     0.23   0.821    -36.76317    46.34258
      dummy_educ_hh |  -5.866225   11.66195    -0.50   0.615    -28.77879    17.04634
 dummy_ethnicity_hh |   59.76584   23.80631     2.51   0.012     12.99288    106.5388
       dummy_age_sp |   19.88685   27.43884     0.72   0.469    -34.02305    73.79674
      dummy_educ_sp |   -12.4975   26.79173    -0.47   0.641    -65.13599      40.141
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   61.22994   85.84865     0.71   0.476    -107.4394    229.8993
dummy_electricity97 |   113.9403   53.50948     2.13   0.034     8.808683     219.072
              _cons |   167.0404   22.54928     7.41   0.000     122.7371    211.3436
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
foodexp_p~e2 |      3,860    114.7123    155.6196          0   4761.791

added scalar:
               e(mean) =  114.71229

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
foodexp_p~e2 |      3,826    115.7317    155.9317    3.15719   4761.791

added scalar:
             e(mean_p) =  115.73169

added scalar:
                 e(sd) =  155.93173

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dfoodexp_p~2 |     10,166    .9918355    .0899923          0          1

added scalar:
               e(prop) =  .99183553
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =     10,166
                                                F(33, 499)        =      16.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1263
                                                Root MSE          =     66.809

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
  nonfoodexp_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    2.37288   2.543027     0.93   0.351     -2.62348    7.369241
           nbani197 |  -.7964118     1.0337    -0.77   0.441    -2.827353     1.23453
           nbani297 |   2.017869    .625744     3.22   0.001      .788451    3.247286
               ha97 |   .2250865   .5206715     0.43   0.666     -.797892    1.248065
      hhsize_ae2_97 |  -1.818542   .4967108    -3.66   0.000    -2.794444   -.8426395
              no497 |  -1.594027   2.286899    -0.70   0.486    -6.087164    2.899111
             big497 |   2.153856   3.003587     0.72   0.474    -3.747379    8.055091
             age_hh |  -.2211455   .4352684    -0.51   0.612     -1.07633    .6340392
            age_hh2 |   .0003687   .0041209     0.09   0.929    -.0077276    .0084651
          female_hh |   13.29374   3.810563     3.49   0.001     5.807017    20.78047
           educ1_hh |  -13.31954   2.038696    -6.53   0.000    -17.32503   -9.314057
       ethnicity_hh |  -13.66503   2.909827    -4.70   0.000    -19.38205   -7.948004
             age_sp |   .5270092   .2183833     2.41   0.016     .0979452    .9560732
            age_sp2 |  -.0019787   .0019124    -1.03   0.301    -.0057361    .0017787
           educ1_sp |  -13.00933   2.122379    -6.13   0.000    -17.17923   -8.839425
         dage0_7_97 |  -6.375005   2.134726    -2.99   0.003    -10.56916   -2.180846
        dage8_17_97 |   13.12466   1.842842     7.12   0.000     9.503978    16.74535
       dage18_54_97 |   1.755054   4.042763     0.43   0.664    -6.187881    9.697988
         dage55p_97 |  -3.691479   1.892773    -1.95   0.052    -7.410265    .0273068
          homeown97 |  -.1386198   2.789892    -0.05   0.960    -5.620002    5.342763
        dirtfloor97 |  -18.64241   2.319905    -8.04   0.000    -23.20039   -14.08442
      electricity97 |   13.86999    2.34532     5.91   0.000     9.262069    18.47791
         org_faenas |   6.153134   3.212942     1.92   0.056    -.1594281     12.4657
           min_dist |  -.2181254   .0331197    -6.59   0.000    -.2831967   -.1530541
       lnup_cwagepm |   1.240974   .4338014     2.86   0.004     .3886714    2.093276
       up2_mcwagepm |  -5.665885   5.675327    -1.00   0.319    -16.81637    5.484597
       dummy_age_hh |    18.4477   18.05508     1.02   0.307    -17.02565    53.92105
      dummy_educ_hh |  -23.19524   11.49654    -2.02   0.044    -45.78282   -.6076545
 dummy_ethnicity_hh |   47.32684   24.20106     1.96   0.051    -.2217016    94.87537
       dummy_age_sp |    12.8649   14.25589     0.90   0.367    -15.14407    40.87386
      dummy_educ_sp |  -11.36588   13.87036    -0.82   0.413    -38.61738    15.88562
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -13.57038   14.07585    -0.96   0.335    -41.22561    14.08486
dummy_electricity97 |   43.76108   30.95089     1.41   0.158    -17.04904    104.5712
              _cons |   107.1732   11.61942     9.22   0.000     84.34418    130.0022
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
nonfoodex~e2 |      3,860    71.88938    69.17518          0   690.5621

added scalar:
               e(mean) =  71.88938

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
nonfoodex~e2 |      3,836    72.33916    69.15639   .1761694   690.5621

added scalar:
             e(mean_p) =  72.339157

added scalar:
                 e(sd) =  69.156393

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dnonfoodex~2 |     10,166    .9929176    .0838628          0          1

added scalar:
               e(prop) =  .99291757

. foreach x in homeprod_pp_ae2 witransfer_act_m_pp_ae2 amount_p_pp_ae2 amount_t_pb_pp_ae2 amount_t_pr_pp_ae2 amount_borrowed_
> m_pp_ae2 {;
  2.         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_t2 >2 & consumo_pp_ae2_tl_t2 <199 & `x'_tl_
> t2 <=196, cl(comuid);
  3.         sum `x' if e(sample) & t2_c1_op ==0;
  4.         scalar mean =r(mean);
  5.         estadd scalar mean;
  6.         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
  7.         scalar mean_p =r(mean);
  8.         estadd scalar mean_p;
  9.         scalar sd =r(sd);
 10.         estadd scalar sd;
 11.         sum d`x' if e(sample);
 12.         scalar prop =r(mean);
 13.         estadd scalar prop;
 14.         est store `x', title (`x');
 15. };
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =      9,984
                                                F(33, 499)        =       5.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0302
                                                Root MSE          =     21.081

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
    homeprod_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   2.038004   1.091432     1.87   0.062    -.1063651    4.182373
           nbani197 |   1.020898   .4012243     2.54   0.011     .2326013    1.809195
           nbani297 |   .7968693   .1559326     5.11   0.000      .490504    1.103235
               ha97 |   .1939307   .1464511     1.32   0.186    -.0938061    .4816675
      hhsize_ae2_97 |   -.137472   .1591408    -0.86   0.388    -.4501405    .1751965
              no497 |  -1.297901   1.099215    -1.18   0.238    -3.457562    .8617596
             big497 |   .0526619   .9379606     0.06   0.955    -1.790177    1.895501
             age_hh |   .2244444   .0700243     3.21   0.001     .0868656    .3620231
            age_hh2 |  -.0018474   .0006465    -2.86   0.004    -.0031176   -.0005772
          female_hh |    1.07392   1.105625     0.97   0.332    -1.098334    3.246175
           educ1_hh |   1.547777   .6238834     2.48   0.013     .3220149    2.773539
       ethnicity_hh |  -2.600063   1.215071    -2.14   0.033    -4.987349    -.212776
             age_sp |   .0022778   .0577541     0.04   0.969    -.1111934     .115749
            age_sp2 |   .0001651   .0005029     0.33   0.743    -.0008229    .0011532
           educ1_sp |  -.7020182   .7100979    -0.99   0.323    -2.097168    .6931321
         dage0_7_97 |  -1.424464   .6914738    -2.06   0.040    -2.783023    -.065905
        dage8_17_97 |   1.124228   .5410778     2.08   0.038     .0611566      2.1873
       dage18_54_97 |    2.11518   1.218316     1.74   0.083     -.278482    4.508841
         dage55p_97 |   .1447697   .5552537     0.26   0.794    -.9461535    1.235693
          homeown97 |   .3296794   1.072052     0.31   0.759    -1.776613    2.435972
        dirtfloor97 |   1.615655   .6446812     2.51   0.013     .3490307    2.882279
      electricity97 |   .5958948   .9584322     0.62   0.534    -1.287165    2.478955
         org_faenas |   -3.63867   2.248176    -1.62   0.106    -8.055727    .7783862
           min_dist |  -.0064679   .0116052    -0.56   0.578    -.0292689    .0163331
       lnup_cwagepm |  -.0756596   .2035986    -0.37   0.710    -.4756758    .3243566
       up2_mcwagepm |  -1.743387    1.38931    -1.25   0.210    -4.473007    .9862317
       dummy_age_hh |   3.499842   3.407895     1.03   0.305    -3.195749    10.19543
      dummy_educ_hh |  -3.449424   3.039301    -1.13   0.257    -9.420827     2.52198
 dummy_ethnicity_hh |   .9517476   3.990477     0.24   0.812     -6.88846    8.791955
       dummy_age_sp |   -3.43484   3.452763    -0.99   0.320    -10.21859    3.348906
      dummy_educ_sp |   1.503248   3.501426     0.43   0.668    -5.376106    8.382602
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -6.026589   3.213717    -1.88   0.061    -12.34067    .2874957
dummy_electricity97 |   6.631922   16.20241     0.41   0.682    -25.20143    38.46527
              _cons |   6.447116   3.469886     1.86   0.064    -.3702713     13.2645
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
homeprod_~e2 |      3,783    12.39789    20.19941          0   105.6378

added scalar:
               e(mean) =  12.39789

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
homeprod_~e2 |      1,874    25.02733    22.53053   .4556849   105.6378

added scalar:
             e(mean_p) =  25.027332

added scalar:
                 e(sd) =  22.530531

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dhomeprod_~2 |      9,984    .5103165    .4999186          0          1

added scalar:
               e(prop) =  .51031651
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =      9,977
                                                F(33, 499)        =      31.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1239
                                                Root MSE          =     30.859

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
witransfer_act_m~e2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -1.723832   1.328017    -1.30   0.195    -4.333026    .8853609
           nbani197 |  -1.205029   .4009366    -3.01   0.003    -1.992761   -.4172969
           nbani297 |  -.0031264   .2131357    -0.01   0.988    -.4218803    .4156276
               ha97 |   .2789568   .1927376     1.45   0.148    -.0997204     .657634
      hhsize_ae2_97 |  -.4990098   .2626898    -1.90   0.058    -1.015124    .0171046
              no497 |  -4.484797   1.141118    -3.93   0.000    -6.726785   -2.242809
             big497 |   .3958426   1.264745     0.31   0.754    -2.089038    2.880723
             age_hh |    .524761   .1371283     3.83   0.000     .2553411     .794181
            age_hh2 |   -.004026   .0013266    -3.03   0.003    -.0066324   -.0014196
          female_hh |   4.608566   1.571892     2.93   0.004     1.520223    7.696909
           educ1_hh |   -7.42225    .988744    -7.51   0.000    -9.364864   -5.479635
       ethnicity_hh |   3.632515   1.563394     2.32   0.021     .5608695    6.704161
             age_sp |   .2608834   .0909574     2.87   0.004     .0821767      .43959
            age_sp2 |  -.0016043   .0008134    -1.97   0.049    -.0032024   -6.30e-06
           educ1_sp |  -9.096084   .9457987    -9.62   0.000    -10.95432   -7.237846
         dage0_7_97 |   8.019178   1.129782     7.10   0.000     5.799462    10.23889
        dage8_17_97 |   16.03496   .9454147    16.96   0.000     14.17748    17.89244
       dage18_54_97 |  -14.65217    2.15754    -6.79   0.000    -18.89115   -10.41319
         dage55p_97 |  -3.802602   .8516526    -4.46   0.000    -5.475869   -2.129336
          homeown97 |   1.147264   1.271067     0.90   0.367    -1.350038    3.644567
        dirtfloor97 |  -1.388655   .8452631    -1.64   0.101    -3.049368     .272058
      electricity97 |   5.383088   1.293884     4.16   0.000     2.840957    7.925219
         org_faenas |   3.652981   3.295907     1.11   0.268    -2.822585    10.12855
           min_dist |   .0397667   .0150103     2.65   0.008     .0102755     .069258
       lnup_cwagepm |   .5984217   .2545298     2.35   0.019     .0983395    1.098504
       up2_mcwagepm |  -15.04961   2.942327    -5.11   0.000    -20.83049   -9.268738
       dummy_age_hh |   12.63151   7.885801     1.60   0.110    -2.861958    28.12497
      dummy_educ_hh |  -4.251906   5.639897    -0.75   0.451    -15.33278    6.828966
 dummy_ethnicity_hh |   6.553447   8.157621     0.80   0.422    -9.474071    22.58096
       dummy_age_sp |   14.46672   5.658778     2.56   0.011     3.348751    25.58469
      dummy_educ_sp |  -9.869696    5.63641    -1.75   0.081    -20.94372    1.204323
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -.4563436   6.784361    -0.07   0.946    -13.78578    12.87309
dummy_electricity97 |  -11.18805   7.009432    -1.60   0.111    -24.95968    2.583591
              _cons |   24.30805   5.797639     4.19   0.000     12.91726    35.69884
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
witransfe~e2 |      3,783    49.44846    32.81112          0   159.7033

added scalar:
               e(mean) =  49.44846

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
witransfe~e2 |      3,497    53.49257    30.79367   2.782963   159.7033

added scalar:
             e(mean_p) =  53.492572

added scalar:
                 e(sd) =  30.793666

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dwitransfe~2 |      9,977    .9061842    .2915869          0          1

added scalar:
               e(prop) =  .90618422
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =      9,441
                                                F(33, 499)        =      20.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1437
                                                Root MSE          =     8.9374

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
    amount_p_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .1530104   .3996632     0.38   0.702    -.6322196    .9382404
           nbani197 |   .8269005   .2282528     3.62   0.000     .3784455    1.275356
           nbani297 |   .3010559   .0753005     4.00   0.000     .1531108    .4490009
               ha97 |     .48757   .1006608     4.84   0.000     .2897988    .6853412
      hhsize_ae2_97 |  -.0001587   .0896206    -0.00   0.999     -.176239    .1759215
              no497 |   -1.36804   .2134066    -6.41   0.000    -1.787326   -.9487539
             big497 |   3.770413   .5953998     6.33   0.000     2.600613    4.940212
             age_hh |   .1431425   .0358528     3.99   0.000     .0727015    .2135835
            age_hh2 |  -.0010211   .0003416    -2.99   0.003    -.0016922     -.00035
          female_hh |  -1.719595   .3993606    -4.31   0.000    -2.504231   -.9349597
           educ1_hh |  -.1067951   .2619336    -0.41   0.684    -.6214238    .4078335
       ethnicity_hh |   .0338928   .3868805     0.09   0.930    -.7262226    .7940083
             age_sp |  -.0133141   .0276836    -0.48   0.631    -.0677048    .0410766
            age_sp2 |   .0001055   .0002363     0.45   0.656    -.0003588    .0005697
           educ1_sp |  -.0853752   .2385865    -0.36   0.721    -.5541332    .3833827
         dage0_7_97 |  -1.225836   .3293324    -3.72   0.000    -1.872885   -.5787867
        dage8_17_97 |   .3077894   .2677439     1.15   0.251     -.218255    .8338338
       dage18_54_97 |   1.405132   .6411104     2.19   0.029     .1455234     2.66474
         dage55p_97 |   .3166447   .2937255     1.08   0.282    -.2604464    .8937358
          homeown97 |   1.656366   .2710065     6.11   0.000     1.123911     2.18882
        dirtfloor97 |   -.832132   .3027428    -2.75   0.006     -1.42694   -.2373244
      electricity97 |   .9762793   .3455117     2.83   0.005     .2974424    1.655116
         org_faenas |  -.3939024   .7397647    -0.53   0.595     -1.84734    1.059535
           min_dist |   .0085605   .0050591     1.69   0.091    -.0013792    .0185003
       lnup_cwagepm |  -.0024751   .0621059    -0.04   0.968    -.1244964    .1195462
       up2_mcwagepm |  -1.529623   .7956928    -1.92   0.055    -3.092944     .033698
       dummy_age_hh |    2.00141   1.923116     1.04   0.299    -1.776992    5.779813
      dummy_educ_hh |   .9621938   1.757662     0.55   0.584    -2.491137    4.415525
 dummy_ethnicity_hh |  -5.377003    1.91054    -2.81   0.005    -9.130698   -1.623308
       dummy_age_sp |  -.4680335   1.759858    -0.27   0.790    -3.925678    2.989611
      dummy_educ_sp |   .9914956   1.714816     0.58   0.563    -2.377654    4.360646
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -.5792703   1.725771    -0.34   0.737    -3.969943    2.811402
dummy_electricity97 |   1.771693   3.331786     0.53   0.595    -4.774364     8.31775
              _cons |  -3.711929   1.486799    -2.50   0.013    -6.633087   -.7907714
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amount_p_~e2 |      3,617    4.575356    9.689367          0   59.62756

added scalar:
               e(mean) =  4.575356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amount_p_~e2 |        981    16.86958    11.78143   .2500744   59.62756

added scalar:
             e(mean_p) =  16.869585

added scalar:
                 e(sd) =  11.781428

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
damount_p_~2 |      9,441    .2812202    .4496185          0          1

added scalar:
               e(prop) =  .28122021
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =      9,978
                                                F(33, 499)        =      34.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1365
                                                Root MSE          =     34.221

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
 amount_t_pb_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -2.418686   1.443447    -1.68   0.094    -5.254669    .4172965
           nbani197 |   .1131554   .5581444     0.20   0.839    -.9834472    1.209758
           nbani297 |   .4241972   .2566545     1.65   0.099    -.0800595    .9284539
               ha97 |   .9602068   .2301465     4.17   0.000     .5080312    1.412382
      hhsize_ae2_97 |  -.6709616   .2951699    -2.27   0.023    -1.250891   -.0910326
              no497 |  -5.479925   1.230814    -4.45   0.000    -7.898141   -3.061708
             big497 |   4.024531   1.407063     2.86   0.004     1.260033    6.789029
             age_hh |    .753762   .1497819     5.03   0.000     .4594811    1.048043
            age_hh2 |  -.0054705   .0014376    -3.81   0.000    -.0082951   -.0026459
          female_hh |   4.736283   1.733307     2.73   0.007     1.330805    8.141762
           educ1_hh |   -8.24332   1.123006    -7.34   0.000    -10.44972   -6.036917
       ethnicity_hh |   3.160197   1.685191     1.88   0.061    -.1507466    6.471141
             age_sp |   .2208202    .097381     2.27   0.024      .029493    .4121475
            age_sp2 |  -.0013886   .0008851    -1.57   0.117    -.0031276    .0003503
           educ1_sp |  -9.335512   .9908857    -9.42   0.000    -11.28233    -7.38869
         dage0_7_97 |    6.65102   1.240177     5.36   0.000     4.214409    9.087632
        dage8_17_97 |   16.69411   1.058274    15.77   0.000     14.61489    18.77333
       dage18_54_97 |  -13.89258   2.433303    -5.71   0.000    -18.67336   -9.111797
         dage55p_97 |  -2.950054   1.002677    -2.94   0.003    -4.920043   -.9800654
          homeown97 |   2.734206   1.402772     1.95   0.052     -.021861    5.490274
        dirtfloor97 |  -2.331776   .9812967    -2.38   0.018    -4.259759   -.4037939
      electricity97 |   7.233837   1.401854     5.16   0.000     4.479574      9.9881
         org_faenas |   2.962934   3.544324     0.84   0.404    -4.000703    9.926571
           min_dist |   .0516566   .0170712     3.03   0.003     .0181164    .0851968
       lnup_cwagepm |   .6269641   .2792865     2.24   0.025     .0782418    1.175686
       up2_mcwagepm |   -17.0551   3.418765    -4.99   0.000    -23.77205   -10.33815
       dummy_age_hh |   16.51083   8.824667     1.87   0.062    -.8272507    33.84892
      dummy_educ_hh |  -4.301128   5.713282    -0.75   0.452    -15.52618    6.923926
 dummy_ethnicity_hh |   4.846466   9.124643     0.53   0.596    -13.08099    22.77392
       dummy_age_sp |   13.19991   6.190486     2.13   0.033      1.03728    25.36254
      dummy_educ_sp |  -8.025919   6.248356    -1.28   0.200    -20.30225    4.250409
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -2.927563   7.303315    -0.40   0.689     -17.2766    11.42147
dummy_electricity97 |  -9.183829   9.052131    -1.01   0.311    -26.96882    8.601158
              _cons |   20.78217   6.071673     3.42   0.001     8.852971    32.71136
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amo~b_pp_ae2 |      3,791    55.82845    36.95018          0   188.0899

added scalar:
               e(mean) =  55.828453

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amo~b_pp_ae2 |      3,579    59.13542    35.36381   .9788264   188.0899

added scalar:
             e(mean_p) =  59.135419

added scalar:
                 e(sd) =  35.363805

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dam~b_pp_ae2 |      9,978    .9265384    .2609058          0          1

added scalar:
               e(prop) =  .92653838
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =      9,673
                                                F(33, 499)        =       9.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0477
                                                Root MSE          =     10.859

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
 amount_t_pr_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0061308   .3400032    -0.02   0.986    -.6741451    .6618835
           nbani197 |  -.2323805   .1849481    -1.26   0.210    -.5957534    .1309924
           nbani297 |   .2323999   .0828575     2.80   0.005     .0696074    .3951924
               ha97 |  -.0652086   .0775281    -0.84   0.401    -.2175304    .0871132
      hhsize_ae2_97 |   .3544216   .0890621     3.98   0.000     .1794386    .5294046
              no497 |  -.8935032   .2886766    -3.10   0.002    -1.460675   -.3263318
             big497 |   .6478565   .4550953     1.42   0.155    -.2462825    1.541995
             age_hh |   .0654276   .0368394     1.78   0.076    -.0069518     .137807
            age_hh2 |  -.0000127   .0003348    -0.04   0.970    -.0006704    .0006451
          female_hh |   3.775467     .63928     5.91   0.000     2.519455    5.031479
           educ1_hh |  -.0199301   .2537345    -0.08   0.937    -.5184496    .4785894
       ethnicity_hh |  -1.449733    .388477    -3.73   0.000    -2.212985   -.6864805
             age_sp |   .0280833    .025916     1.08   0.279    -.0228346    .0790011
            age_sp2 |  -.0000907   .0002247    -0.40   0.687    -.0005321    .0003508
           educ1_sp |   .7896431   .2818289     2.80   0.005     .2359256    1.343361
         dage0_7_97 |  -1.023272   .3736275    -2.74   0.006    -1.757349   -.2891952
        dage8_17_97 |   .4605592   .2379068     1.94   0.053    -.0068633    .9279817
       dage18_54_97 |  -2.170037   .8433564    -2.57   0.010    -3.827004   -.5130699
         dage55p_97 |  -.5891233   .3266387    -1.80   0.072     -1.23088    .0526334
          homeown97 |   .4877076   .3637345     1.34   0.181    -.2269323    1.202347
        dirtfloor97 |  -1.187127   .3819108    -3.11   0.002    -1.937479    -.436776
      electricity97 |   .2657956   .2815724     0.94   0.346    -.2874179    .8190091
         org_faenas |   .0703753   .5941921     0.12   0.906    -1.097051    1.237802
           min_dist |   .0025012   .0035548     0.70   0.482    -.0044829    .0094854
       lnup_cwagepm |    .126269   .0610881     2.07   0.039     .0062474    .2462905
       up2_mcwagepm |  -.8989722   .3766396    -2.39   0.017    -1.638967   -.1589773
       dummy_age_hh |  -.8500969   1.865876    -0.46   0.649    -4.516038    2.815845
      dummy_educ_hh |  -1.037782   1.058228    -0.98   0.327    -3.116914    1.041351
 dummy_ethnicity_hh |  -.8330344   1.408722    -0.59   0.555    -3.600793    1.934724
       dummy_age_sp |  -.2450255   1.462867    -0.17   0.867    -3.119163    2.629112
      dummy_educ_sp |   -.474429   1.457385    -0.33   0.745    -3.337797    2.388939
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |   .5785962   2.622481     0.22   0.825     -4.57387    5.731062
dummy_electricity97 |  -2.410481   .7759561    -3.11   0.002    -3.935024   -.8859369
              _cons |  -.7391532   1.620995    -0.46   0.649    -3.923969    2.445663
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amo~r_pp_ae2 |      3,712    3.213221    10.97269          0   88.03241

added scalar:
               e(mean) =  3.2132209

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amo~r_pp_ae2 |        605    19.71484    20.34397   .3718196   88.03241

added scalar:
             e(mean_p) =  19.714836

added scalar:
                 e(sd) =  20.343965

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dam~r_pp_ae2 |      9,673    .1543472    .3612999          0          1

added scalar:
               e(prop) =  .15434715
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =      9,632
                                                F(33, 499)        =       3.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0185
                                                Root MSE          =     4.5389

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
amount_borrowed_~e2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0656387   .1376344     0.48   0.634    -.2047756    .3360529
           nbani197 |   .0332003   .0784731     0.42   0.672    -.1209781    .1873787
           nbani297 |   .0386623   .0393759     0.98   0.327    -.0387007    .1160252
               ha97 |   .0033433   .0428284     0.08   0.938    -.0808029    .0874896
      hhsize_ae2_97 |   .0216602   .0405223     0.53   0.593    -.0579552    .1012756
              no497 |  -.0669213   .1723814    -0.39   0.698    -.4056042    .2717615
             big497 |   .3702882   .2207695     1.68   0.094    -.0634642    .8040405
             age_hh |  -.0053513    .017799    -0.30   0.764    -.0403215    .0296189
            age_hh2 |   3.02e-06    .000162     0.02   0.985    -.0003152    .0003212
          female_hh |   -.088942   .1639939    -0.54   0.588    -.4111457    .2332616
           educ1_hh |    .143999   .1308855     1.10   0.272    -.1131557    .4011536
       ethnicity_hh |  -.7353561   .1148245    -6.40   0.000    -.9609551   -.5097571
             age_sp |   -.002103   .0099076    -0.21   0.832    -.0215686    .0173627
            age_sp2 |  -.0000133   .0000713    -0.19   0.852    -.0001534    .0001267
           educ1_sp |  -.0145664   .1368428    -0.11   0.915    -.2834254    .2542927
         dage0_7_97 |   .1182111   .1354866     0.87   0.383    -.1479834    .3844056
        dage8_17_97 |   .0103262   .1138093     0.09   0.928    -.2132783    .2339306
       dage18_54_97 |   .1566475   .2013425     0.78   0.437     -.238936     .552231
         dage55p_97 |  -.0732821   .1260446    -0.58   0.561    -.3209255    .1743614
          homeown97 |  -.0802704   .2464206    -0.33   0.745    -.5644202    .4038795
        dirtfloor97 |  -.0409984   .1245505    -0.33   0.742    -.2857064    .2037096
      electricity97 |   .2024646   .1111928     1.82   0.069    -.0159992    .4209285
         org_faenas |  -.5233185   .2478343    -2.11   0.035    -1.010246   -.0363912
           min_dist |  -.0044611   .0014994    -2.98   0.003    -.0074069   -.0015152
       lnup_cwagepm |   .0335524   .0208976     1.61   0.109    -.0075058    .0746105
       up2_mcwagepm |  -.1219281   .3124676    -0.39   0.697    -.7358424    .4919862
       dummy_age_hh |  -1.166742   1.594349    -0.73   0.465    -4.299206    1.965723
      dummy_educ_hh |   .2872905   1.363005     0.21   0.833    -2.390645    2.965226
 dummy_ethnicity_hh |    .754374   2.418478     0.31   0.755    -3.997281    5.506029
       dummy_age_sp |   .5219357   .4035551     1.29   0.196    -.2709409    1.314812
      dummy_educ_sp |   -.679857    .421841    -1.61   0.108     -1.50866    .1489464
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -1.078326   .2054154    -5.25   0.000    -1.481912   -.6747405
dummy_electricity97 |  -.7115375    .245526    -2.90   0.004     -1.19393   -.2291452
              _cons |   1.983869   .6272601     3.16   0.002     .7514729    3.216265
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amount_bo~e2 |      3,654    1.070075    4.465495          0   39.77538

added scalar:
               e(mean) =  1.0700751

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
amount_bo~e2 |        327    11.95735    9.636546   .2721361   39.77538

added scalar:
             e(mean_p) =  11.957353

added scalar:
                 e(sd) =  9.6365456

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
damount_bo~2 |      9,632    .0904277    .2868085          0          1

added scalar:
               e(prop) =  .09042774

. foreach x in outwage_lw_hh_pp_ae2 {;
  2.         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_t2 >2 & consumo_pp_ae2_tl_t2 <199 & `x'_tl_
> t2 <=190, cl(comuid);
  3.         sum `x' if e(sample) & t2_c1_op ==0;
  4.         scalar mean =r(mean);
  5.         estadd scalar mean;
  6.         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
  7.         scalar mean_p =r(mean);
  8.         estadd scalar mean_p;
  9.         scalar sd =r(sd);
 10.         estadd scalar sd;
 11.         sum d`x' if e(sample);
 12.         scalar prop =r(mean);
 13.         estadd scalar prop;
 14.         est store `x', title (`x');
 15. };
note: dummy_dage0_7_97 omitted because of collinearity

Linear regression                               Number of obs     =      8,754
                                                F(33, 498)        =      12.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0707
                                                Root MSE          =     154.12

                                      (Std. Err. adjusted for 499 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
outwage_lw_hh_pp~e2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   4.068413   6.214593     0.65   0.513    -8.141641    16.27847
           nbani197 |  -5.634028   2.476213    -2.28   0.023    -10.49914   -.7689163
           nbani297 |  -4.704912   .9350719    -5.03   0.000    -6.542084   -2.867739
               ha97 |  -2.618439   1.075113    -2.44   0.015    -4.730757    -.506122
      hhsize_ae2_97 |   -3.51765   1.314946    -2.68   0.008    -6.101176   -.9341237
              no497 |   14.22765   6.198272     2.30   0.022     2.049667    26.40564
             big497 |  -4.433599   6.490524    -0.68   0.495    -17.18578    8.318585
             age_hh |  -.8939677    .850066    -1.05   0.293    -2.564125      .77619
            age_hh2 |  -.0048872   .0078981    -0.62   0.536    -.0204048    .0106304
          female_hh |  -29.91255   10.55772    -2.83   0.005    -50.65572   -9.169388
           educ1_hh |    3.64831   4.434045     0.82   0.411    -5.063431    12.36005
       ethnicity_hh |  -36.01182   6.407346    -5.62   0.000    -48.60058   -23.42306
             age_sp |   1.580423   .6042017     2.62   0.009     .3933247    2.767522
            age_sp2 |  -.0077425   .0056652    -1.37   0.172    -.0188731    .0033882
           educ1_sp |   2.468415   4.981767     0.50   0.620    -7.319457    12.25629
         dage0_7_97 |  -16.22749   5.392699    -3.01   0.003    -26.82274   -5.632246
        dage8_17_97 |   19.51019   4.448775     4.39   0.000     10.76951    28.25088
       dage18_54_97 |   57.47358    10.0367     5.73   0.000     37.75408    77.19308
         dage55p_97 |  -1.446048   4.903789    -0.29   0.768    -11.08071    8.188618
          homeown97 |  -16.59364   8.146921    -2.04   0.042    -32.60021   -.5870645
        dirtfloor97 |  -18.15694   4.717082    -3.85   0.000    -27.42477   -8.889105
      electricity97 |   .4535319   5.075427     0.09   0.929    -9.518356    10.42542
         org_faenas |    11.1486   9.617485     1.16   0.247    -7.747252    30.04444
           min_dist |  -.2780519   .0820167    -3.39   0.001    -.4391934   -.1169104
       lnup_cwagepm |    4.16715   .9825555     4.24   0.000     2.236685    6.097615
       up2_mcwagepm |  -4.550613   12.05414    -0.38   0.706    -28.23385    19.13263
       dummy_age_hh |   .7797405   45.00592     0.02   0.986    -87.64514    89.20462
      dummy_educ_hh |   42.41334   37.57515     1.13   0.260    -31.41201    116.2387
 dummy_ethnicity_hh |  -53.74893   49.30782    -1.09   0.276    -150.6259    43.12807
       dummy_age_sp |   93.64036    37.8549     2.47   0.014     19.26537    168.0154
      dummy_educ_sp |  -68.49484   37.88154    -1.81   0.071    -142.9222    5.932497
   dummy_dage0_7_97 |          0  (omitted)
  dummy_dirtfloor97 |  -86.88182   23.15223    -3.75   0.000    -132.3699   -41.39372
dummy_electricity97 |   145.9587   139.8596     1.04   0.297    -128.8289    420.7464
              _cons |   173.3213    25.5562     6.78   0.000       123.11    223.5325
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outwage_l~e2 |      3,303     154.411    156.6222          0    634.335

added scalar:
               e(mean) =  154.41097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outwage_l~e2 |      2,153    236.8878    134.5083    3.17219    634.335

added scalar:
             e(mean_p) =  236.8878

added scalar:
                 e(sd) =  134.50828

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
doutwage_l~2 |      8,754    .6602696    .4736447          0          1

added scalar:
               e(prop) =  .66026959

. ***Output Table 5;
. estout consumo_pp_ae2 homeprod_pp_ae2 witransfer_act_m_pp_ae2 amount_p_pp_ae2 amount_t_pr_pp_ae2 amount_borrowed_m_pp_ae2 o
> utwage_lw_hh_pp_ae2 
>         using "$out_p/consumo_w7_view-all-covariates.text", stats(N mean mean_p sd prop, fmt(%9.0fc %9.3fc %9.3fc %9.3fc %9
> .3fc) 
>         labels("Number Observations" "Mean Dep Var (Control Households)" "Mean Dep Var | y >0(Control Households)" "SD Dep 
> Var (Control Households)"
>          "Prop Dep Var >0")) /*keep(t2_c1_op)*/ cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles - AE2) replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/consumo_w7_view-all-covariates.
> text not found)
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/consumo_w7_view-all-cova
> riates.text)

. /*
> *======================================================
>  ITT results: wave 7 - Eligibles -- Consumption AE2 
>                           Sensitivity to Triming Outliers & Food vs. Non-Food Expenditures (Table A4)
> *=======================================================;
> foreach x in consumo_pp_ae2 {;
>         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls, cl(comuid);
>         sum `x' if e(sample) & t2_c1_op ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x'_notrim, title (notrim);
> 
>         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_t2 <200, cl(comuid);
>         sum `x' if e(sample) & t2_c1_op ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x'_top5, title (top0.5);
> 
>         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_t2 >1 & consumo_pp_ae2_tl_t2 <200, cl(comuid);
>         sum `x' if e(sample) & t2_c1_op ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x'_tb5, title (t&b0.5);
> 
>         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_t2 <199, cl(comuid);
>         sum `x' if e(sample) & t2_c1_op ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x'_top1, title (top1);
> 
>         reg `x' t2_c1_op $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_t2 >2 & consumo_pp_ae2_tl_t2 <199, cl(comuid);
>         sum `x' if e(sample) & t2_c1_op ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & t2_c1_op ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x'_tb1, title (t&b1);
> };
> 
> ***Output for Appendix Table A4;
> estout consumo_pp_ae2_notrim consumo_pp_ae2_top5 consumo_pp_ae2_tb5 consumo_pp_ae2_top1 consumo_pp_ae2_tb1 foodexp_pp_ae2 n
> onfoodexp_pp_ae2 
>         using "$out_p/consumo_w7.text", stats(N mean mean_p sd prop, fmt(%9.0fc %9.3fc %9.3fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var (Control Households)" "Mean Dep Var | y >0(Control Households)" "SD Dep 
> Var (Control Households)"
>          "Prop Dep Var >0")) keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles - Consumption by Type & Outliers) appe
> nd;
> estimates clear;
> 
> *==================================================================================
> ITT results: wave 7 - Ineligibles -- Consumption & Other Income Sources (Table A8)
>                 Trim top & bottom 1% consumption distribution, top 2% of distrib of other vars (5% for wages).
> *===================================================================================;
> preserve;
> keep if ineligible ==1;
> count if witransfer_act_m >0 & witransfer_act_m ~=.;
> replace witransfer_act_m =0 if witransfer_act_m >0 &  witransfer_act_m ~=.; *ineligible are not receiving transfers;
> 
> foreach x in consumo_pp_ae2 foodexp_pp_ae2 nonfoodexp_pp_ae2 {;
>         reg `x' treatcom $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_tr >2 & consumo_pp_ae2_tl_tr <199, cl(comuid);
>         sum `x' if e(sample) & treatcom ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & treatcom ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x', title (`x');
> };
> 
> foreach x in homeprod_pp_ae2 amount_p_pp_ae2 amount_t_pr_pp_ae2 amount_borrowed_m_pp_ae2 {;
>         reg `x' treatcom $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_tr >2 & consumo_pp_ae2_tl_tr <199 & `x'_tl_tr 
> <=196, cl(comuid);
>         sum `x' if e(sample) & treatcom ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & treatcom ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x', title (`x');
> };
> 
> foreach x in outwage_lw_hh_pp_ae2 {;
>         reg `x' treatcom $basic hhsize_ae2_97 $controls if consumo_pp_ae2_tl_tr >2 & consumo_pp_ae2_tl_tr <199 & `x'_tl_tr 
> <=190, cl(comuid);
>         sum `x' if e(sample) & treatcom ==0;
>         scalar mean =r(mean);
>         estadd scalar mean;
>         sum `x' if e(sample) & treatcom ==0 & `x'>0;
>         scalar mean_p =r(mean);
>         estadd scalar mean_p;
>         scalar sd =r(sd);
>         estadd scalar sd;
>         sum d`x' if e(sample);
>         scalar prop =r(mean);
>         estadd scalar prop;
>         est store `x', title (`x');
> };
> 
> ***Output for Appendix Table A8;
> estout consumo_pp_ae2 homeprod_pp_ae2 amount_p_pp_ae2 amount_t_pr_pp_ae2 amount_borrowed_m_pp_ae2 outwage_lw_hh_pp_ae2 
>         using "$out_p/consumo_w7.text", stats(N mean mean_p sd prop, fmt(%9.0fc %9.3fc %9.3fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var (Control Households)" "Mean Dep Var | y >0(Control Households)" "SD Dep 
> Var (Control Households)"
>          "Prop Dep Var >0")) keep(treatcom) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Ineligibles - AE2) append;
> */
> estimates clear;

. restore;
nothing to restore
r(622);

end of do-file

r(622);

. do "C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct\consumption_income_long_term5.do
> "

. *version 3 - keep the outliers (quiet lines 80-92), changing name of output text on line 160
. #delimit;
delimiter now ;
. clear;

. cap clear matrix;

. cap clear mata;

. cap log close;
