-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/investments_long_term.log
  log type:  text
 opened on:  29 Nov 2019, 15:20:15

. use "$data/investments_data.dta";
(Complete Investments Data Base)

. *==============================
>  Estimation Sample: keep hh with non-missing info on any of the dependent vars (draft animals, prod animals, land & micro-e
> nterprise)
> *==============================;
. keep if wave ==2 | wave ==3 | wave ==4 | wave ==7;
(67,965 observations deleted)

. replace land =. if ha ==.;
(690 real changes made, 690 to missing)

. g byte all =(ani1 ~=. & ani2 ~=. & land ~=. & me~=.);

. sort state muni local folio wave;

. replace all =all[_n-1] if wave ==7;
(1,056 real changes made)

. keep if all ==1;
(568 observations deleted)

. *===============================
>  Wave Dummies & Treatment*Wave Interactions
> *===============================;
. foreach x in 2 3 4 7 {;
  2.         g byte wave`x' =(wave ==`x');
  3. };

. foreach x in t2_c1_op treatcom {;
  2.         foreach y in wave2 wave3 wave4 wave7 {;
  3.                 g `x'`y' =`y' * `x';
  4.         };
  5. };
(45,738 missing values generated)
(45,738 missing values generated)
(45,738 missing values generated)
(45,738 missing values generated)
(688 missing values generated)
(688 missing values generated)
(688 missing values generated)
(688 missing values generated)

. *drop production animal outliers in wave 7;
. ta wave if vani2 >=50000 & vani2 ~=.;

       Wave |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          5       29.41       29.41
          4 |          5       29.41       58.82
          7 |          7       41.18      100.00
------------+-----------------------------------
      Total |         17      100.00

. sum vani2 if vani2 >=50000;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |         17    54907.83    5662.716   50157.04    72687.2

. keep if vani2 <50000;
(703 observations deleted)

. *==============================
>   Define Globals 
> *==============================;
. gl dep_all ani1 ani2 land vani1 vani2 ha;

. gl dep_cont vani1 vani2 ha;

. gl dep_dum ani1 ani2 land;

. gl treatcom1 t2_c1_op;

. gl treatcom2 treatcom;

. gl basic                nbani197 nbani297 ha97;

. gl controls             no497 big497
>                                 age_hh age_hh2 female_hh educ1_hh ethnicity_hh 
>                                 age_sp age_sp2 educ1_sp                         
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p hhsize97
>                                 homeown97 dirtfloor97  electricity97 
>                                 org_faenas min_dist lnup_cwagepm up2_mcwagepm
>                                 dummy_age_hh dummy_educ_hh dummy_ethnicity_hh dummy_age_sp dummy_educ_sp
>                                 dummy_dage0_7_97 dummy_dirtfloor97 dummy_electricity97;

. *===========================================================================
> Regressions: Agricultural Assets (Table 2, Panels B & C)
>                          Waves 2, 3, 4 (pooled) & wave 7 & ITT & controls (Unconditional and Conditional)
>                          Test that the effect is sustained through wave 7
> *===========================================================================;
. ***Agricultural Assets: Eligibles, Unconditional -- Table 2, Panels B1 & C1;
. foreach x of global dep_all {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' `y'wave7 wave3 wave4 wave7 $basic $controls, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         test `y' + `y'wave7 =0;
  8.         scalar pvalue =r(p);
  9.         estadd scalar pvalue;
 10.         est store `x'_w2347_`y', title (`x');
 11.         reg `x' `y' $basic $controls if wave ==7, cl(comuid);
 12.         sum `x' if e(sample) & `y' ==0;
 13.         scalar mean =r(mean);
 14.         estadd scalar mean;
 15.         est store `x'_w7_`y', title (`x');
 16. };
 17. };

Linear regression                               Number of obs     =     43,344
                                                F(38, 500)        =      59.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1656
                                                Root MSE          =     .41118

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0423263   .0143591     2.95   0.003     .0141148    .0705379
      t2_c1_opwave7 |    -.01382   .0149886    -0.92   0.357    -.0432685    .0156285
              wave3 |  -.0119641   .0058623    -2.04   0.042    -.0234819   -.0004463
              wave4 |  -.0006073   .0078089    -0.08   0.938    -.0159495    .0147349
              wave7 |   .0479832    .013762     3.49   0.001     .0209448    .0750217
           nbani197 |   .0891886   .0107762     8.28   0.000     .0680164    .1103609
           nbani297 |   .0217322   .0022232     9.78   0.000     .0173643    .0261001
               ha97 |   .0062707   .0022999     2.73   0.007     .0017521    .0107893
              no497 |  -.1086974   .0101351   -10.72   0.000    -.1286101   -.0887847
             big497 |     .05728   .0126914     4.51   0.000     .0323449    .0822151
             age_hh |   .0030249   .0011189     2.70   0.007     .0008266    .0052231
            age_hh2 |  -.0000254   .0000105    -2.42   0.016    -.0000461   -4.76e-06
          female_hh |  -.0536536   .0120662    -4.45   0.000    -.0773603   -.0299469
           educ1_hh |   .0309648   .0085693     3.61   0.000     .0141286     .047801
       ethnicity_hh |  -.1231484   .0150545    -8.18   0.000    -.1527262   -.0935705
             age_sp |   .0009584    .000785     1.22   0.223    -.0005839    .0025008
            age_sp2 |  -5.50e-06   7.19e-06    -0.76   0.445    -.0000196    8.63e-06
           educ1_sp |   .0054445   .0088216     0.62   0.537    -.0118874    .0227764
         dage0_7_97 |  -.0231339   .0093292    -2.48   0.013    -.0414632   -.0048046
        dage8_17_97 |   .0167236   .0077883     2.15   0.032     .0014219    .0320254
       dage18_54_97 |   .0234212   .0148654     1.58   0.116    -.0057853    .0526276
         dage55p_97 |   .0151699   .0088405     1.72   0.087    -.0021993     .032539
           hhsize97 |   .0141656   .0019936     7.11   0.000     .0102487    .0180825
          homeown97 |   .0302888    .011784     2.57   0.010     .0071366     .053441
        dirtfloor97 |  -.0003704   .0106467    -0.03   0.972    -.0212882    .0205474
      electricity97 |   .0195421    .012177     1.60   0.109    -.0043822    .0434665
         org_faenas |     .01144    .026522     0.43   0.666    -.0406683    .0635483
           min_dist |  -.0007004   .0001745    -4.01   0.000    -.0010434   -.0003575
       lnup_cwagepm |   .0041797   .0031978     1.31   0.192     -.002103    .0104623
       up2_mcwagepm |   .0169057    .029729     0.57   0.570    -.0415035    .0753149
       dummy_age_hh |    .006728   .0612695     0.11   0.913    -.1136493    .1271053
      dummy_educ_hh |   .0372203   .0568261     0.65   0.513    -.0744271    .1488678
 dummy_ethnicity_hh |  -.0779911   .0565768    -1.38   0.169    -.1891487    .0331665
       dummy_age_sp |  -.0642592   .0525055    -1.22   0.222    -.1674179    .0388994
      dummy_educ_sp |   .0329256   .0527581     0.62   0.533    -.0707293    .1365805
   dummy_dage0_7_97 |   .1581936    .086669     1.83   0.069    -.0120867     .328474
  dummy_dirtfloor97 |   .0920946   .0713991     1.29   0.198    -.0481845    .2323738
dummy_electricity97 |   .1446152   .1552186     0.93   0.352    -.1603458    .4495762
              _cons |    .009966   .0494971     0.20   0.841     -.087282     .107214
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |     16,377    .2570068    .4369965          0          1

added scalar:
               e(mean) =  .25700678

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   500) =    1.89
            Prob > F =    0.1702

added scalar:
             e(pvalue) =  .17017794

Linear regression                               Number of obs     =     10,244
                                                F(34, 499)        =      32.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1532
                                                Root MSE          =     .42575

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0314658   .0203638     1.55   0.123    -.0085435     .071475
           nbani197 |   .0919435   .0119646     7.68   0.000     .0684363    .1154507
           nbani297 |   .0222304   .0032107     6.92   0.000     .0159222    .0285385
               ha97 |   .0072784   .0033757     2.16   0.032      .000646    .0139108
              no497 |  -.1057215   .0162251    -6.52   0.000    -.1375995   -.0738435
             big497 |   .0479689   .0192181     2.50   0.013     .0102104    .0857273
             age_hh |   .0011795   .0013439     0.88   0.381    -.0014609    .0038199
            age_hh2 |  -6.33e-06   .0000117    -0.54   0.588    -.0000292    .0000166
          female_hh |  -.0852395   .0172164    -4.95   0.000    -.1190652   -.0514139
           educ1_hh |     .03937   .0129524     3.04   0.002      .013922     .064818
       ethnicity_hh |  -.0966216   .0215969    -4.47   0.000    -.1390537   -.0541896
             age_sp |   .0006815   .0010657     0.64   0.523    -.0014122    .0027753
            age_sp2 |  -4.89e-06   8.79e-06    -0.56   0.578    -.0000222    .0000124
           educ1_sp |   .0077247   .0127524     0.61   0.545    -.0173303    .0327796
         dage0_7_97 |  -.0064674   .0137835    -0.47   0.639    -.0335482    .0206134
        dage8_17_97 |   .0246737   .0114579     2.15   0.032     .0021619    .0471854
       dage18_54_97 |   .0219478   .0230269     0.95   0.341    -.0232938    .0671894
         dage55p_97 |  -.0127215   .0125106    -1.02   0.310    -.0373015    .0118585
           hhsize97 |   .0136011   .0031215     4.36   0.000     .0074681    .0197341
          homeown97 |   .0110712   .0190001     0.58   0.560    -.0262588    .0484013
        dirtfloor97 |   .0163912   .0143682     1.14   0.255    -.0118385    .0446208
      electricity97 |   .0373527    .017756     2.10   0.036      .002467    .0722384
         org_faenas |  -.0027016    .043427    -0.06   0.950     -.088024    .0826208
           min_dist |  -.0008801   .0002335    -3.77   0.000    -.0013388   -.0004214
       lnup_cwagepm |   .0037057   .0033937     1.09   0.275    -.0029619    .0103734
       up2_mcwagepm |    .069047    .078785     0.88   0.381    -.0857443    .2238382
       dummy_age_hh |  -.0359194   .0681962    -0.53   0.599    -.1699065    .0980677
      dummy_educ_hh |    -.01801   .0638216    -0.28   0.778    -.1434022    .1073821
 dummy_ethnicity_hh |  -.0194374   .0933602    -0.21   0.835    -.2028649    .1639901
       dummy_age_sp |  -.0202854   .0648782    -0.31   0.755    -.1477535    .1071827
      dummy_educ_sp |  -.0349682   .0641892    -0.54   0.586    -.1610826    .0911461
   dummy_dage0_7_97 |   .2097845   .1164245     1.80   0.072    -.0189581     .438527
  dummy_dirtfloor97 |   .1038712    .096931     1.07   0.284     -.086572    .2943144
dummy_electricity97 |   .2653708   .1963481     1.35   0.177    -.1204001    .6511416
              _cons |   .1130844   .0711786     1.59   0.113    -.0267623    .2529311
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |      3,887    .2922562     .454858          0          1

added scalar:
               e(mean) =  .29225624

Linear regression                               Number of obs     =     43,347
                                                F(38, 500)        =      32.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0650
                                                Root MSE          =     .42789

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0350921   .0153227     2.29   0.022     .0049874    .0651968
      t2_c1_opwave7 |  -.0167472   .0184612    -0.91   0.365    -.0530182    .0195239
              wave3 |  -.0257336   .0094008    -2.74   0.006    -.0442035   -.0072638
              wave4 |   .0055997    .011082     0.51   0.614    -.0161733    .0273727
              wave7 |   .0389423   .0169738     2.29   0.022     .0055937     .072291
           nbani197 |   .0111143   .0032711     3.40   0.001     .0046874    .0175411
           nbani297 |   .0161405   .0016077    10.04   0.000     .0129818    .0192993
               ha97 |   .0012141   .0016313     0.74   0.457    -.0019911    .0044192
              no497 |  -.2164135   .0130476   -16.59   0.000    -.2420483   -.1907787
             big497 |   .0195441   .0097915     2.00   0.046     .0003066    .0387816
             age_hh |   .0046553   .0012085     3.85   0.000      .002281    .0070296
            age_hh2 |  -.0000441   .0000111    -3.98   0.000    -.0000659   -.0000223
          female_hh |   .0453397   .0136333     3.33   0.001      .018554    .0721254
           educ1_hh |  -.0169836   .0081784    -2.08   0.038    -.0330518   -.0009154
       ethnicity_hh |  -.0274702   .0150175    -1.83   0.068    -.0569753     .002035
             age_sp |   .0022719    .000713     3.19   0.002      .000871    .0036728
            age_sp2 |  -9.58e-06   6.06e-06    -1.58   0.115    -.0000215    2.33e-06
           educ1_sp |   -.016505   .0086833    -1.90   0.058    -.0335651    .0005552
         dage0_7_97 |  -.0032221   .0075701    -0.43   0.671    -.0180951     .011651
        dage8_17_97 |   .0185431   .0070041     2.65   0.008     .0047819    .0323042
       dage18_54_97 |   .0941943   .0144722     6.51   0.000     .0657605     .122628
         dage55p_97 |   .0225627   .0079235     2.85   0.005     .0069953    .0381302
           hhsize97 |   .0047248   .0015856     2.98   0.003     .0016094    .0078401
          homeown97 |   .0426295   .0132625     3.21   0.001     .0165724    .0686867
        dirtfloor97 |   .0080021   .0082454     0.97   0.332    -.0081979     .024202
      electricity97 |  -.0065814   .0125387    -0.52   0.600    -.0312164    .0180537
         org_faenas |   .0107758   .0232522     0.46   0.643    -.0349083    .0564599
           min_dist |   -.000272    .000175    -1.55   0.121    -.0006158    .0000719
       lnup_cwagepm |   .0102324    .002928     3.49   0.001     .0044796    .0159852
       up2_mcwagepm |   .0412983   .0319541     1.29   0.197    -.0214825     .104079
       dummy_age_hh |   .0396271   .0689887     0.57   0.566    -.0959163    .1751705
      dummy_educ_hh |  -.0924154   .0518049    -1.78   0.075    -.1941976    .0093668
 dummy_ethnicity_hh |   .0141609   .0562946     0.25   0.801    -.0964422    .1247639
       dummy_age_sp |  -.0585352   .0313834    -1.87   0.063    -.1201949    .0031244
      dummy_educ_sp |  -.0237807   .0308012    -0.77   0.440    -.0842964    .0367351
   dummy_dage0_7_97 |   .2506429   .0732275     3.42   0.001     .1067715    .3945143
  dummy_dirtfloor97 |   .0552441   .0522046     1.06   0.290    -.0473232    .1578115
dummy_electricity97 |    -.06928    .075703    -0.92   0.361    -.2180153    .0794552
              _cons |   .3520591   .0499199     7.05   0.000     .2539805    .4501378
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |     16,379    .7126809    .4525255          0          1

added scalar:
               e(mean) =  .71268087

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   500) =    1.00
            Prob > F =    0.3169

added scalar:
             e(pvalue) =  .31691077

Linear regression                               Number of obs     =     10,247
                                                F(34, 499)        =      13.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0552
                                                Root MSE          =      .4219

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0195697   .0179233     1.09   0.275    -.0156448    .0547842
           nbani197 |   .0084456   .0073909     1.14   0.254    -.0060755    .0229666
           nbani297 |   .0135756   .0024647     5.51   0.000     .0087332     .018418
               ha97 |   .0070464   .0023483     3.00   0.003     .0024326    .0116602
              no497 |  -.1664185   .0194143    -8.57   0.000    -.2045623   -.1282747
             big497 |  -.0302987   .0162053    -1.87   0.062    -.0621377    .0015402
             age_hh |   .0033306   .0018439     1.81   0.071    -.0002922    .0069534
            age_hh2 |  -.0000229   .0000173    -1.33   0.186    -.0000568     .000011
          female_hh |   .0250104    .018816     1.33   0.184    -.0119579    .0619787
           educ1_hh |  -.0360951   .0126833    -2.85   0.005    -.0610143   -.0111759
       ethnicity_hh |    .037387   .0188795     1.98   0.048     .0002939    .0744802
             age_sp |   .0002533   .0011483     0.22   0.826    -.0020028    .0025094
            age_sp2 |   1.34e-06   9.90e-06     0.14   0.892    -.0000181    .0000208
           educ1_sp |   .0059298   .0125758     0.47   0.637    -.0187782    .0306378
         dage0_7_97 |   .0194562   .0127017     1.53   0.126    -.0054992    .0444116
        dage8_17_97 |   .0151895   .0117319     1.29   0.196    -.0078605    .0382396
       dage18_54_97 |   .1264325   .0272071     4.65   0.000      .072978    .1798871
         dage55p_97 |     .00405   .0124479     0.33   0.745    -.0204068    .0285067
           hhsize97 |   .0073021   .0023085     3.16   0.002     .0027665    .0118377
          homeown97 |   .0075179   .0202648     0.37   0.711    -.0322969    .0473328
        dirtfloor97 |   .0040868   .0134954     0.30   0.762    -.0224279    .0306016
      electricity97 |  -.0082281   .0169154    -0.49   0.627    -.0414622    .0250061
         org_faenas |  -.0369476   .0280034    -1.32   0.188    -.0919667    .0180715
           min_dist |  -.0004741   .0002351    -2.02   0.044     -.000936   -.0000122
       lnup_cwagepm |   .0123536   .0030684     4.03   0.000     .0063249    .0183823
       up2_mcwagepm |  -.0879091   .0666428    -1.32   0.188    -.2188441    .0430259
       dummy_age_hh |   .0421703   .0905607     0.47   0.642    -.1357569    .2200976
      dummy_educ_hh |  -.1569694   .0837105    -1.88   0.061     -.321438    .0074991
 dummy_ethnicity_hh |    .030818   .1158824     0.27   0.790    -.1968597    .2584956
       dummy_age_sp |  -.1007194   .0710006    -1.42   0.157    -.2402163    .0387775
      dummy_educ_sp |   .0255978   .0696802     0.37   0.714    -.1113049    .1625004
   dummy_dage0_7_97 |   .2244877   .1304823     1.72   0.086    -.0318747    .4808502
  dummy_dirtfloor97 |  -.0575063   .0864282    -0.67   0.506    -.2273144    .1123018
dummy_electricity97 |   .0524018    .206957     0.25   0.800    -.3542127    .4590162
              _cons |   .4740611   .0688369     6.89   0.000     .3388152    .6093071
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |      3,889    .7384932    .4395119          0          1

added scalar:
               e(mean) =  .73849319

Linear regression                               Number of obs     =     43,250
                                                F(38, 500)        =      85.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1606
                                                Root MSE          =     .44431

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0319752   .0194998     1.64   0.102    -.0063363    .0702868
      t2_c1_opwave7 |  -.0050196   .0169527    -0.30   0.767     -.038327    .0282878
              wave3 |  -.0424707   .0093383    -4.55   0.000    -.0608178   -.0241236
              wave4 |   .0234838   .0110604     2.12   0.034     .0017531    .0452144
              wave7 |   .0509338   .0151708     3.36   0.001     .0211275    .0807401
           nbani197 |    .026188   .0052664     4.97   0.000      .015841    .0365349
           nbani297 |   .0096181   .0016654     5.78   0.000      .006346    .0128902
               ha97 |   .0265499   .0027482     9.66   0.000     .0211503    .0319494
              no497 |  -.2161212   .0134832   -16.03   0.000    -.2426118   -.1896305
             big497 |   .0588687   .0132215     4.45   0.000     .0328921    .0848453
             age_hh |   .0105719   .0013543     7.81   0.000     .0079112    .0132326
            age_hh2 |  -.0000856   .0000124    -6.88   0.000      -.00011   -.0000612
          female_hh |  -.1114958   .0146753    -7.60   0.000    -.1403287   -.0826628
           educ1_hh |   .0223814    .009963     2.25   0.025      .002807    .0419558
       ethnicity_hh |   .0985082   .0165563     5.95   0.000     .0659798    .1310366
             age_sp |  -.0006263   .0007425    -0.84   0.399    -.0020852    .0008325
            age_sp2 |  -1.92e-06   6.16e-06    -0.31   0.755     -.000014    .0000102
           educ1_sp |    .022192   .0100007     2.22   0.027     .0025433    .0418406
         dage0_7_97 |   -.017285   .0093329    -1.85   0.065    -.0356215    .0010516
        dage8_17_97 |   .0247162    .008455     2.92   0.004     .0081044     .041328
       dage18_54_97 |   .0322821   .0162515     1.99   0.048     .0003525    .0642117
         dage55p_97 |   .0258709   .0087056     2.97   0.003     .0087668    .0429749
           hhsize97 |   .0082367   .0018936     4.35   0.000     .0045163     .011957
          homeown97 |    .135199   .0140802     9.60   0.000     .1075353    .1628627
        dirtfloor97 |   .0027608   .0102037     0.27   0.787    -.0172867    .0228083
      electricity97 |  -.0021786   .0123341    -0.18   0.860    -.0264117    .0220545
         org_faenas |  -.0435701   .0361877    -1.20   0.229    -.1146688    .0275286
           min_dist |   .0003555   .0002026     1.75   0.080    -.0000426    .0007536
       lnup_cwagepm |  -.0108484   .0027936    -3.88   0.000    -.0163371   -.0053597
       up2_mcwagepm |  -.0393245   .0272864    -1.44   0.150    -.0929347    .0142857
       dummy_age_hh |   .0814796   .0649338     1.25   0.210    -.0460971    .2090563
      dummy_educ_hh |  -.0118472   .0479831    -0.25   0.805    -.1061205    .0824262
 dummy_ethnicity_hh |  -.0735707   .0507357    -1.45   0.148     -.173252    .0261107
       dummy_age_sp |  -.0250339   .0317788    -0.79   0.431    -.0874704    .0374025
      dummy_educ_sp |   .0123061   .0307407     0.40   0.689    -.0480908    .0727029
   dummy_dage0_7_97 |   .0620799   .0808175     0.77   0.443    -.0967037    .2208636
  dummy_dirtfloor97 |    .049463   .0565533     0.87   0.382    -.0616485    .1605744
dummy_electricity97 |   .1346152   .1409255     0.96   0.340    -.1422638    .4114942
              _cons |   .0649351   .0585303     1.11   0.268    -.0500606    .1799308
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |     16,349    .6053581    .4887886          0          1

added scalar:
               e(mean) =  .60535813

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   500) =    2.35
            Prob > F =    0.1258

added scalar:
             e(pvalue) =  .12577306

Linear regression                               Number of obs     =     10,150
                                                F(34, 499)        =      39.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1554
                                                Root MSE          =     .42721

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0270273   .0174361     1.55   0.122      -.00723    .0612845
           nbani197 |   .0240992   .0065158     3.70   0.000     .0112974    .0369009
           nbani297 |   .0090692   .0020532     4.42   0.000     .0050354    .0131031
               ha97 |   .0230674   .0027828     8.29   0.000        .0176    .0285349
              no497 |  -.2133375   .0210327   -10.14   0.000     -.254661    -.172014
             big497 |   .0511498   .0155831     3.28   0.001     .0205332    .0817664
             age_hh |   .0073312   .0017519     4.18   0.000     .0038892    .0107731
            age_hh2 |  -.0000479   .0000157    -3.05   0.002    -.0000787   -.0000171
          female_hh |    -.14398   .0205468    -7.01   0.000    -.1843489    -.103611
           educ1_hh |   .0156468   .0129487     1.21   0.227    -.0097939    .0410875
       ethnicity_hh |   .1018503   .0179897     5.66   0.000     .0665053    .1371952
             age_sp |   -.001496   .0012092    -1.24   0.217    -.0038718    .0008798
            age_sp2 |   5.14e-06   9.58e-06     0.54   0.592    -.0000137     .000024
           educ1_sp |    .029809    .012593     2.37   0.018     .0050672    .0545508
         dage0_7_97 |  -.0251754   .0125043    -2.01   0.045     -.049743   -.0006077
        dage8_17_97 |   .0392138   .0120031     3.27   0.001     .0156309    .0627967
       dage18_54_97 |    .114448   .0262358     4.36   0.000     .0629018    .1659943
         dage55p_97 |   .0036471   .0115628     0.32   0.753    -.0190707    .0263649
           hhsize97 |   .0074753   .0025846     2.89   0.004     .0023972    .0125534
          homeown97 |   .1394521   .0216421     6.44   0.000     .0969313    .1819729
        dirtfloor97 |  -.0032582    .013504    -0.24   0.809    -.0297899    .0232736
      electricity97 |  -.0061349   .0152627    -0.40   0.688     -.036122    .0238521
         org_faenas |  -.0652084   .0217732    -2.99   0.003    -.1079868     -.02243
           min_dist |   .0003264   .0002203     1.48   0.139    -.0001063    .0007592
       lnup_cwagepm |  -.0077521   .0028502    -2.72   0.007     -.013352   -.0021523
       up2_mcwagepm |   -.028724    .030019    -0.96   0.339    -.0877033    .0302552
       dummy_age_hh |  -.0293681   .0910096    -0.32   0.747    -.2081772    .1494411
      dummy_educ_hh |   .0194546   .0776462     0.25   0.802    -.1330991    .1720084
 dummy_ethnicity_hh |   -.055703   .1144315    -0.49   0.627    -.2805299     .169124
       dummy_age_sp |  -.0439524   .0702346    -0.63   0.532    -.1819443    .0940395
      dummy_educ_sp |   .0207785   .0663964     0.31   0.754    -.1096726    .1512295
   dummy_dage0_7_97 |    .136599   .1386525     0.99   0.325    -.1358157    .4090136
  dummy_dirtfloor97 |  -.0111588   .0972248    -0.11   0.909    -.2021791    .1798616
dummy_electricity97 |  -.0622568   .1621048    -0.38   0.701    -.3807488    .2562352
              _cons |   .1522751   .0668354     2.28   0.023     .0209616    .2835885
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |      3,859    .6701218    .4702296          0          1

added scalar:
               e(mean) =  .67012179

Linear regression                               Number of obs     =     43,344
                                                F(38, 500)        =      22.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1886
                                                Root MSE          =     1059.9

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   65.95403   25.47653     2.59   0.010     15.89978    116.0083
      t2_c1_opwave7 |   62.40535   61.74812     1.01   0.313    -58.91241    183.7231
              wave3 |  -12.17902   11.91803    -1.02   0.307    -35.59461    11.23658
              wave4 |  -23.96981   15.08089    -1.59   0.113    -53.59953    5.659914
              wave7 |   341.5576   50.77498     6.73   0.000      241.799    441.3162
           nbani197 |   333.8778    47.6144     7.01   0.000     240.3289    427.4268
           nbani297 |   69.30181   8.214542     8.44   0.000     53.16254    85.44108
               ha97 |   12.66209   8.318905     1.52   0.129     -3.68223    29.00641
              no497 |  -95.82063   20.05838    -4.78   0.000    -135.2297   -56.41153
             big497 |   111.2255   42.23244     2.63   0.009     28.25057    194.2004
             age_hh |   4.586772   2.375967     1.93   0.054    -.0813375    9.254882
            age_hh2 |  -.0326357   .0231546    -1.41   0.159    -.0781281    .0128566
          female_hh |  -133.4921    32.3873    -4.12   0.000    -197.1241   -69.86017
           educ1_hh |   62.61538   16.23037     3.86   0.000     30.72724    94.50351
       ethnicity_hh |  -221.7657   25.54401    -8.68   0.000    -271.9525   -171.5789
             age_sp |    1.38782   2.072835     0.67   0.503     -2.68472     5.46036
            age_sp2 |  -.0102401   .0188334    -0.54   0.587    -.0472424    .0267623
           educ1_sp |   5.238736   18.97136     0.28   0.783    -32.03467    42.51214
         dage0_7_97 |  -59.79269   20.99995    -2.85   0.005    -101.0517   -18.53368
        dage8_17_97 |  -5.871847   17.08933    -0.34   0.731    -39.44759    27.70389
       dage18_54_97 |  -11.76564   36.10735    -0.33   0.745    -82.70647    59.17519
         dage55p_97 |   -17.5326   24.34176    -0.72   0.472    -65.35735    30.29215
           hhsize97 |   29.95168   5.988524     5.00   0.000      18.1859    41.71745
          homeown97 |   34.53556   23.36444     1.48   0.140    -11.36902    80.44013
        dirtfloor97 |  -3.733367   24.21187    -0.15   0.878     -51.3029    43.83617
      electricity97 |   70.07275   24.72731     2.83   0.005     21.49052     118.655
         org_faenas |   -77.7259   57.90484    -1.34   0.180    -191.4927    36.04088
           min_dist |  -1.700595   .3698857    -4.60   0.000    -2.427316   -.9738727
       lnup_cwagepm |   14.07607   11.49644     1.22   0.221    -8.511208    36.66336
       up2_mcwagepm |   77.42676   70.40159     1.10   0.272    -60.89264    215.7462
       dummy_age_hh |   134.9583   168.3767     0.80   0.423    -195.8547    465.7713
      dummy_educ_hh |   12.55784   88.05877     0.14   0.887     -160.453    185.5686
 dummy_ethnicity_hh |  -389.3035   108.9763    -3.57   0.000    -603.4115   -175.1956
       dummy_age_sp |  -172.2428   139.0141    -1.24   0.216    -445.3665    100.8809
      dummy_educ_sp |   146.7822   137.1454     1.07   0.285      -122.67    416.2345
   dummy_dage0_7_97 |    391.301    275.855     1.42   0.157    -150.6767    933.2787
  dummy_dirtfloor97 |    56.2541   99.95616     0.56   0.574    -140.1318      252.64
dummy_electricity97 |   352.1964   416.2737     0.85   0.398    -465.6648    1170.058
              _cons |  -24.64858   113.1226    -0.22   0.828    -246.9028    197.6057
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |     16,377    381.2001    1047.569          0   21687.83

added scalar:
               e(mean) =  381.20013

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   500) =    3.48
            Prob > F =    0.0628

added scalar:
             e(pvalue) =  .06275331

Linear regression                               Number of obs     =     10,244
                                                F(34, 499)        =      15.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1711
                                                Root MSE          =     1510.3

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   138.7002   64.84658     2.14   0.033     11.29418    266.1061
           nbani197 |   438.2506   70.10742     6.25   0.000     300.5084    575.9927
           nbani297 |   117.4101   15.62971     7.51   0.000     86.70191    148.1182
               ha97 |    21.3767   22.24507     0.96   0.337    -22.32884    65.08223
              no497 |  -174.7175   50.13911    -3.48   0.001    -273.2273   -76.20774
             big497 |    73.2866   98.36756     0.75   0.457     -119.979    266.5522
             age_hh |   3.244836   4.625084     0.70   0.483    -5.842202    12.33187
            age_hh2 |  -.0062588    .040996    -0.15   0.879    -.0868049    .0742874
          female_hh |  -190.1173   64.63831    -2.94   0.003    -317.1141   -63.12053
           educ1_hh |   133.5447   37.46022     3.56   0.000     59.94553    207.1439
       ethnicity_hh |  -316.5983   65.79796    -4.81   0.000    -445.8735   -187.3232
             age_sp |  -1.906787   6.170365    -0.31   0.757    -14.02988    10.21631
            age_sp2 |     .01432   .0565907     0.25   0.800    -.0968654    .1255054
           educ1_sp |   62.00499    38.6871     1.60   0.110     -14.0047    138.0147
         dage0_7_97 |  -52.36564   47.19754    -1.11   0.268     -145.096    40.36476
        dage8_17_97 |   .6477178    44.0712     0.01   0.988    -85.94026     87.2357
       dage18_54_97 |   35.98548   79.49459     0.45   0.651    -120.1999    192.1708
         dage55p_97 |   -114.301   47.95444    -2.38   0.018    -208.5185   -20.08353
           hhsize97 |   49.21772   12.95172     3.80   0.000      23.7711    74.66434
          homeown97 |   68.34365   44.90815     1.52   0.129    -19.88871     156.576
        dirtfloor97 |   82.16349   52.07844     1.58   0.115    -20.15656    184.4835
      electricity97 |   146.4204    54.8422     2.67   0.008     38.67033    254.1705
         org_faenas |   -195.605   141.2161    -1.39   0.167    -473.0564    81.84634
           min_dist |  -2.661641   .6746219    -3.95   0.000     -3.98709   -1.336191
       lnup_cwagepm |   1.438685   11.98775     0.12   0.905      -22.114    24.99137
       up2_mcwagepm |    221.089    106.643     2.07   0.039     11.56445    430.6136
       dummy_age_hh |   236.5206   278.8104     0.85   0.397    -311.2663    784.3075
      dummy_educ_hh |   18.17016   257.1409     0.07   0.944    -487.0422    523.3825
 dummy_ethnicity_hh |  -626.9808   270.4694    -2.32   0.021     -1158.38   -95.58169
       dummy_age_sp |   -284.779   458.4128    -0.62   0.535    -1185.436     615.878
      dummy_educ_sp |   198.4263   450.6498     0.44   0.660    -686.9787    1083.831
   dummy_dage0_7_97 |   494.1996   311.7277     1.59   0.114     -118.261     1106.66
  dummy_dirtfloor97 |    525.272   333.2922     1.58   0.116    -129.5569    1180.101
dummy_electricity97 |   1640.307   1457.045     1.13   0.261    -1222.393    4503.007
              _cons |   238.9776   235.3073     1.02   0.310    -223.3375    701.2928
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |      3,887    629.0545    1436.233          0   21687.83

added scalar:
               e(mean) =  629.05455

Linear regression                               Number of obs     =     43,347
                                                F(38, 500)        =      31.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2260
                                                Root MSE          =     2695.1

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   179.4051   67.06707     2.68   0.008     47.63708    311.1731
      t2_c1_opwave7 |  -110.0879   81.14394    -1.36   0.175     -269.513    49.33717
              wave3 |   7.676215   33.71578     0.23   0.820    -58.56585    73.91828
              wave4 |   53.64478   49.89617     1.08   0.283    -44.38721    151.6768
              wave7 |   337.5461   82.17534     4.11   0.000     176.0946    498.9977
           nbani197 |   213.5861   49.44256     4.32   0.000     116.4453    310.7269
           nbani297 |   556.0792   38.87614    14.30   0.000     479.6984    632.4599
               ha97 |   38.74356   20.62923     1.88   0.061    -1.787094     79.2742
              no497 |  -167.2508   43.74485    -3.82   0.000    -253.1972   -81.30448
             big497 |   164.7261   101.9359     1.62   0.107     -35.5493    365.0015
             age_hh |   25.66743    6.87119     3.74   0.000     12.16747     39.1674
            age_hh2 |  -.1925378   .0686299    -2.81   0.005    -.3273764   -.0576992
          female_hh |  -167.4421   64.16514    -2.61   0.009    -293.5086   -41.37552
           educ1_hh |  -18.15832   51.02376    -0.36   0.722    -118.4057    82.08908
       ethnicity_hh |  -415.7461    69.2402    -6.00   0.000    -551.7837   -279.7085
             age_sp |   12.61357   3.757762     3.36   0.001      5.23062    19.99652
            age_sp2 |  -.0974566   .0321359    -3.03   0.003    -.1605947   -.0343186
           educ1_sp |  -64.27174   52.23196    -1.23   0.219    -166.8929    38.34942
         dage0_7_97 |  -124.4313   59.45071    -2.09   0.037    -241.2353   -7.627342
        dage8_17_97 |   7.651842   47.85206     0.16   0.873    -86.36406    101.6677
       dage18_54_97 |   229.0199   81.15402     2.82   0.005     69.57503    388.4649
         dage55p_97 |  -40.36364   67.16209    -0.60   0.548    -172.3183    91.59105
           hhsize97 |   30.97141   12.84438     2.41   0.016     5.735792    56.20702
          homeown97 |   68.67774    59.1645     1.16   0.246    -47.56392    184.9194
        dirtfloor97 |  -435.1216   64.10379    -6.79   0.000    -561.0675   -309.1756
      electricity97 |  -3.578891   52.77091    -0.07   0.946     -107.259    100.1012
         org_faenas |   49.26986   101.1649     0.49   0.626    -149.4909    248.0306
           min_dist |  -.5632208   .6999832    -0.80   0.421    -1.938492      .81205
       lnup_cwagepm |   38.10686   13.54314     2.81   0.005     11.49837    64.71534
       up2_mcwagepm |  -12.21125   107.4567    -0.11   0.910    -223.3335     198.911
       dummy_age_hh |   515.5349   457.6738     1.13   0.261     -383.666    1414.736
      dummy_educ_hh |   162.2587   520.1006     0.31   0.755    -859.5932    1184.111
 dummy_ethnicity_hh |  -654.3444   304.8871    -2.15   0.032    -1253.362   -55.32667
       dummy_age_sp |   105.7406   160.6019     0.66   0.511    -209.7971    421.2784
      dummy_educ_sp |  -168.0582   155.5798    -1.08   0.281    -473.7289    137.6125
   dummy_dage0_7_97 |   1102.954   687.2138     1.60   0.109    -247.2282    2453.137
  dummy_dirtfloor97 |  -447.0168   217.7389    -2.05   0.041    -874.8127   -19.22087
dummy_electricity97 |    340.963   257.5025     1.32   0.186    -164.9572    846.8832
              _cons |  -598.0718   214.2322    -2.79   0.005    -1018.978   -177.1656
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |     16,379    1195.237    2934.784          0   46596.51

added scalar:
               e(mean) =  1195.2368

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   500) =    0.66
            Prob > F =    0.4168

added scalar:
             e(pvalue) =  .41677756

Linear regression                               Number of obs     =     10,247
                                                F(34, 499)        =      18.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1983
                                                Root MSE          =       2840

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   72.49114   86.68725     0.84   0.403    -97.82584    242.8081
           nbani197 |   233.1921   78.72461     2.96   0.003     78.51957    387.8647
           nbani297 |   519.0483   49.27711    10.53   0.000     422.2321    615.8645
               ha97 |   47.08655   24.77619     1.90   0.058    -1.591955    95.76506
              no497 |  -222.3317   63.70452    -3.49   0.001    -347.4938   -97.16956
             big497 |    134.997   129.6605     1.04   0.298    -119.7509    389.7448
             age_hh |   26.07183     9.3271     2.80   0.005     7.746606    44.39706
            age_hh2 |  -.2113685   .0844198    -2.50   0.013    -.3772306   -.0455063
          female_hh |  -219.9425   110.3797    -1.99   0.047    -436.8087   -3.076328
           educ1_hh |  -57.20153   73.55144    -0.78   0.437    -201.7102    87.30714
       ethnicity_hh |  -360.9244    100.012    -3.61   0.000    -557.4208   -164.4279
             age_sp |   14.47716   6.647967     2.18   0.030     1.415706    27.53862
            age_sp2 |  -.1085855   .0492233    -2.21   0.028    -.2052959   -.0118751
           educ1_sp |  -23.97904   78.47249    -0.31   0.760    -178.1562    130.1982
         dage0_7_97 |  -99.97606   91.66407    -1.09   0.276    -280.0712    80.11904
        dage8_17_97 |   -23.7056   75.14975    -0.32   0.753    -171.3545    123.9433
       dage18_54_97 |   322.9969    122.696     2.63   0.009     81.93245    564.0614
         dage55p_97 |  -51.66206   88.47619    -0.58   0.560    -225.4938    122.1697
           hhsize97 |    56.9591   20.42051     2.79   0.005     16.83833    97.07987
          homeown97 |   122.1901   94.62467     1.29   0.197    -63.72182    308.1019
        dirtfloor97 |  -443.9386   96.90774    -4.58   0.000    -634.3361   -253.5412
      electricity97 |   44.07066   75.20646     0.59   0.558    -103.6897     191.831
         org_faenas |   45.32486   96.93218     0.47   0.640    -145.1207    235.7704
           min_dist |  -1.167085   .9804815    -1.19   0.234    -3.093466    .7592956
       lnup_cwagepm |   34.39524   14.39067     2.39   0.017     6.121471    62.66902
       up2_mcwagepm |  -7.993503   173.3452    -0.05   0.963    -348.5699    332.5829
       dummy_age_hh |   964.8929   633.7578     1.52   0.129    -280.2696    2210.055
      dummy_educ_hh |   -611.374   231.5513    -2.64   0.009     -1066.31   -156.4384
 dummy_ethnicity_hh |  -930.5376   571.8429    -1.63   0.104    -2054.054     192.979
       dummy_age_sp |    271.958   351.1225     0.77   0.439    -417.9027    961.8188
      dummy_educ_sp |  -337.0662   332.7646    -1.01   0.312    -990.8585    316.7261
   dummy_dage0_7_97 |   738.6433   691.1007     1.07   0.286    -619.1826    2096.469
  dummy_dirtfloor97 |  -264.8059   415.9249    -0.64   0.525    -1081.986     552.374
dummy_electricity97 |   986.5012   850.3515     1.16   0.247    -684.2094    2657.212
              _cons |  -514.2372   315.3787    -1.63   0.104    -1133.871    105.3966
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |      3,889    1418.382    3130.407          0   43120.78

added scalar:
               e(mean) =  1418.3815

Linear regression                               Number of obs     =     43,250
                                                F(38, 500)        =      38.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0927
                                                Root MSE          =     3.2315

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0763257   .0603222     1.27   0.206    -.0421904    .1948419
      t2_c1_opwave7 |  -.1701924   .1661598    -1.02   0.306    -.4966498     .156265
              wave3 |  -.1094854   .0303514    -3.61   0.000    -.1691174   -.0498533
              wave4 |  -.0070732   .0362899    -0.19   0.846    -.0783728    .0642263
              wave7 |   1.138694   .1411423     8.07   0.000     .8613885    1.415999
           nbani197 |   .0863518   .0272254     3.17   0.002     .0328615     .139842
           nbani297 |   .0829916   .0143664     5.78   0.000     .0547657    .1112175
               ha97 |   .2166946   .0347231     6.24   0.000     .1484734    .2849159
              no497 |  -.2206067   .0651943    -3.38   0.001    -.3486951   -.0925182
             big497 |   .4650163   .1170529     3.97   0.000     .2350402    .6949924
             age_hh |   .0334763   .0076231     4.39   0.000     .0184989    .0484536
            age_hh2 |  -.0001908   .0000753    -2.53   0.012    -.0003388   -.0000429
          female_hh |  -.4666936   .0795878    -5.86   0.000    -.6230614   -.3103259
           educ1_hh |   .0197784   .0476752     0.41   0.678    -.0738899    .1134468
       ethnicity_hh |   .0407122   .0621337     0.66   0.513    -.0813632    .1627876
             age_sp |   .0003728   .0047958     0.08   0.938    -.0090497    .0097953
            age_sp2 |  -.0000206    .000048    -0.43   0.668    -.0001148    .0000736
           educ1_sp |   .0252013   .0450326     0.56   0.576    -.0632752    .1136778
         dage0_7_97 |  -.0789633   .0553658    -1.43   0.154    -.1877416     .029815
        dage8_17_97 |   .0374563   .0435752     0.86   0.390    -.0481567    .1230692
       dage18_54_97 |   .3408234   .0943285     3.61   0.000     .1554942    .5261525
         dage55p_97 |   .0079913   .0564318     0.14   0.887    -.1028815     .118864
           hhsize97 |   .0162502   .0118973     1.37   0.173    -.0071247    .0396251
          homeown97 |   .1738095   .0947621     1.83   0.067    -.0123714    .3599905
        dirtfloor97 |   .0751686   .0511729     1.47   0.142    -.0253719    .1757091
      electricity97 |   .0848494    .055035     1.54   0.124    -.0232789    .1929777
         org_faenas |  -.0292792   .1081546    -0.27   0.787    -.2417727    .1832143
           min_dist |   .0005146   .0007245     0.71   0.478    -.0009089    .0019381
       lnup_cwagepm |  -.0125412   .0244814    -0.51   0.609    -.0606403    .0355579
       up2_mcwagepm |   -.239989   .1752497    -1.37   0.171    -.5843055    .1043276
       dummy_age_hh |  -.0316608   .6196284    -0.05   0.959    -1.249057    1.185735
      dummy_educ_hh |   .1584268   .2312646     0.69   0.494    -.2959434     .612797
 dummy_ethnicity_hh |  -.0094942   .3057235    -0.03   0.975    -.6101552    .5911668
       dummy_age_sp |  -.1359432   .2538658    -0.54   0.593    -.6347184     .362832
      dummy_educ_sp |   .2233071   .2552024     0.88   0.382    -.2780941    .7247084
   dummy_dage0_7_97 |  -.0170958   .1967303    -0.09   0.931    -.4036157    .3694241
  dummy_dirtfloor97 |   .5048496   .4078302     1.24   0.216    -.2964225    1.306122
dummy_electricity97 |   .5090342   .9552349     0.53   0.594    -1.367735    2.385803
              _cons |  -.9527936   .2619967    -3.64   0.000    -1.467544   -.4380436
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |     16,349    1.528362    3.484259          0         50

added scalar:
               e(mean) =  1.528362

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   500) =    0.30
            Prob > F =    0.5852

added scalar:
             e(pvalue) =  .58519703

Linear regression                               Number of obs     =     10,150
                                                F(34, 499)        =       9.84
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0347
                                                Root MSE          =     5.8575

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0390551   .1668964    -0.23   0.815    -.3669613    .2888511
           nbani197 |   .0253774    .066556     0.38   0.703    -.1053872    .1561419
           nbani297 |   .1312601   .0336136     3.90   0.000     .0652185    .1973016
               ha97 |   .2374893   .0624665     3.80   0.000     .1147595    .3602191
              no497 |  -.1061532   .2310498    -0.46   0.646    -.5601035    .3477972
             big497 |   .6717137   .2701004     2.49   0.013     .1410396    1.202388
             age_hh |   .0387334   .0154893     2.50   0.013     .0083011    .0691657
            age_hh2 |  -.0000946   .0001496    -0.63   0.527    -.0003886    .0001994
          female_hh |  -.8604368   .1907436    -4.51   0.000    -1.235196   -.4856772
           educ1_hh |    .120767    .140732     0.86   0.391    -.1557332    .3972673
       ethnicity_hh |   .3919709   .1767635     2.22   0.027     .0446784    .7392634
             age_sp |   .0043374   .0182199     0.24   0.812    -.0314598    .0401346
            age_sp2 |  -.0001233   .0001746    -0.71   0.480    -.0004663    .0002197
           educ1_sp |   .1672718   .1412805     1.18   0.237    -.1103061    .4448496
         dage0_7_97 |   .0743984   .1600555     0.46   0.642    -.2400674    .3888641
        dage8_17_97 |   .0134842   .1442631     0.09   0.926    -.2699539    .2969222
       dage18_54_97 |   .9644388   .3189601     3.02   0.003     .3377686    1.591109
         dage55p_97 |  -.0641493   .1689152    -0.38   0.704    -.3960221    .2677234
           hhsize97 |  -.0377009   .0342549    -1.10   0.272    -.1050026    .0296008
          homeown97 |  -.0258396   .3893198    -0.07   0.947    -.7907477    .7390686
        dirtfloor97 |   .1579524   .1285902     1.23   0.220    -.0946925    .4105972
      electricity97 |   .0962751   .1487808     0.65   0.518     -.196039    .3885892
         org_faenas |  -.1089205   .2522092    -0.43   0.666    -.6044433    .3866023
           min_dist |  -.0020619   .0020829    -0.99   0.323    -.0061542    .0020304
       lnup_cwagepm |  -.0004062   .0251365    -0.02   0.987    -.0497927    .0489803
       up2_mcwagepm |   .1348954   .6217822     0.22   0.828    -1.086739    1.356529
       dummy_age_hh |  -.5333645   .6848986    -0.78   0.436    -1.879005     .812276
      dummy_educ_hh |   .2733134   .5069345     0.54   0.590    -.7226757    1.269303
 dummy_ethnicity_hh |   .4737166   1.007245     0.47   0.638    -1.505247     2.45268
       dummy_age_sp |   .8683598   1.320554     0.66   0.511    -1.726172    3.462891
      dummy_educ_sp |  -.8286254   1.297192    -0.64   0.523    -3.377256    1.720005
   dummy_dage0_7_97 |  -.6123237   .5736401    -1.07   0.286    -1.739371    .5147238
  dummy_dirtfloor97 |    1.86406    2.03781     0.91   0.361    -2.139685    5.867804
dummy_electricity97 |   2.118596   3.432876     0.62   0.537    -4.626077    8.863269
              _cons |  -.6364966   .7012796    -0.91   0.365    -2.014321     .741328
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |      3,859    2.476807    6.147839          0         50

added scalar:
               e(mean) =  2.4768075

. ***Output for Table 2 -- Panel B1 and C1;
. estout ani1_w2347_t2_c1_op ani2_w2347_t2_c1_op land_w2347_t2_c1_op vani1_w2347_t2_c1_op vani2_w2347_t2_c1_op ha_w2347_t2_c1
> _op  
>          ani1_w7_t2_c1_op ani2_w7_t2_c1_op land_w7_t2_c1_op vani1_w7_t2_c1_op vani2_w7_t2_c1_op ha_w7_t2_c1_op 
>         using "$out_p/wave7.text", stats(N mean pvalue, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_op t2_c1_opwave7) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles Unconditional) replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/wave7.text not found)
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/wave7.text)

. estimates clear;

. ***Agricultural Assets: Eligibles, Conditional -- Table 2, Panels B2 & C2;
. foreach x of global dep_dum {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' `y'wave7 wave3 wave4 wave7 $basic $controls if `x'97 ==0, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         test `y' + `y'wave7 =0;
  8.         scalar pvalue =r(p);
  9.         estadd scalar pvalue;
 10.         est store `x'_w2347_`y', title (`x');
 11.         reg `x' `y' $basic $controls if wave ==7 & `x'97 ==0, cl(comuid);
 12.         sum `x' if e(sample) & `y' ==0;
 13.         scalar mean =r(mean);
 14.         estadd scalar mean;
 15.         est store `x'_w7_`y', title (`x');
 16. };
 17. };

Linear regression                               Number of obs     =     28,520
                                                F(37, 495)        =      12.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0642
                                                Root MSE          =     .33035

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0269501   .0114339     2.36   0.019     .0044852     .049415
      t2_c1_opwave7 |   .0093886    .014376     0.65   0.514    -.0188568    .0376341
              wave3 |  -.0010361   .0045798    -0.23   0.821    -.0100343    .0079621
              wave4 |   .0137627   .0064898     2.12   0.034     .0010118    .0265136
              wave7 |   .0529605   .0130233     4.07   0.000     .0273728    .0785483
           nbani197 |          0  (omitted)
           nbani297 |   .0271928   .0035224     7.72   0.000     .0202722    .0341135
               ha97 |   .0046054   .0029671     1.55   0.121    -.0012241     .010435
              no497 |  -.0290144     .00865    -3.35   0.001    -.0460097   -.0120191
             big497 |   .0108663    .014536     0.75   0.455    -.0176936    .0394261
             age_hh |   .0004219   .0009797     0.43   0.667     -.001503    .0023468
            age_hh2 |  -7.54e-06   9.07e-06    -0.83   0.406    -.0000254    .0000103
          female_hh |  -.0286494   .0099474    -2.88   0.004    -.0481937    -.009105
           educ1_hh |   .0315307   .0074768     4.22   0.000     .0168404     .046221
       ethnicity_hh |    -.08452   .0118639    -7.12   0.000    -.1078297   -.0612102
             age_sp |   .0004214   .0006069     0.69   0.488     -.000771    .0016139
            age_sp2 |   3.16e-06   5.43e-06     0.58   0.561    -7.51e-06    .0000138
           educ1_sp |   .0032711   .0077902     0.42   0.675    -.0120348     .018577
         dage0_7_97 |   -.007364   .0084833    -0.87   0.386    -.0240317    .0093037
        dage8_17_97 |   -.002431   .0074247    -0.33   0.743    -.0170188    .0121569
       dage18_54_97 |   .0211868   .0136797     1.55   0.122    -.0056908    .0480643
         dage55p_97 |   .0110682   .0088303     1.25   0.211    -.0062812    .0284176
           hhsize97 |   .0110945    .002016     5.50   0.000     .0071336    .0150554
          homeown97 |   .0119783   .0101936     1.18   0.241    -.0080498    .0320063
        dirtfloor97 |    .010468   .0096137     1.09   0.277    -.0084207    .0293566
      electricity97 |   .0176436   .0096755     1.82   0.069    -.0013665    .0366538
         org_faenas |  -.0172396   .0238152    -0.72   0.469     -.064031    .0295519
           min_dist |  -.0005957   .0001422    -4.19   0.000    -.0008751   -.0003162
       lnup_cwagepm |   .0018556   .0030813     0.60   0.547    -.0041985    .0079097
       up2_mcwagepm |  -.0099258   .0250977    -0.40   0.693    -.0592369    .0393852
       dummy_age_hh |  -.0636916   .0578968    -1.10   0.272    -.1774454    .0500623
      dummy_educ_hh |   .0223105   .0455535     0.49   0.625    -.0671915    .1118125
 dummy_ethnicity_hh |  -.0013111   .0591181    -0.02   0.982    -.1174643    .1148422
       dummy_age_sp |  -.0947867    .035683    -2.66   0.008    -.1648956   -.0246778
      dummy_educ_sp |   .0760742   .0358838     2.12   0.035     .0055709    .1465775
   dummy_dage0_7_97 |   .0679899    .077651     0.88   0.382    -.0845763    .2205561
  dummy_dirtfloor97 |   .1163873   .0937978     1.24   0.215    -.0679036    .3006783
dummy_electricity97 |   .2467638   .2025656     1.22   0.224    -.1512305    .6447582
              _cons |   .0418948   .0429418     0.98   0.330     -.042476    .1262655
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |     11,075    .1176524    .3222106          0          1

added scalar:
               e(mean) =  .11765237

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   495) =    3.66
            Prob > F =    0.0564

added scalar:
             e(pvalue) =  .05640061

Linear regression                               Number of obs     =      6,725
                                                F(33, 485)        =      10.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0715
                                                Root MSE          =     .36497

                                      (Std. Err. adjusted for 486 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0392228   .0186159     2.11   0.036      .002645    .0758006
           nbani197 |          0  (omitted)
           nbani297 |   .0355808   .0048744     7.30   0.000     .0260031    .0451584
               ha97 |   .0072891   .0047199     1.54   0.123    -.0019849    .0165631
              no497 |  -.0273622   .0153376    -1.78   0.075    -.0574985     .002774
             big497 |   .0132139   .0233291     0.57   0.571    -.0326248    .0590526
             age_hh |   .0007219   .0011207     0.64   0.520    -.0014802    .0029241
            age_hh2 |  -8.80e-06   9.73e-06    -0.90   0.366    -.0000279    .0000103
          female_hh |  -.0539649    .014301    -3.77   0.000    -.0820645   -.0258653
           educ1_hh |   .0393088    .012361     3.18   0.002      .015021    .0635966
       ethnicity_hh |  -.0723373   .0181018    -4.00   0.000     -.107905   -.0367696
             age_sp |    .000159   .0011141     0.14   0.887      -.00203    .0023481
            age_sp2 |  -2.35e-06   .0000104    -0.23   0.821    -.0000227     .000018
           educ1_sp |   .0083453   .0132339     0.63   0.529    -.0176575    .0343481
         dage0_7_97 |  -.0009033   .0138796    -0.07   0.948     -.028175    .0263683
        dage8_17_97 |  -.0007354   .0119966    -0.06   0.951    -.0243071    .0228363
       dage18_54_97 |   .0109434   .0210212     0.52   0.603    -.0303604    .0522472
         dage55p_97 |   -.014052   .0129312    -1.09   0.278      -.03946    .0113561
           hhsize97 |   .0128262   .0032672     3.93   0.000     .0064066    .0192457
          homeown97 |  -.0095561   .0180554    -0.53   0.597    -.0450324    .0259203
        dirtfloor97 |   .0195151   .0143796     1.36   0.175     -.008739    .0477692
      electricity97 |   .0313372    .016285     1.92   0.055    -.0006607     .063335
         org_faenas |  -.0207941   .0422219    -0.49   0.623    -.1037546    .0621664
           min_dist |  -.0007922   .0002081    -3.81   0.000    -.0012012   -.0003833
       lnup_cwagepm |    .000533    .003215     0.17   0.868    -.0057841      .00685
       up2_mcwagepm |   .0756146   .0660806     1.14   0.253    -.0542249    .2054542
       dummy_age_hh |  -.0436518   .0544687    -0.80   0.423    -.1506755    .0633719
      dummy_educ_hh |  -.0611861   .0661054    -0.93   0.355    -.1910744    .0687023
 dummy_ethnicity_hh |   .0506767   .1003504     0.50   0.614    -.1464986    .2478519
       dummy_age_sp |  -.0195521   .0775279    -0.25   0.801    -.1718841    .1327799
      dummy_educ_sp |  -.0259295   .0777345    -0.33   0.739    -.1786675    .1268086
   dummy_dage0_7_97 |   .1102985   .1215531     0.91   0.365    -.1285372    .3491342
  dummy_dirtfloor97 |   .1687979   .1221701     1.38   0.168    -.0712502     .408846
dummy_electricity97 |   .1665524     .24007     0.69   0.488    -.3051533    .6382581
              _cons |     .11713   .0683653     1.71   0.087    -.0171988    .2514587
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |      2,605    .1516315    .3587322          0          1

added scalar:
               e(mean) =  .15163148

Linear regression                               Number of obs     =      7,720
                                                F(37, 405)        =       7.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0414
                                                Root MSE          =     .49058

                                      (Std. Err. adjusted for 406 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0558952   .0261844     2.13   0.033     .0044208    .1073696
      t2_c1_opwave7 |  -.0075722    .031424    -0.24   0.810    -.0693466    .0542022
              wave3 |   .0159578   .0176965     0.90   0.368    -.0188307    .0507462
              wave4 |   .0568714   .0189619     3.00   0.003     .0195952    .0941475
              wave7 |   .1090392   .0278166     3.92   0.000     .0543562    .1637222
           nbani197 |   .0497491   .0166816     2.98   0.003     .0169558    .0825425
           nbani297 |          0  (omitted)
               ha97 |   .0029895   .0047591     0.63   0.530    -.0063661    .0123451
              no497 |  -.0059001   .0205267    -0.29   0.774    -.0462523    .0344522
             big497 |   .0607129    .033762     1.80   0.073    -.0056577    .1270835
             age_hh |    .003587   .0029338     1.22   0.222    -.0021804    .0093543
            age_hh2 |  -.0000381   .0000271    -1.41   0.161    -.0000915    .0000152
          female_hh |    .077349   .0321376     2.41   0.017     .0141716    .1405263
           educ1_hh |  -.0224347   .0198414    -1.13   0.259    -.0614396    .0165703
       ethnicity_hh |  -.0351932   .0271011    -1.30   0.195    -.0884697    .0180832
             age_sp |   .0001629   .0017799     0.09   0.927     -.003336    .0036619
            age_sp2 |   .0000202    .000015     1.35   0.178    -9.22e-06    .0000496
           educ1_sp |   .0098804   .0245734     0.40   0.688    -.0384269    .0581878
         dage0_7_97 |   .0108866   .0252915     0.43   0.667    -.0388324    .0606056
        dage8_17_97 |   .0183216    .021717     0.84   0.399    -.0243706    .0610138
       dage18_54_97 |   .1031306   .0352582     2.93   0.004     .0338186    .1724426
         dage55p_97 |   .0610285   .0257735     2.37   0.018      .010362     .111695
           hhsize97 |   .0078788   .0055119     1.43   0.154    -.0029568    .0187144
          homeown97 |   .0114829   .0247939     0.46   0.644    -.0372579    .0602236
        dirtfloor97 |   .0218831    .020995     1.04   0.298    -.0193896    .0631559
      electricity97 |  -.0283714    .024211    -1.17   0.242    -.0759664    .0192236
         org_faenas |  -.0170247   .0432193    -0.39   0.694    -.1019869    .0679375
           min_dist |  -6.09e-06   .0002605    -0.02   0.981    -.0005182     .000506
       lnup_cwagepm |   .0043261   .0050426     0.86   0.391    -.0055868    .0142391
       up2_mcwagepm |   .0186239   .0483457     0.39   0.700     -.076416    .1136637
       dummy_age_hh |   .2169723   .1681359     1.29   0.198    -.1135557    .5475004
      dummy_educ_hh |   .0086973   .0990026     0.09   0.930    -.1859258    .2033204
 dummy_ethnicity_hh |  -.0008717   .1385294    -0.01   0.995    -.2731981    .2714547
       dummy_age_sp |  -.1699461   .0612089    -2.78   0.006    -.2902728   -.0496193
      dummy_educ_sp |  -.0038174   .0566073    -0.07   0.946    -.1150981    .1074633
   dummy_dage0_7_97 |   .2810996   .1231756     2.28   0.023     .0389562    .5232431
  dummy_dirtfloor97 |   .1907687   .1417677     1.35   0.179    -.0879237     .469461
dummy_electricity97 |  -.1011142   .1357781    -0.74   0.457    -.3680321    .1658037
              _cons |   .1676305   .0953839     1.76   0.080    -.0198789    .3551399
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |      2,814    .4744136    .4994337          0          1

added scalar:
               e(mean) =  .47441365

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   405) =    2.06
            Prob > F =    0.1524

added scalar:
             e(pvalue) =  .15242837

Linear regression                               Number of obs     =      1,772
                                                F(32, 383)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0422
                                                Root MSE          =     .48781

                                      (Std. Err. adjusted for 384 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0474029   .0347165     1.37   0.173    -.0208558    .1156617
           nbani197 |   .0204099   .0224119     0.91   0.363    -.0236559    .0644757
           nbani297 |          0  (omitted)
               ha97 |   .0089768   .0085768     1.05   0.296    -.0078868    .0258403
              no497 |  -.0117712   .0292644    -0.40   0.688    -.0693102    .0457678
             big497 |  -.0033028   .0553959    -0.06   0.952    -.1122209    .1056153
             age_hh |   .0034442   .0039583     0.87   0.385    -.0043385    .0112268
            age_hh2 |  -.0000133   .0000354    -0.38   0.707     -.000083    .0000564
          female_hh |   .0199853   .0480687     0.42   0.678    -.0745263    .1144969
           educ1_hh |   -.033819   .0338155    -1.00   0.318    -.1003064    .0326683
       ethnicity_hh |   .0333313   .0389413     0.86   0.393    -.0432343    .1098969
             age_sp |  -.0007008   .0032915    -0.21   0.832    -.0071725    .0057709
            age_sp2 |   .0000188   .0000295     0.64   0.524    -.0000392    .0000767
           educ1_sp |   .0197644   .0334466     0.59   0.555    -.0459975    .0855263
         dage0_7_97 |   .0334175   .0390113     0.86   0.392    -.0432856    .1101207
        dage8_17_97 |   .0235782   .0321357     0.73   0.464    -.0396063    .0867628
       dage18_54_97 |   .1607569   .0670711     2.40   0.017     .0288832    .2926306
         dage55p_97 |  -.0185611   .0471265    -0.39   0.694    -.1112201     .074098
           hhsize97 |   .0051752    .008005     0.65   0.518     -.010564    .0209144
          homeown97 |  -.0227338   .0410752    -0.55   0.580     -.103495    .0580273
        dirtfloor97 |   .0525534   .0321071     1.64   0.102    -.0105748    .1156816
      electricity97 |  -.0686138    .032754    -2.09   0.037    -.1330139   -.0042136
         org_faenas |  -.0420535   .0616893    -0.68   0.496    -.1633456    .0792385
           min_dist |  -.0002965   .0004258    -0.70   0.487    -.0011336    .0005407
       lnup_cwagepm |   .0084808    .005806     1.46   0.145    -.0029348    .0198964
       up2_mcwagepm |  -.0534586   .0719963    -0.74   0.458     -.195016    .0880988
       dummy_age_hh |   .1763171   .2247781     0.78   0.433    -.2656364    .6182706
      dummy_educ_hh |  -.1614052   .2036594    -0.79   0.429    -.5618356    .2390251
 dummy_ethnicity_hh |   .1076257   .2958346     0.36   0.716    -.4740376    .6892891
       dummy_age_sp |  -.1200393    .198709    -0.60   0.546    -.5107363    .2706577
      dummy_educ_sp |  -.0575544   .1990487    -0.29   0.773    -.4489194    .3338106
   dummy_dage0_7_97 |   .4240823   .1697783     2.50   0.013      .090268    .7578966
  dummy_dirtfloor97 |   .1656267   .2521527     0.66   0.512    -.3301502    .6614036
dummy_electricity97 |   .3536263    .070791     5.00   0.000     .2144387    .4928139
              _cons |   .2807165     .14681     1.91   0.057     -.007938    .5693709
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |        646    .5448916    .4983665          0          1

added scalar:
               e(mean) =  .54489164

Linear regression                               Number of obs     =     17,720
                                                F(36, 474)        =      24.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0917
                                                Root MSE          =     .46444

                                      (Std. Err. adjusted for 475 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0512716   .0229254     2.24   0.026     .0062236    .0963197
      t2_c1_opwave7 |  -.0115565   .0236209    -0.49   0.625    -.0579712    .0348582
              wave3 |  -.0181955   .0123304    -1.48   0.141    -.0424246    .0060335
              wave4 |   .0357625   .0137748     2.60   0.010     .0086953    .0628298
              wave7 |   .0965164   .0205305     4.70   0.000     .0561743    .1368584
           nbani197 |   .0195183   .0139525     1.40   0.162     -.007898    .0469347
           nbani297 |   .0350076   .0048938     7.15   0.000     .0253914    .0446238
               ha97 |          0  (omitted)
              no497 |  -.0796294   .0130594    -6.10   0.000    -.1052909   -.0539679
             big497 |          0  (omitted)
             age_hh |   .0050499   .0019641     2.57   0.010     .0011905    .0089094
            age_hh2 |  -.0000313   .0000191    -1.64   0.102    -.0000688    6.23e-06
          female_hh |  -.1197695    .022073    -5.43   0.000    -.1631426   -.0763965
           educ1_hh |   .0350693   .0138168     2.54   0.011     .0079195    .0622191
       ethnicity_hh |   .1218203   .0252073     4.83   0.000     .0722884    .1713522
             age_sp |  -.0019425   .0010747    -1.81   0.071    -.0040542    .0001692
            age_sp2 |   .0000158   9.25e-06     1.71   0.088    -2.35e-06     .000034
           educ1_sp |   .0288368   .0128758     2.24   0.026     .0035361    .0541375
         dage0_7_97 |  -.0127734   .0157941    -0.81   0.419    -.0438085    .0182617
        dage8_17_97 |   .0103335   .0124355     0.83   0.406    -.0141021     .034769
       dage18_54_97 |   .0218797   .0262367     0.83   0.405     -.029675    .0734345
         dage55p_97 |   .0244093   .0185305     1.32   0.188    -.0120029    .0608214
           hhsize97 |   .0129389   .0037231     3.48   0.001     .0056232    .0202547
          homeown97 |   .0817202   .0145296     5.62   0.000     .0531699    .1102705
        dirtfloor97 |   .0237464   .0145383     1.63   0.103    -.0048211    .0523139
      electricity97 |   .0017108   .0170351     0.10   0.920    -.0317628    .0351845
         org_faenas |  -.0399857   .0459075    -0.87   0.384     -.130193    .0502216
           min_dist |   .0002434   .0002798     0.87   0.385    -.0003064    .0007932
       lnup_cwagepm |   -.014345   .0041316    -3.47   0.001    -.0224635   -.0062266
       up2_mcwagepm |  -.0095982   .0401458    -0.24   0.811    -.0884839    .0692875
       dummy_age_hh |  -.1237236    .098971    -1.25   0.212    -.3181997    .0707525
      dummy_educ_hh |   .0645367   .0814686     0.79   0.429    -.0955475    .2246208
 dummy_ethnicity_hh |  -.0387042   .0631692    -0.61   0.540    -.1628305    .0854221
       dummy_age_sp |  -.1107133   .0421138    -2.63   0.009    -.1934661   -.0279604
      dummy_educ_sp |   .0963354   .0413542     2.33   0.020     .0150751    .1775956
   dummy_dage0_7_97 |   .0554937   .1156043     0.48   0.631    -.1716666     .282654
  dummy_dirtfloor97 |   .0583166   .0993813     0.59   0.558    -.1369658     .253599
dummy_electricity97 |   .0377956   .1698794     0.22   0.824    -.2960143    .3716055
              _cons |   .0569778   .0701971     0.81   0.417    -.0809583    .1949139
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |      6,968    .3551952    .4786068          0          1

added scalar:
               e(mean) =  .35519518

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   474) =    2.21
            Prob > F =    0.1378

added scalar:
             e(pvalue) =  .13781122

Linear regression                               Number of obs     =      4,108
                                                F(31, 465)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1044
                                                Root MSE          =     .47448

                                      (Std. Err. adjusted for 466 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0380251   .0267384     1.42   0.156     -.014518    .0905682
           nbani197 |   .0268515   .0256396     1.05   0.296    -.0235323    .0772353
           nbani297 |   .0362212   .0068423     5.29   0.000     .0227755    .0496668
               ha97 |          0  (omitted)
              no497 |  -.0914854    .022595    -4.05   0.000    -.1358864   -.0470843
             big497 |          0  (omitted)
             age_hh |   .0030456   .0023877     1.28   0.203    -.0016464    .0077376
            age_hh2 |   4.19e-06   .0000227     0.18   0.854    -.0000403    .0000487
          female_hh |  -.1431381   .0296869    -4.82   0.000    -.2014753    -.084801
           educ1_hh |   .0277082   .0197461     1.40   0.161    -.0110943    .0665108
       ethnicity_hh |   .1359497   .0286583     4.74   0.000      .079634    .1922655
             age_sp |  -.0029908   .0019548    -1.53   0.127    -.0068321    .0008505
            age_sp2 |   .0000128   .0000151     0.85   0.397    -.0000168    .0000423
           educ1_sp |   .0356633   .0199461     1.79   0.074    -.0035323    .0748589
         dage0_7_97 |  -.0196667   .0237024    -0.83   0.407    -.0662438    .0269105
        dage8_17_97 |   .0268224   .0189671     1.41   0.158    -.0104494    .0640941
       dage18_54_97 |   .1383749   .0407702     3.39   0.001     .0582583    .2184915
         dage55p_97 |  -.0101384   .0260412    -0.39   0.697    -.0613115    .0410347
           hhsize97 |   .0124872   .0053372     2.34   0.020     .0019992    .0229753
          homeown97 |   .0905275   .0254405     3.56   0.000     .0405348    .1405202
        dirtfloor97 |   .0215848   .0225842     0.96   0.340     -.022795    .0659645
      electricity97 |  -.0094278   .0228952    -0.41   0.681    -.0544186     .035563
         org_faenas |  -.0696836   .0330357    -2.11   0.035    -.1346014   -.0047658
           min_dist |   .0002379   .0003377     0.70   0.482    -.0004257    .0009015
       lnup_cwagepm |  -.0113792   .0043827    -2.60   0.010    -.0199916   -.0027668
       up2_mcwagepm |   .0278107   .0499788     0.56   0.578    -.0704016    .1260231
       dummy_age_hh |  -.2695266   .1180514    -2.28   0.023    -.5015069   -.0375463
      dummy_educ_hh |   .0640708   .1388003     0.46   0.645    -.2086828    .3368244
 dummy_ethnicity_hh |   .0220628   .1870429     0.12   0.906    -.3454911    .3896168
       dummy_age_sp |   -.081815   .1139521    -0.72   0.473    -.3057399    .1421098
      dummy_educ_sp |   .0214506    .108798     0.20   0.844    -.1923459    .2352472
   dummy_dage0_7_97 |    .255609   .1648259     1.55   0.122    -.0682868    .5795049
  dummy_dirtfloor97 |   .0360491   .1824022     0.20   0.843    -.3223855    .3944837
dummy_electricity97 |   -.155417   .0495717    -3.14   0.002    -.2528292   -.0580048
              _cons |   .1267146   .0996242     1.27   0.204    -.0690547     .322484
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |      1,624    .4464286    .4972749          0          1

added scalar:
               e(mean) =  .44642857

. ***Eligibles - Conditional - continuous;
. foreach x of global dep_cont {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' `y'wave7 wave3 wave4 wave7 $basic $controls if `x'97 >0, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         test `y' + `y'wave7 =0;
  8.         scalar pvalue =r(p);
  9.         estadd scalar pvalue;
 10.         est store `x'_w2347_`y', title (`x');
 11.         reg `x' `y' $basic $controls if wave ==7 & `x'97 >0, cl(comuid);
 12.         sum `x' if e(sample) & `y' ==0;
 13.         scalar mean =r(mean);
 14.         estadd scalar mean;
 15.         est store `x'_w7_`y', title (`x');
 16. };
 17. };

Linear regression                               Number of obs     =     14,788
                                                F(36, 461)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1547
                                                Root MSE          =     1494.8

                                      (Std. Err. adjusted for 462 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   110.2014   57.48611     1.92   0.056    -2.765897    223.1687
      t2_c1_opwave7 |   44.16215   102.8547     0.43   0.668    -157.9601    246.2844
              wave3 |  -16.70118   30.99366    -0.54   0.590    -77.60754    44.20517
              wave4 |  -57.61465   34.51205    -1.67   0.096    -125.4351    10.20578
              wave7 |   588.5871   86.84713     6.78   0.000     417.9218    759.2524
           nbani197 |   247.4225   44.98053     5.50   0.000     159.0302    335.8148
           nbani297 |   65.61196    9.92426     6.61   0.000     46.10957    85.11436
               ha97 |   12.08066   12.56083     0.96   0.337    -12.60291    36.76423
              no497 |          0  (omitted)
             big497 |    124.553    63.7299     1.95   0.051    -.6841567    249.7901
             age_hh |   16.61234   6.891013     2.41   0.016     3.070647    30.15403
            age_hh2 |  -.1172853   .0690515    -1.70   0.090    -.2529799    .0184094
          female_hh |  -244.7619   86.34792    -2.83   0.005    -414.4462   -75.07763
           educ1_hh |   32.72968   44.12435     0.74   0.459    -53.98011    119.4395
       ethnicity_hh |  -377.0432    44.6477    -8.44   0.000    -464.7814    -289.305
             age_sp |   3.135377     5.5057     0.57   0.569    -7.684002    13.95476
            age_sp2 |  -.0378111   .0510065    -0.74   0.459    -.1380452     .062423
           educ1_sp |  -26.61018   53.83752    -0.49   0.621    -132.4075    79.18719
         dage0_7_97 |  -90.75662    42.7512    -2.12   0.034     -174.768   -6.745236
        dage8_17_97 |   -6.66159   42.38381    -0.16   0.875      -89.951    76.62782
       dage18_54_97 |  -82.83468   96.06835    -0.86   0.389    -271.6208    105.9515
         dage55p_97 |  -79.03178   47.68766    -1.66   0.098    -172.7439    14.68035
           hhsize97 |   36.77449   10.78498     3.41   0.001     15.58068    57.96831
          homeown97 |   8.905433   81.05891     0.11   0.913    -150.3853    168.1962
        dirtfloor97 |  -52.81107   44.32242    -1.19   0.234    -139.9101    34.28793
      electricity97 |   77.01903    51.4372     1.50   0.135     -24.0614    178.0995
         org_faenas |  -137.3027   97.96503    -1.40   0.162    -329.8161    55.21063
           min_dist |  -2.442537   .6653923    -3.67   0.000    -3.750115   -1.134959
       lnup_cwagepm |   26.26358   19.32335     1.36   0.175    -11.70919    64.23635
       up2_mcwagepm |   105.1576    123.959     0.85   0.397    -138.4372    348.7523
       dummy_age_hh |   675.0319   408.8299     1.65   0.099    -128.3693    1478.433
      dummy_educ_hh |  -77.88689   215.8642    -0.36   0.718    -502.0866    346.3129
 dummy_ethnicity_hh |  -933.3829   212.6066    -4.39   0.000    -1351.181   -515.5847
       dummy_age_sp |  -211.6084   373.1349    -0.57   0.571    -944.8645    521.6476
      dummy_educ_sp |   156.6172    360.751     0.43   0.664     -552.303    865.5373
   dummy_dage0_7_97 |   1367.245   713.3978     1.92   0.056    -34.66953     2769.16
  dummy_dirtfloor97 |  -123.1048   114.5615    -1.07   0.283    -348.2324    102.0227
dummy_electricity97 |  -455.6216   104.0096    -4.38   0.000    -660.0133   -251.2299
              _cons |   37.60971    244.588     0.15   0.878    -443.0359    518.2553
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |      5,295    878.4032    1492.374          0   21687.83

added scalar:
               e(mean) =  878.40321

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   461) =    1.85
            Prob > F =    0.1748

added scalar:
             e(pvalue) =  .17481

Linear regression                               Number of obs     =      3,511
                                                F(32, 458)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1282
                                                Root MSE          =     2073.9

                                      (Std. Err. adjusted for 459 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   185.1413    111.156     1.67   0.096    -33.29759    403.5802
           nbani197 |   329.0957   71.26483     4.62   0.000     189.0491    469.1423
           nbani297 |   111.6243   20.33993     5.49   0.000     71.65317    151.5955
               ha97 |   27.23026   34.68249     0.79   0.433    -40.92628     95.3868
              no497 |          0  (omitted)
             big497 |   26.53788    151.697     0.17   0.861    -271.5705    324.6462
             age_hh |   8.419797   13.43837     0.63   0.531    -17.98871     34.8283
            age_hh2 |  -.0325829   .1326959    -0.25   0.806    -.2933513    .2281855
          female_hh |  -324.9731   154.0334    -2.11   0.035     -627.673   -22.27332
           educ1_hh |   154.3616   92.81064     1.66   0.097     -28.0259    336.7491
       ethnicity_hh |  -448.6104   124.8681    -3.59   0.000    -693.9958   -203.2249
             age_sp |  -5.731825   14.58434    -0.39   0.694    -34.39235     22.9287
            age_sp2 |   .0664689   .1384234     0.48   0.631    -.2055548    .3384926
           educ1_sp |    72.5869   94.09664     0.77   0.441    -112.3278    257.5016
         dage0_7_97 |  -37.03024   102.1499    -0.36   0.717    -237.7708    163.7104
        dage8_17_97 |   42.79554   104.3794     0.41   0.682    -162.3263    247.9174
       dage18_54_97 |   214.0589   169.2992     1.26   0.207    -118.6407    546.7585
         dage55p_97 |  -209.9025    102.028    -2.06   0.040    -410.4036   -9.401446
           hhsize97 |   45.86699   23.81034     1.93   0.055    -.9240664    92.65804
          homeown97 |   4.462384   175.7264     0.03   0.980    -340.8676    349.7924
        dirtfloor97 |   108.5881   94.80756     1.15   0.253    -77.72363    294.8999
      electricity97 |   151.1432   99.21024     1.52   0.128     -43.8205    346.1069
         org_faenas |  -321.7364   195.7834    -1.64   0.101    -706.4816    63.00879
           min_dist |  -3.401162   1.191021    -2.86   0.004    -5.741705   -1.060618
       lnup_cwagepm |   8.575553   21.21816     0.40   0.686    -33.12146    50.27256
       up2_mcwagepm |   333.9062   216.6576     1.54   0.124    -91.86001    759.6724
       dummy_age_hh |   782.3413   793.7447     0.99   0.325    -777.4918    2342.174
      dummy_educ_hh |   440.6071    809.144     0.54   0.586    -1149.488    2030.702
 dummy_ethnicity_hh |  -1804.908   854.4777    -2.11   0.035     -3484.09   -125.7247
       dummy_age_sp |  -865.4743   1093.992    -0.79   0.429    -3015.341    1284.392
      dummy_educ_sp |   644.1669   1082.143     0.60   0.552    -1482.415    2770.748
   dummy_dage0_7_97 |   210.7644    369.992     0.57   0.569     -516.328    937.8569
  dummy_dirtfloor97 |    662.325   681.1547     0.97   0.331    -676.2509    2000.901
dummy_electricity97 |  -230.3695    192.291    -1.20   0.232    -608.2516    147.5126
              _cons |   449.9591   532.4853     0.85   0.399    -596.4582    1496.376
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |      1,280    1306.504    1936.032          0   21687.83

added scalar:
               e(mean) =  1306.5036

Linear regression                               Number of obs     =     35,564
                                                F(37, 500)        =      25.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2269
                                                Root MSE          =     2869.5

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   201.6109    73.5573     2.74   0.006     57.09138    346.1304
      t2_c1_opwave7 |  -135.7723   91.92182    -1.48   0.140    -316.3729     44.8283
              wave3 |   7.357743   37.41735     0.20   0.844    -66.15687    80.87235
              wave4 |   58.06311   55.75836     1.04   0.298    -51.48643    167.6127
              wave7 |   355.5833   91.92297     3.87   0.000     174.9804    536.1862
           nbani197 |   201.4524   50.21173     4.01   0.000     102.8004    300.1044
           nbani297 |   550.6367   39.48219    13.95   0.000     473.0652    628.2081
               ha97 |   46.20992   23.32582     1.98   0.048     .3812217    92.03862
              no497 |          0  (omitted)
             big497 |    135.592   111.1514     1.22   0.223    -82.78944    353.9735
             age_hh |   32.40775    8.61206     3.76   0.000     15.48746    49.32803
            age_hh2 |  -.2327645   .0858139    -2.71   0.007    -.4013647   -.0641643
          female_hh |  -212.3155   83.58951    -2.54   0.011    -376.5455   -48.08556
           educ1_hh |  -35.58734   60.90808    -0.58   0.559    -155.2547    84.07998
       ethnicity_hh |  -471.8016   78.78492    -5.99   0.000    -626.5919   -317.0113
             age_sp |   12.07999    4.34938     2.78   0.006     3.534682    20.62531
            age_sp2 |  -.1179392   .0358101    -3.29   0.001     -.188296   -.0475824
           educ1_sp |  -85.55876    63.6489    -1.34   0.179     -210.611    39.49349
         dage0_7_97 |   -124.225   67.51334    -1.84   0.066    -256.8698    8.419771
        dage8_17_97 |    9.24644   56.03131     0.17   0.869    -100.8394    119.3323
       dage18_54_97 |   221.5502   98.40362     2.25   0.025     28.21464    414.8857
         dage55p_97 |  -69.10262   74.44486    -0.93   0.354    -215.3659    77.16067
           hhsize97 |   33.28076   14.48565     2.30   0.022     4.820526      61.741
          homeown97 |   78.94634   82.28432     0.96   0.338    -82.71929     240.612
        dirtfloor97 |  -511.0236   75.32213    -6.78   0.000    -659.0105   -363.0367
      electricity97 |    .902198   59.67043     0.02   0.988    -116.3335    118.1379
         org_faenas |   51.77043   114.3228     0.45   0.651    -172.8417    276.3826
           min_dist |   -.915274    .787453    -1.16   0.246    -2.462399    .6318506
       lnup_cwagepm |   39.54397   15.35168     2.58   0.010     9.382223    69.70571
       up2_mcwagepm |   -44.7047   122.8615    -0.36   0.716    -286.0932    196.6838
       dummy_age_hh |   639.6085   591.4739     1.08   0.280    -522.4721    1801.689
      dummy_educ_hh |   275.5445   689.9001     0.40   0.690    -1079.916    1631.005
 dummy_ethnicity_hh |  -919.6201   374.3234    -2.46   0.014    -1655.061   -184.1794
       dummy_age_sp |     40.407   230.9816     0.17   0.861    -413.4071    494.2211
      dummy_educ_sp |  -77.53927   221.4014    -0.35   0.726     -512.531    357.4525
   dummy_dage0_7_97 |   1868.855   1431.571     1.31   0.192    -943.7806    4681.491
  dummy_dirtfloor97 |  -620.2541   246.7941    -2.51   0.012    -1105.135   -135.3727
dummy_electricity97 |   550.0132   312.8903     1.76   0.079    -64.72858    1164.755
              _cons |  -629.6798   245.7383    -2.56   0.011    -1112.487   -146.8729
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |     13,533    1349.875    3129.866          0   46596.51

added scalar:
               e(mean) =  1349.8748

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   500) =    0.47
            Prob > F =    0.4927

added scalar:
             e(pvalue) =  .49268944

Linear regression                               Number of obs     =      8,460
                                                F(33, 499)        =      16.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2014
                                                Root MSE          =     2993.5

                                      (Std. Err. adjusted for 500 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   75.02458   97.83213     0.77   0.444    -117.1891    267.2382
           nbani197 |   214.7896   79.37133     2.71   0.007     58.84645    370.7328
           nbani297 |    515.419   50.46631    10.21   0.000     416.2664    614.5716
               ha97 |    58.7821   27.34204     2.15   0.032     5.062388    112.5018
              no497 |          0  (omitted)
             big497 |   90.27099   138.1967     0.65   0.514    -181.2481    361.7901
             age_hh |    33.5333   11.83226     2.83   0.005     10.28612    56.78048
            age_hh2 |  -.2781152   .1083776    -2.57   0.011    -.4910478   -.0651826
          female_hh |  -273.2207    134.718    -2.03   0.043     -537.905   -8.536324
           educ1_hh |  -38.60096   83.88511    -0.46   0.646    -203.4125    126.2106
       ethnicity_hh |  -386.6444   110.4267    -3.50   0.001    -603.6029   -169.6858
             age_sp |   17.24308   7.360131     2.34   0.020     2.782418    31.70375
            age_sp2 |  -.1328288   .0546297    -2.43   0.015    -.2401613   -.0254963
           educ1_sp |  -61.68903   96.64106    -0.64   0.524    -251.5626    128.1845
         dage0_7_97 |  -59.62244   104.8846    -0.57   0.570    -265.6923    146.4474
        dage8_17_97 |  -92.73343   87.85431    -1.06   0.292    -265.3434    79.87651
       dage18_54_97 |   280.4251   137.2737     2.04   0.042     10.71931    550.1308
         dage55p_97 |  -83.57615   96.49943    -0.87   0.387    -273.1714    106.0191
           hhsize97 |   67.36753    22.6634     2.97   0.003     22.84008     111.895
          homeown97 |   142.0467   131.5106     1.08   0.281    -116.3361    400.4294
        dirtfloor97 |  -517.4526    110.373    -4.69   0.000    -734.3057   -300.5995
      electricity97 |   59.02219    85.7935     0.69   0.492    -109.5388    227.5832
         org_faenas |   45.97525   108.2767     0.42   0.671    -166.7592    258.7097
           min_dist |  -1.496969   1.132579    -1.32   0.187     -3.72218    .7282415
       lnup_cwagepm |   36.15455   16.39401     2.21   0.028     3.944748    68.36434
       up2_mcwagepm |   35.92426   212.2492     0.17   0.866     -381.088    452.9366
       dummy_age_hh |   1271.612   805.9319     1.58   0.115    -311.8266     2855.05
      dummy_educ_hh |  -693.9777    286.642    -2.42   0.016    -1257.152   -130.8038
 dummy_ethnicity_hh |  -1389.316   724.5753    -1.92   0.056     -2812.91    34.27858
       dummy_age_sp |   257.9253   406.8019     0.63   0.526    -541.3302    1057.181
      dummy_educ_sp |   -287.898   384.6929    -0.75   0.455    -1043.715    467.9193
   dummy_dage0_7_97 |  -385.8524   675.4288    -0.57   0.568    -1712.887    941.1824
  dummy_dirtfloor97 |  -549.0762   457.4009    -1.20   0.231    -1447.745    349.5927
dummy_electricity97 |   1350.264   1038.735     1.30   0.194    -690.5693    3391.097
              _cons |  -680.7184   377.6974    -1.80   0.072    -1422.792    61.35485
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |      3,235    1574.968    3327.397          0   43120.78

added scalar:
               e(mean) =  1574.9675

Linear regression                               Number of obs     =     25,107
                                                F(37, 485)        =      18.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0885
                                                Root MSE          =     3.2688

                                      (Std. Err. adjusted for 486 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0506379   .0874118     0.58   0.563    -.1211146    .2223905
      t2_c1_opwave7 |  -.3947429   .2081972    -1.90   0.059    -.8038229     .014337
              wave3 |  -.1369003    .044576    -3.07   0.002    -.2244862   -.0493145
              wave4 |  -.0124623   .0534776    -0.23   0.816    -.1175386    .0926141
              wave7 |   1.442362    .193175     7.47   0.000     1.062799    1.821926
           nbani197 |   .0672486   .0312168     2.15   0.032     .0059118    .1285855
           nbani297 |    .067667   .0156432     4.33   0.000     .0369302    .0984038
               ha97 |    .193722   .0379319     5.11   0.000     .1191909     .268253
              no497 |          0  (omitted)
             big497 |   .4301657   .1173879     3.66   0.000      .199514    .6608173
             age_hh |   .0458479   .0109986     4.17   0.000     .0242371    .0674588
            age_hh2 |  -.0003059   .0001106    -2.77   0.006    -.0005233   -.0000885
          female_hh |  -.4921601   .1052331    -4.68   0.000    -.6989292   -.2853911
           educ1_hh |   -.042541   .0671414    -0.63   0.527    -.1744649     .089383
       ethnicity_hh |  -.1163181   .0816617    -1.42   0.155    -.2767724    .0441362
             age_sp |  -.0032134   .0065938    -0.49   0.626    -.0161694    .0097425
            age_sp2 |    .000028   .0000644     0.44   0.663    -.0000985    .0001545
           educ1_sp |  -.0821282    .066004    -1.24   0.214    -.2118174    .0475609
         dage0_7_97 |  -.1253117   .0715016    -1.75   0.080    -.2658029    .0151795
        dage8_17_97 |   .1614588   .0612419     2.64   0.009     .0411266    .2817909
       dage18_54_97 |   .4604419   .1234169     3.73   0.000      .217944    .7029397
         dage55p_97 |   .0431442   .0677269     0.64   0.524    -.0899301    .1762186
           hhsize97 |   .0065308   .0150868     0.43   0.665    -.0231129    .0361744
          homeown97 |   .4586372   .1382069     3.32   0.001      .187079    .7301955
        dirtfloor97 |    .055225   .0722946     0.76   0.445    -.0868243    .1972743
      electricity97 |   .1421806   .0750588     1.89   0.059    -.0052999    .2896611
         org_faenas |   .0467199   .1380303     0.34   0.735    -.2244913    .3179312
           min_dist |    .000794   .0009296     0.85   0.393    -.0010325    .0026206
       lnup_cwagepm |   .0575339   .0278591     2.07   0.039     .0027945    .1122733
       up2_mcwagepm |   .0497844   .2024192     0.25   0.806    -.3479424    .4475112
       dummy_age_hh |   .2461745   .9044812     0.27   0.786    -1.531011     2.02336
      dummy_educ_hh |   .2504222   .3550294     0.71   0.481    -.4471635    .9480079
 dummy_ethnicity_hh |    .113405   .6186934     0.18   0.855    -1.102245    1.329055
       dummy_age_sp |   -.327127   .3197902    -1.02   0.307    -.9554723    .3012183
      dummy_educ_sp |   .4313165   .3257967     1.32   0.186    -.2088308    1.071464
   dummy_dage0_7_97 |   .0231266   .6017719     0.04   0.969    -1.159275    1.205529
  dummy_dirtfloor97 |   .8151847   .7001848     1.16   0.245    -.5605855    2.190955
dummy_electricity97 |     .99046   1.270888     0.78   0.436    -1.506666    3.487586
              _cons |  -1.735836   .3694951    -4.70   0.000    -2.461845   -1.009827
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |      9,214    2.133181    3.750512          0         50

added scalar:
               e(mean) =  2.133181

 ( 1)  t2_c1_op + t2_c1_opwave7 = 0

       F(  1,   485) =    2.48
            Prob > F =    0.1163

added scalar:
             e(pvalue) =  .11630789

Linear regression                               Number of obs     =      5,939
                                                F(33, 480)        =       5.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0418
                                                Root MSE          =     5.6162

                                      (Std. Err. adjusted for 481 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   -.281997   .2102613    -1.34   0.180    -.6951433    .1311493
           nbani197 |  -.0032925    .078915    -0.04   0.967    -.1583541    .1517692
           nbani297 |   .1114021   .0378111     2.95   0.003     .0371063    .1856979
               ha97 |   .2268399   .0673704     3.37   0.001     .0944625    .3592172
              no497 |          0  (omitted)
             big497 |    .614932   .2698447     2.28   0.023     .0847091    1.145155
             age_hh |   .0377885   .0215526     1.75   0.080    -.0045606    .0801377
            age_hh2 |  -.0001132   .0002289    -0.49   0.621    -.0005629    .0003366
          female_hh |  -.9308771   .2552941    -3.65   0.000    -1.432509   -.4292451
           educ1_hh |   .0883884   .1745494     0.51   0.613    -.2545869    .4313637
       ethnicity_hh |   .1882396   .2067715     0.91   0.363    -.2180496    .5945288
             age_sp |  -.0038715   .0120365    -0.32   0.748    -.0275222    .0197793
            age_sp2 |   9.21e-06   .0001012     0.09   0.928    -.0001897    .0002081
           educ1_sp |  -.0254256   .1759997    -0.14   0.885    -.3712506    .3203995
         dage0_7_97 |    .002835   .2030554     0.01   0.989    -.3961523    .4018223
        dage8_17_97 |   .3457565   .1781584     1.94   0.053    -.0043102    .6958233
       dage18_54_97 |   1.202534   .3680658     3.27   0.001      .479315    1.925754
         dage55p_97 |   .0217289   .1886227     0.12   0.908    -.3488993    .3923571
           hhsize97 |  -.0609048   .0430246    -1.42   0.158    -.1454447    .0236351
          homeown97 |   .7231005   .4936302     1.46   0.144    -.2468426    1.693044
        dirtfloor97 |   .0316342   .1699572     0.19   0.852    -.3023178    .3655861
      electricity97 |   .2662996   .1912554     1.39   0.164    -.1095017    .6421009
         org_faenas |   .0903665   .3106537     0.29   0.771    -.5200426    .7007757
           min_dist |  -.0007552   .0026981    -0.28   0.780    -.0060568    .0045464
       lnup_cwagepm |   .0559908   .0298776     1.87   0.062    -.0027162    .1146978
       up2_mcwagepm |   .2999646   .8103149     0.37   0.711    -1.292238    1.892167
       dummy_age_hh |  -.3723979   .8917772    -0.42   0.676    -2.124667    1.379872
      dummy_educ_hh |   .2220625   .6425916     0.35   0.730    -1.040578    1.484703
 dummy_ethnicity_hh |   .7448661   1.380615     0.54   0.590    -1.967929    3.457662
       dummy_age_sp |   .1984375   .6535871     0.30   0.762    -1.085808    1.482683
      dummy_educ_sp |  -.0011579   .6712666    -0.00   0.999    -1.320142    1.317826
   dummy_dage0_7_97 |  -.6342516   .8573348    -0.74   0.460    -2.318845    1.050341
  dummy_dirtfloor97 |   2.836225   3.118017     0.91   0.363    -3.290425    8.962875
dummy_electricity97 |     4.1115   4.221142     0.97   0.331    -4.182699     12.4057
              _cons |  -1.502443   .9512095    -1.58   0.115    -3.371492    .3666063
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |      2,198    3.189263    6.429735          0         50

added scalar:
               e(mean) =  3.189263

. ***Output for Table 2 -- Panel B2 and C2;
. estout ani1_w2347_t2_c1_op ani2_w2347_t2_c1_op land_w2347_t2_c1_op vani1_w2347_t2_c1_op vani2_w2347_t2_c1_op ha_w2347_t2_c1
> _op  
>            ani1_w7_t2_c1_op ani2_w7_t2_c1_op land_w7_t2_c1_op vani1_w7_t2_c1_op vani2_w7_t2_c1_op ha_w7_t2_c1_op 
>         using "$out_p/wave7.text", stats(N mean pvalue, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_op t2_c1_opwave7) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles Conditional) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/wave7.text)

. estimates clear;

. log close;
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/investments_long_term.log
  log type:  text
 closed on:  29 Nov 2019, 15:20:36
-----------------------------------------------------------------------------------------------------------------------------
