
. use "$data/investments_data.dta";
(Complete Investments Data Base)

. *==============================
>  Estimation Sample: keep hh with non-missing info on any of the dependent vars (draft animals, prod animals, land & micro-e
> nterprise)
> *==============================;
. keep if wave ==2 | wave ==3 | wave ==4;
(89,079 observations deleted)

. replace land =. if ha ==.;
(403 real changes made, 403 to missing)

. g byte all =(ani1 ~=. & ani2 ~=. & land ~=. & me~=.);

. keep if all ==1;
(420 observations deleted)

. *===============================
>  Wave Dummies & Treatment*Wave Interactions
> *===============================;
. foreach x in 2 3 4 {;
  2.         g byte wave`x' =(wave ==`x');
  3. };

. foreach x in t2_c1_op treatcom {;
  2.         foreach y in wave2 wave3 wave4 {;
  3.                 g `x'`y' =`y' * `x';
  4.         };
  5. };
(35,282 missing values generated)
(35,282 missing values generated)
(35,282 missing values generated)
(536 missing values generated)
(536 missing values generated)
(536 missing values generated)

. *==============================
>   Define Globals 
> *==============================;
. gl dep_all              ani1 ani2 land vani1 vani2 ha;

. gl dep_dum              ani1 ani2 land;

. gl dep_cont     vani1 vani2 ha;

. gl dep_me               me2 crafts const sewing food repair other;

. gl dep_all_in   ani1 ani2 land vani1 vani2 ha me2 crafts;

. gl treatcom1    t2_c1_op;

. gl treatcom2    treatcom;

. gl basic                nbani197 nbani297 ha97;

. gl controls             no497 big497
>                                 age_hh age_hh2 female_hh educ1_hh ethnicity_hh 
>                                 age_sp age_sp2 educ1_sp                         
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p hhsize97
>                                 homeown97 dirtfloor97  electricity97 
>                                 org_faenas min_dist lnup_cwagepm up2_mcwagepm
>                                 dummy_age_hh dummy_educ_hh dummy_ethnicity_hh dummy_age_sp dummy_educ_sp
>                                 dummy_dage0_7_97 dummy_dirtfloor97 dummy_electricity97;

. *===========================================================================
> Regressions: Agricultural Assets & Micro-Enterprise Activity
>                          Waves 2, 3, 4 pooled (add test that we can pool) & ITT & controls (Unconditional and Conditional)
> *===========================================================================;
. ***Agricultural Assets: Eligibles, Unconditional -- Table 2, Panel A1;
. foreach x of global dep_all {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' wave3 wave4 $basic $controls, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         est store `x'_pc, title (`x');
  8.         reg `x' `y'wave2 `y'wave3 `y'wave4 wave3 wave4 $basic $controls, cl(comuid);
  9.         test `y'wave2 = `y'wave3 = `y'wave4;
 10.         scalar mean =r(mean);
 11.         estadd scalar mean;
 12.         scalar pvalue =r(p);
 13.         estadd scalar pvalue;
 14.         est store `x'_pc_pvalue, title (`x');
 15. };
 16. };

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =      60.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1705
                                                Root MSE          =      .4063

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0416205    .014315     2.91   0.004     .0134955    .0697456
              wave3 |  -.0116749   .0058897    -1.98   0.048    -.0232465   -.0001033
              wave4 |   .0008516   .0076637     0.11   0.912    -.0142055    .0159087
           nbani197 |   .0877323   .0113231     7.75   0.000     .0654857    .1099789
           nbani297 |   .0210494   .0023545     8.94   0.000     .0164234    .0256754
               ha97 |   .0059561   .0024626     2.42   0.016     .0011178    .0107945
              no497 |  -.1110212   .0097805   -11.35   0.000    -.1302371   -.0918053
             big497 |   .0601959    .013499     4.46   0.000     .0336741    .0867176
             age_hh |   .0021979   .0017454     1.26   0.209    -.0012313    .0056271
            age_hh2 |    -.00002   .0000169    -1.18   0.238    -.0000531    .0000132
          female_hh |   -.036219    .015317    -2.36   0.018    -.0663125   -.0061254
           educ1_hh |   .0276628   .0091038     3.04   0.003     .0097764    .0455491
       ethnicity_hh |  -.1288188   .0153991    -8.37   0.000    -.1590737    -.098564
             age_sp |   .0033444   .0020469     1.63   0.103    -.0006772    .0073659
            age_sp2 |  -.0000306   .0000215    -1.42   0.156    -.0000729    .0000117
           educ1_sp |   .0054016   .0094313     0.57   0.567    -.0131283    .0239315
         dage0_7_97 |  -.0287358   .0100647    -2.86   0.004      -.04851   -.0089615
        dage8_17_97 |   .0130323   .0082407     1.58   0.114    -.0031584    .0292229
       dage18_54_97 |   .0230063   .0154728     1.49   0.138    -.0073935    .0534061
         dage55p_97 |   .0271769    .010156     2.68   0.008     .0072232    .0471307
           hhsize97 |   .0143641   .0020654     6.95   0.000     .0103061     .018422
          homeown97 |   .0366204   .0121734     3.01   0.003     .0127031    .0605378
        dirtfloor97 |   -.005782   .0109804    -0.53   0.599    -.0273554    .0157913
      electricity97 |   .0118339   .0119511     0.99   0.323    -.0116466    .0353144
         org_faenas |   .0152542    .023004     0.66   0.508    -.0299422    .0604507
           min_dist |  -.0006526   .0001719    -3.80   0.000    -.0009902   -.0003149
       lnup_cwagepm |   .0183238   .0153258     1.20   0.232    -.0117871    .0484347
       up2_mcwagepm |    .098537   .0977695     1.01   0.314    -.0935526    .2906266
       dummy_age_hh |   .1311086   .1226407     1.07   0.286     -.109846    .3720632
      dummy_educ_hh |   .0639865   .0757814     0.84   0.399    -.0849027    .2128758
 dummy_ethnicity_hh |  -.0785444   .0663603    -1.18   0.237    -.2089238    .0518351
       dummy_age_sp |  -.0778106   .0629844    -1.24   0.217    -.2015573    .0459361
      dummy_educ_sp |   .0470348   .0632876     0.74   0.458    -.0773076    .1713771
   dummy_dage0_7_97 |   .1373685   .0832198     1.65   0.099    -.0261351    .3008722
  dummy_dirtfloor97 |   .0890666   .0676612     1.32   0.189    -.0438687    .2220018
dummy_electricity97 |   .0993524    .176191     0.56   0.573    -.2468136    .4455183
              _cons |  -.1029385   .1113026    -0.92   0.355    -.3216169    .1157398
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |     12,490    .2460368    .4307175          0          1

added scalar:
               e(mean) =  .24603683

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =      58.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1705
                                                Root MSE          =     .40631

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0435306    .016559     2.63   0.009     .0109968    .0760644
      t2_c1_opwave3 |   .0426672   .0160078     2.67   0.008     .0112163    .0741181
      t2_c1_opwave4 |   .0384471   .0161816     2.38   0.018     .0066547    .0702394
              wave3 |   -.011142   .0097592    -1.14   0.254    -.0303161    .0080321
              wave4 |   .0041022   .0112712     0.36   0.716    -.0180425    .0262468
           nbani197 |   .0877302   .0113232     7.75   0.000     .0654833    .1099771
           nbani297 |   .0210474   .0023546     8.94   0.000     .0164213    .0256735
               ha97 |   .0059563   .0024631     2.42   0.016      .001117    .0107955
              no497 |  -.1110263   .0097822   -11.35   0.000    -.1302455   -.0918071
             big497 |    .060189   .0135015     4.46   0.000     .0336622    .0867157
             age_hh |   .0022003    .001745     1.26   0.208    -.0012281    .0056288
            age_hh2 |    -.00002   .0000169    -1.18   0.238    -.0000532    .0000132
          female_hh |  -.0362123   .0153157    -2.36   0.018    -.0663035   -.0061212
           educ1_hh |   .0276549   .0091007     3.04   0.002     .0097747    .0455351
       ethnicity_hh |  -.1287997    .015403    -8.36   0.000    -.1590623   -.0985371
             age_sp |   .0033413   .0020473     1.63   0.103     -.000681    .0073636
            age_sp2 |  -.0000306   .0000215    -1.42   0.156    -.0000729    .0000117
           educ1_sp |   .0053998   .0094316     0.57   0.567    -.0131306    .0239303
         dage0_7_97 |    -.02874   .0100642    -2.86   0.004    -.0485133   -.0089667
        dage8_17_97 |   .0130376    .008242     1.58   0.114    -.0031557    .0292309
       dage18_54_97 |   .0229963   .0154745     1.49   0.138    -.0074068    .0533994
         dage55p_97 |   .0271712   .0101568     2.68   0.008      .007216    .0471264
           hhsize97 |   .0143659   .0020655     6.96   0.000     .0103077    .0184241
          homeown97 |   .0366311   .0121764     3.01   0.003      .012708    .0605542
        dirtfloor97 |  -.0057791     .01098    -0.53   0.599    -.0273516    .0157934
      electricity97 |   .0118093   .0119574     0.99   0.324    -.0116837    .0353022
         org_faenas |   .0152639   .0230015     0.66   0.507    -.0299275    .0604554
           min_dist |  -.0006531   .0001718    -3.80   0.000    -.0009906   -.0003155
       lnup_cwagepm |   .0183404   .0153506     1.19   0.233    -.0118192    .0484999
       up2_mcwagepm |   .0979265   .0981514     1.00   0.319    -.0949135    .2907664
       dummy_age_hh |   .1316505   .1226185     1.07   0.283    -.1092605    .3725614
      dummy_educ_hh |   .0639916    .075791     0.84   0.399    -.0849165    .2128998
 dummy_ethnicity_hh |  -.0785349   .0663596    -1.18   0.237     -.208913    .0518432
       dummy_age_sp |  -.0777075   .0630206    -1.23   0.218    -.2015253    .0461103
      dummy_educ_sp |   .0469334   .0633176     0.74   0.459    -.0774681    .1713348
   dummy_dage0_7_97 |   .1374663   .0832443     1.65   0.099    -.0260855    .3010181
  dummy_dirtfloor97 |   .0890852   .0676738     1.32   0.189    -.0438748    .2220451
dummy_electricity97 |   .0994543   .1761968     0.56   0.573     -.246723    .4456316
              _cons |  -.1041789   .1113469    -0.94   0.350    -.3229445    .1145866
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.07
            Prob > F =    0.9290

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .92897198

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =      31.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0732
                                                Root MSE          =     .42858

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0356389   .0149109     2.39   0.017     .0063432    .0649346
              wave3 |  -.0254664   .0094306    -2.70   0.007    -.0439949    -.006938
              wave4 |   .0030311   .0110711     0.27   0.784    -.0187206    .0247828
           nbani197 |   .0116559   .0030434     3.83   0.000     .0056764    .0176355
           nbani297 |   .0165691    .001742     9.51   0.000     .0131466    .0199915
               ha97 |  -.0005042   .0018399    -0.27   0.784    -.0041192    .0031107
              no497 |  -.2324845   .0139631   -16.65   0.000     -.259918    -.205051
             big497 |   .0339636     .01077     3.15   0.002     .0128035    .0551237
             age_hh |   .0036907   .0018029     2.05   0.041     .0001484     .007233
            age_hh2 |  -.0000393   .0000171    -2.29   0.022    -.0000729   -5.63e-06
          female_hh |   .0584649   .0175146     3.34   0.001     .0240536    .0928761
           educ1_hh |  -.0100933   .0091065    -1.11   0.268     -.027985    .0077985
       ethnicity_hh |   -.043536   .0159262    -2.73   0.006    -.0748266   -.0122454
             age_sp |   .0052635   .0021272     2.47   0.014     .0010841    .0094428
            age_sp2 |  -.0000388   .0000219    -1.77   0.078    -.0000819    4.30e-06
           educ1_sp |  -.0239277   .0097388    -2.46   0.014    -.0430618   -.0047936
         dage0_7_97 |  -.0091825   .0085577    -1.07   0.284    -.0259959     .007631
        dage8_17_97 |   .0175546   .0081826     2.15   0.032     .0014782    .0336311
       dage18_54_97 |   .0842325   .0161277     5.22   0.000      .052546     .115919
         dage55p_97 |   .0316779   .0087629     3.61   0.000     .0144612    .0488946
           hhsize97 |   .0038462   .0018173     2.12   0.035     .0002757    .0074167
          homeown97 |    .052797   .0142845     3.70   0.000     .0247321     .080862
        dirtfloor97 |   .0092531    .008647     1.07   0.285    -.0077359    .0262421
      electricity97 |  -.0090705    .012657    -0.72   0.474     -.033938     .015797
         org_faenas |    .023535   .0249973     0.94   0.347    -.0255776    .0726477
           min_dist |  -.0002119    .000181    -1.17   0.242    -.0005675    .0001436
       lnup_cwagepm |   .0255551   .0107906     2.37   0.018     .0043545    .0467557
       up2_mcwagepm |   .1560473   .0742145     2.10   0.036     .0102366     .301858
       dummy_age_hh |   .0735751   .1265302     0.58   0.561    -.1750212    .3221714
      dummy_educ_hh |   -.055999   .0619103    -0.90   0.366    -.1776353    .0656373
 dummy_ethnicity_hh |   .0221359   .0644321     0.34   0.731    -.1044551    .1487269
       dummy_age_sp |  -.0655431   .0358067    -1.83   0.068    -.1358932    .0048071
      dummy_educ_sp |  -.0235998   .0346001    -0.68   0.496    -.0915792    .0443797
   dummy_dage0_7_97 |   .2586876   .0914029     2.83   0.005     .0791065    .4382688
  dummy_dirtfloor97 |   .0910695   .0553712     1.64   0.101    -.0177193    .1998583
dummy_electricity97 |  -.1152623   .1333707    -0.86   0.388    -.3772983    .1467737
              _cons |   .2189486   .0913899     2.40   0.017     .0393931    .3985042
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |     12,490    .7046437     .456221          0          1

added scalar:
               e(mean) =  .70464371

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =      29.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0733
                                                Root MSE          =     .42855

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0231106   .0189925     1.22   0.224    -.0142043    .0604255
      t2_c1_opwave3 |   .0318602   .0173957     1.83   0.068    -.0023176    .0660379
      t2_c1_opwave4 |   .0532715   .0214111     2.49   0.013     .0112046    .0953383
              wave3 |  -.0309034   .0151993    -2.03   0.043    -.0607658    -.001041
              wave4 |  -.0162217   .0175559    -0.92   0.356    -.0507142    .0182707
           nbani197 |   .0116679   .0030432     3.83   0.000     .0056888     .017647
           nbani297 |   .0165796   .0017437     9.51   0.000     .0131538    .0200055
               ha97 |  -.0005045   .0018402    -0.27   0.784    -.0041201     .003111
              no497 |  -.2324561   .0139587   -16.65   0.000    -.2598811   -.2050311
             big497 |   .0339991   .0107744     3.16   0.002     .0128304    .0551677
             age_hh |   .0036787   .0018026     2.04   0.042     .0001371    .0072203
            age_hh2 |  -.0000391   .0000171    -2.29   0.023    -.0000727   -5.53e-06
          female_hh |   .0584223    .017511     3.34   0.001     .0240181    .0928265
           educ1_hh |   -.010054   .0091099    -1.10   0.270    -.0279524    .0078444
       ethnicity_hh |  -.0436323   .0159411    -2.74   0.006    -.0749522   -.0123124
             age_sp |   .0052795   .0021275     2.48   0.013     .0010995    .0094595
            age_sp2 |   -.000039   .0000219    -1.78   0.076    -.0000821    4.13e-06
           educ1_sp |  -.0239189   .0097407    -2.46   0.014    -.0430567   -.0047811
         dage0_7_97 |  -.0091566    .008563    -1.07   0.285    -.0259805    .0076674
        dage8_17_97 |   .0175252   .0081816     2.14   0.033     .0014507    .0335997
       dage18_54_97 |   .0842803   .0161214     5.23   0.000     .0526063    .1159543
         dage55p_97 |   .0317055   .0087682     3.62   0.000     .0144784    .0489325
           hhsize97 |   .0038363   .0018181     2.11   0.035     .0002641    .0074084
          homeown97 |   .0527359   .0142895     3.69   0.000      .024661    .0808108
        dirtfloor97 |   .0092426   .0086468     1.07   0.286    -.0077459    .0262311
      electricity97 |  -.0089432   .0126633    -0.71   0.480     -.033823    .0159366
         org_faenas |   .0234783   .0250389     0.94   0.349    -.0257161    .0726727
           min_dist |  -.0002093    .000181    -1.16   0.248     -.000565    .0001464
       lnup_cwagepm |   .0254971   .0108743     2.34   0.019     .0041321    .0468622
       up2_mcwagepm |   .1596135   .0751673     2.12   0.034     .0119309     .307296
       dummy_age_hh |   .0705531   .1260062     0.56   0.576    -.1770137    .3181199
      dummy_educ_hh |  -.0560525   .0619197    -0.91   0.366    -.1777073    .0656023
 dummy_ethnicity_hh |   .0221302   .0643857     0.34   0.731    -.1043696    .1486299
       dummy_age_sp |   -.066151   .0357424    -1.85   0.065    -.1363749    .0040729
      dummy_educ_sp |  -.0229906   .0345284    -0.67   0.506    -.0908292    .0448479
   dummy_dage0_7_97 |   .2581213   .0915995     2.82   0.005     .0781541    .4380886
  dummy_dirtfloor97 |    .090992   .0553985     1.64   0.101    -.0178505    .1998346
dummy_electricity97 |    -.11583    .133523    -0.87   0.386    -.3781652    .1465052
              _cons |   .2268177   .0930124     2.44   0.015     .0440745    .4095609
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.98
            Prob > F =    0.3755

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .37549392

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =      78.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1589
                                                Root MSE          =     .44896

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    .030786   .0193371     1.59   0.112    -.0072059     .068778
              wave3 |  -.0424988   .0093543    -4.54   0.000    -.0608773   -.0241203
              wave4 |   .0226104   .0113715     1.99   0.047     .0002687    .0449522
           nbani197 |   .0270883    .005599     4.84   0.000     .0160879    .0380887
           nbani297 |   .0099976   .0018405     5.43   0.000     .0063816    .0136136
               ha97 |   .0274856   .0029644     9.27   0.000     .0216614    .0333097
              no497 |  -.2164449   .0134445   -16.10   0.000    -.2428596   -.1900301
             big497 |   .0634368   .0145006     4.37   0.000     .0349472    .0919265
             age_hh |   .0120858   .0020432     5.92   0.000     .0080716    .0161001
            age_hh2 |  -.0001037   .0000193    -5.37   0.000    -.0001416   -.0000658
          female_hh |  -.0932942   .0176404    -5.29   0.000    -.1279526   -.0586358
           educ1_hh |    .025471   .0106993     2.38   0.018     .0044499    .0464922
       ethnicity_hh |   .0910548   .0178616     5.10   0.000     .0559619    .1261478
             age_sp |  -.0008788   .0022108    -0.40   0.691    -.0052224    .0034648
            age_sp2 |   2.52e-07   .0000233     0.01   0.991    -.0000455     .000046
           educ1_sp |   .0200488   .0113608     1.76   0.078    -.0022719    .0423695
         dage0_7_97 |  -.0157531   .0106075    -1.49   0.138    -.0365939    .0050877
        dage8_17_97 |   .0194721   .0091413     2.13   0.034      .001512    .0374323
       dage18_54_97 |   .0059062   .0178765     0.33   0.741    -.0292162    .0410286
         dage55p_97 |   .0349097   .0098524     3.54   0.000     .0155525     .054267
           hhsize97 |   .0084993    .002066     4.11   0.000     .0044401    .0125585
          homeown97 |   .1331489   .0149552     8.90   0.000     .1037662    .1625316
        dirtfloor97 |   .0041847   .0106607     0.39   0.695    -.0167605      .02513
      electricity97 |   .0027703   .0132142     0.21   0.834    -.0231918    .0287324
         org_faenas |  -.0364259   .0412434    -0.88   0.378    -.1174576    .0446058
           min_dist |   .0003741   .0002096     1.78   0.075    -.0000377     .000786
       lnup_cwagepm |   -.042752   .0165791    -2.58   0.010    -.0753254   -.0101786
       up2_mcwagepm |  -.2370828   .1081687    -2.19   0.029     -.449604   -.0245615
       dummy_age_hh |   .2731323   .1173569     2.33   0.020     .0425588    .5037058
      dummy_educ_hh |  -.0179103   .0610794    -0.29   0.769    -.1379142    .1020936
 dummy_ethnicity_hh |  -.0597108   .0540751    -1.10   0.270    -.1659532    .0465316
       dummy_age_sp |  -.0235068   .0370037    -0.64   0.526    -.0962086     .049195
      dummy_educ_sp |   .0075611    .036905     0.20   0.838    -.0649469    .0800691
   dummy_dage0_7_97 |   .0354455   .0878824     0.40   0.687    -.1372188    .2081098
  dummy_dirtfloor97 |   .0682318   .0572653     1.19   0.234    -.0442784     .180742
dummy_electricity97 |   .2014643   .2024413     1.00   0.320     -.196276    .5992047
              _cons |     .25579   .1279327     2.00   0.046     .0044381    .5071419
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |     12,490    .5853483    .4926815          0          1

added scalar:
               e(mean) =  .58534828

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =      74.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1590
                                                Root MSE          =     .44895

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0336463   .0224341     1.50   0.134    -.0104303     .077723
      t2_c1_opwave3 |   .0194623   .0232337     0.84   0.403    -.0261854    .0651101
      t2_c1_opwave4 |   .0393237   .0223775     1.76   0.079    -.0046419    .0832892
              wave3 |  -.0335934    .013986    -2.40   0.017    -.0610719   -.0061148
              wave4 |   .0188425   .0164712     1.14   0.253    -.0135188    .0512039
           nbani197 |   .0270922   .0056018     4.84   0.000     .0160863    .0380981
           nbani297 |   .0100055   .0018406     5.44   0.000     .0063891    .0136218
               ha97 |   .0274837   .0029646     9.27   0.000     .0216591    .0333082
              no497 |  -.2164303   .0134446   -16.10   0.000    -.2428452   -.1900154
             big497 |   .0634672   .0145008     4.38   0.000     .0349771    .0919572
             age_hh |   .0120738   .0020432     5.91   0.000     .0080594    .0160881
            age_hh2 |  -.0001036   .0000193    -5.37   0.000    -.0001415   -.0000657
          female_hh |  -.0932883   .0176408    -5.29   0.000    -.1279475   -.0586291
           educ1_hh |   .0255114   .0107041     2.38   0.018     .0044809     .046542
       ethnicity_hh |   .0909604   .0178616     5.09   0.000     .0558673    .1260534
             age_sp |  -.0008667   .0022112    -0.39   0.695    -.0052111    .0034777
            age_sp2 |   1.19e-07   .0000233     0.01   0.996    -.0000456    .0000459
           educ1_sp |   .0200583   .0113619     1.77   0.078    -.0022646    .0423812
         dage0_7_97 |  -.0157519   .0106083    -1.48   0.138    -.0365943    .0050904
        dage8_17_97 |   .0194571   .0091434     2.13   0.034     .0014928    .0374213
       dage18_54_97 |   .0059661   .0178711     0.33   0.739    -.0291456    .0410777
         dage55p_97 |   .0349418   .0098486     3.55   0.000     .0155921    .0542916
           hhsize97 |   .0084935   .0020667     4.11   0.000      .004433    .0125541
          homeown97 |    .133128    .014955     8.90   0.000     .1037457    .1625104
        dirtfloor97 |   .0041527   .0106646     0.39   0.697    -.0168003    .0251056
      electricity97 |   .0028773   .0132108     0.22   0.828    -.0230782    .0288328
         org_faenas |  -.0364404   .0412572    -0.88   0.378    -.1174993    .0446186
           min_dist |   .0003753   .0002095     1.79   0.074    -.0000364     .000787
       lnup_cwagepm |  -.0429376   .0166159    -2.58   0.010    -.0755832    -.010292
       up2_mcwagepm |  -.2361667   .1083281    -2.18   0.030    -.4490011   -.0233324
       dummy_age_hh |   .2717221   .1172103     2.32   0.021     .0414367    .5020075
      dummy_educ_hh |  -.0178194   .0610628    -0.29   0.771    -.1377907    .1021519
 dummy_ethnicity_hh |  -.0599331   .0540825    -1.11   0.268      -.16619    .0463239
       dummy_age_sp |  -.0236375   .0369458    -0.64   0.523    -.0962255    .0489506
      dummy_educ_sp |   .0076429   .0368631     0.21   0.836    -.0647828    .0800686
   dummy_dage0_7_97 |   .0352782   .0878897     0.40   0.688    -.1374004    .2079567
  dummy_dirtfloor97 |   .0680733   .0572683     1.19   0.235    -.0444429    .1805894
dummy_electricity97 |   .2011953   .2024339     0.99   0.321    -.1965306    .5989213
              _cons |   .2550467   .1280366     1.99   0.047     .0034908    .5066027
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.46
            Prob > F =    0.6323

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .632298

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =      22.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2006
                                                Root MSE          =     863.87

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   65.12393   25.29083     2.58   0.010     15.43453    114.8133
              wave3 |    -11.462   11.93645    -0.96   0.337    -34.91377    11.98977
              wave4 |  -15.67915   15.16751    -1.03   0.302    -45.47906    14.12075
           nbani197 |   302.0998   45.83074     6.59   0.000     212.0552    392.1444
           nbani297 |   52.43728   7.806588     6.72   0.000     37.09952    67.77503
               ha97 |   9.827127   7.124277     1.38   0.168    -4.170081    23.82434
              no497 |  -76.27812   16.59897    -4.60   0.000    -108.8905   -43.66579
             big497 |   120.7427   37.24095     3.24   0.001     47.57468    193.9107
             age_hh |   5.258044   2.984525     1.76   0.079    -.6057109     11.1218
            age_hh2 |  -.0494635   .0297238    -1.66   0.097    -.1078623    .0089354
          female_hh |  -90.61433   29.93123    -3.03   0.003    -149.4208   -31.80784
           educ1_hh |   33.35479   16.81213     1.98   0.048     .3236694    66.38592
       ethnicity_hh |  -179.5502   19.56751    -9.18   0.000    -217.9949   -141.1056
             age_sp |   7.870726   3.654077     2.15   0.032     .6914883    15.04996
            age_sp2 |  -.0761319   .0391757    -1.94   0.053    -.1531013    .0008374
           educ1_sp |  -15.18764   18.01563    -0.84   0.400    -50.58331    20.20802
         dage0_7_97 |  -60.47333   19.06413    -3.17   0.002    -97.92901   -23.01765
        dage8_17_97 |   -13.6807   15.53762    -0.88   0.379    -44.20777    16.84637
       dage18_54_97 |  -23.92653   36.28408    -0.66   0.510    -95.21458    47.36151
         dage55p_97 |   26.33626   24.91198     1.06   0.291    -22.60879    75.28132
           hhsize97 |   23.64152   5.055407     4.68   0.000     13.70906    33.57398
          homeown97 |   26.56346   24.21398     1.10   0.273    -21.01023    74.13716
        dirtfloor97 |  -29.66824    21.3729    -1.39   0.166    -71.66001    12.32352
      electricity97 |   36.29242   20.45803     1.77   0.077    -3.901882    76.48672
         org_faenas |  -40.35654   39.02211    -1.03   0.302    -117.0241    36.31098
           min_dist |  -1.443997    .326151    -4.43   0.000    -2.084792   -.8032014
       lnup_cwagepm |   96.79161   25.41582     3.81   0.000     46.85664    146.7266
       up2_mcwagepm |   558.2408    156.628     3.56   0.000     250.5107    865.9709
       dummy_age_hh |   190.5402   149.5963     1.27   0.203    -103.3747    484.4551
      dummy_educ_hh |   15.10685   77.66309     0.19   0.846    -137.4794    167.6931
 dummy_ethnicity_hh |  -322.9707   102.0364    -3.17   0.002    -523.4436   -122.4978
       dummy_age_sp |  -142.9598   132.9956    -1.07   0.283    -404.2589    118.3393
      dummy_educ_sp |   118.7548   134.1106     0.89   0.376    -144.7349    382.2445
   dummy_dage0_7_97 |   381.4408   357.9326     1.07   0.287    -321.7964    1084.678
  dummy_dirtfloor97 |  -93.05101   105.5755    -0.88   0.379    -300.4773    114.3753
dummy_electricity97 |  -65.13045   114.6063    -0.57   0.570    -290.2997    160.0388
              _cons |  -604.0798   174.0859    -3.47   0.001      -946.11   -262.0497
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |     12,490    304.0656    878.6596          0   14367.83

added scalar:
               e(mean) =  304.06562

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =      22.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2008
                                                Root MSE          =     863.82

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   86.76349   26.40355     3.29   0.001     34.88791    138.6391
      t2_c1_opwave3 |   74.38556   30.54732     2.44   0.015     14.36864    134.4025
      t2_c1_opwave4 |   31.84839   31.15886     1.02   0.307    -29.37004    93.06682
              wave3 |  -3.790843   18.11326    -0.21   0.834    -39.37833    31.79665
              wave4 |   19.40754   23.61036     0.82   0.411     -26.9802    65.79528
           nbani197 |   302.0777   45.82797     6.59   0.000     212.0385    392.1168
           nbani297 |   52.41668   7.804634     6.72   0.000     37.08276     67.7506
               ha97 |   9.828071   7.124473     1.38   0.168    -4.169522    23.82566
              no497 |  -76.33185   16.60366    -4.60   0.000    -108.9534   -43.71031
             big497 |   120.6728   37.23677     3.24   0.001     47.51294    193.8326
             age_hh |   5.282052   2.986694     1.77   0.078    -.5859645    11.15007
            age_hh2 |  -.0496887   .0297436    -1.67   0.095    -.1081266    .0087492
          female_hh |  -90.53999   29.93016    -3.03   0.003    -149.3444   -31.73561
           educ1_hh |   33.27579   16.81321     1.98   0.048     .2425401    66.30904
       ethnicity_hh |  -179.3578   19.58093    -9.16   0.000    -217.8289   -140.8868
             age_sp |   7.839536   3.656517     2.14   0.033     .6555045    15.02357
            age_sp2 |  -.0757875   .0392024    -1.93   0.054    -.1528092    .0012341
           educ1_sp |  -15.20544   18.01334    -0.84   0.399    -50.59661    20.18573
         dage0_7_97 |  -60.51962   19.05941    -3.18   0.002    -97.96601   -23.07323
        dage8_17_97 |  -13.62498   15.54312    -0.88   0.381    -44.16286    16.91289
       dage18_54_97 |  -24.02493   36.29855    -0.66   0.508     -95.3414    47.29155
         dage55p_97 |   26.28004   24.91767     1.05   0.292     -22.6762    75.23628
           hhsize97 |   23.66044   5.055435     4.68   0.000     13.72793    33.59296
          homeown97 |   26.67681   24.22037     1.10   0.271    -20.90944    74.26305
        dirtfloor97 |  -29.64235   21.36663    -1.39   0.166    -71.62178    12.33709
      electricity97 |   36.04209   20.46921     1.76   0.079    -4.174182    76.25836
         org_faenas |  -40.25234   38.99636    -1.03   0.302    -116.8693    36.36457
           min_dist |  -1.449036   .3267541    -4.43   0.000    -2.091017    -.807056
       lnup_cwagepm |   96.93643    25.5577     3.79   0.000     46.72271    147.1502
       up2_mcwagepm |   551.6929   157.3006     3.51   0.000     242.6412    860.7445
       dummy_age_hh |   196.2314   148.5318     1.32   0.187    -95.59204    488.0548
      dummy_educ_hh |   15.18158   77.67484     0.20   0.845    -137.4277    167.7909
 dummy_ethnicity_hh |  -322.9107   102.1199    -3.16   0.002    -523.5476   -122.2737
       dummy_age_sp |  -141.8492   133.2178    -1.06   0.287    -403.5848    119.8864
      dummy_educ_sp |   117.6531   134.3403     0.88   0.382    -146.2879     381.594
   dummy_dage0_7_97 |   382.4855   357.9503     1.07   0.286    -320.7865    1085.758
  dummy_dirtfloor97 |  -92.87762   105.5887    -0.88   0.379    -300.3298    114.5745
dummy_electricity97 |  -64.06052   114.5296    -0.56   0.576    -289.0792    160.9581
              _cons |  -617.9081   175.3428    -3.52   0.000    -962.4076   -273.4087
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    2.09
            Prob > F =    0.1246

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .12455376

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =      25.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2403
                                                Root MSE          =       2677

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   186.8299   66.99535     2.79   0.005     55.20279     318.457
              wave3 |   1.678632   34.13575     0.05   0.961    -65.38856    68.74582
              wave4 |   51.92244   50.64177     1.03   0.306    -47.57445    151.4193
           nbani197 |   216.9576   57.20037     3.79   0.000     104.5749    329.3403
           nbani297 |   580.8713   44.87619    12.94   0.000     492.7022    669.0404
               ha97 |   38.61569   25.80709     1.50   0.135    -12.08802     89.3194
              no497 |  -140.9505    46.6573    -3.02   0.003     -232.619   -49.28196
             big497 |   156.6995   120.1304     1.30   0.193    -79.32314    392.7221
             age_hh |   28.93545    9.94464     2.91   0.004     9.397018    48.47388
            age_hh2 |   -.214431   .0988987    -2.17   0.031    -.4087391   -.0201228
          female_hh |  -176.7961   84.39477    -2.09   0.037    -342.6081   -10.98399
           educ1_hh |  -1.060427   55.26749    -0.02   0.985    -109.6456    107.5247
       ethnicity_hh |   -415.627   68.96429    -6.03   0.000    -551.1225   -280.1315
             age_sp |    7.82074   12.06987     0.65   0.517    -15.89318    31.53466
            age_sp2 |    -.05773   .1308732    -0.44   0.659    -.3148593    .1993992
           educ1_sp |  -80.60129   55.33424    -1.46   0.146    -189.3176      28.115
         dage0_7_97 |  -134.4317   66.33366    -2.03   0.043    -264.7587   -4.104633
        dage8_17_97 |   15.26955   54.56016     0.28   0.780    -91.92588     122.465
       dage18_54_97 |   220.1797   94.09416     2.34   0.020     35.31102    405.0483
         dage55p_97 |  -37.34884   80.43912    -0.46   0.643    -195.3892    120.6915
           hhsize97 |   23.23201   14.45589     1.61   0.109    -5.169761    51.63377
          homeown97 |   51.53538   63.79455     0.81   0.420    -73.80304    176.8738
        dirtfloor97 |  -426.1585   66.68139    -6.39   0.000    -557.1688   -295.1483
      electricity97 |  -25.39505   55.20559    -0.46   0.646    -133.8586    83.06846
         org_faenas |   50.98055   115.9413     0.44   0.660    -176.8116    278.7727
           min_dist |  -.3872214   .7506969    -0.52   0.606    -1.862131    1.087688
       lnup_cwagepm |   109.0532   56.38007     1.93   0.054    -1.717841    219.8242
       up2_mcwagepm |   433.4617   358.0857     1.21   0.227    -270.0764        1137
       dummy_age_hh |   1342.611   1185.338     1.13   0.258    -986.2467    3671.468
      dummy_educ_hh |    533.544   727.4652     0.73   0.464    -895.7213    1962.809
 dummy_ethnicity_hh |  -496.2962   345.9936    -1.43   0.152    -1176.077    183.4843
       dummy_age_sp |   104.5909   177.4795     0.59   0.556    -244.1065    453.2884
      dummy_educ_sp |  -146.8093   169.3718    -0.87   0.386    -479.5774    185.9589
   dummy_dage0_7_97 |   1241.182   931.4956     1.33   0.183     -588.946     3071.31
  dummy_dirtfloor97 |   -502.269    197.157    -2.55   0.011    -889.6273   -114.9107
dummy_electricity97 |    129.004   100.7835     1.28   0.201    -69.00723    327.0153
              _cons |  -991.0347   450.4851    -2.20   0.028    -1876.112   -105.9578
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |     12,490    1125.756    2867.741          0   46596.51

added scalar:
               e(mean) =  1125.7564

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =      23.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2405
                                                Root MSE          =     2676.8

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |    94.0656    90.7086     1.04   0.300    -84.15138    272.2826
      t2_c1_opwave3 |   171.5797    81.9848     2.09   0.037     10.50252    332.6568
      t2_c1_opwave4 |   304.2664   75.08988     4.05   0.000     156.7358     451.797
              wave3 |  -46.58435   60.87566    -0.77   0.444     -166.188    73.01927
              wave4 |  -82.10649   86.70573    -0.95   0.344     -252.459    88.24598
           nbani197 |   217.0393   57.21039     3.79   0.000     104.6369    329.4417
           nbani297 |   580.9389   44.88217    12.94   0.000     492.7581    669.1198
               ha97 |   38.61555   25.80207     1.50   0.135    -12.07828    89.30938
              no497 |  -140.7624    46.6686    -3.02   0.003    -232.4532   -49.07171
             big497 |   156.9221   120.1223     1.31   0.192    -79.08456    392.9288
             age_hh |   28.86225   9.937111     2.90   0.004     9.338609    48.38589
            age_hh2 |  -.2137281   .0988246    -2.16   0.031    -.4078907   -.0195654
          female_hh |  -177.1071   84.36304    -2.10   0.036    -342.8568   -11.35736
           educ1_hh |  -.8208743   55.30856    -0.01   0.988    -109.4867     107.845
       ethnicity_hh |  -416.2181   68.96525    -6.04   0.000    -551.7155   -280.7207
             age_sp |   7.922865   12.07179     0.66   0.512    -15.79481    31.64054
            age_sp2 |  -.0588581     .13094    -0.45   0.653    -.3161185    .1984022
           educ1_sp |  -80.54806   55.34546    -1.46   0.146    -189.2864    28.19026
         dage0_7_97 |  -134.2475   66.32494    -2.02   0.043    -264.5574   -3.937546
        dage8_17_97 |   15.07438   54.56707     0.28   0.782    -92.13462    122.2834
       dage18_54_97 |   220.4594    94.1002     2.34   0.020     35.57892      405.34
         dage55p_97 |  -37.18489   80.46456    -0.46   0.644    -195.2752    120.9054
           hhsize97 |   23.16702   14.45528     1.60   0.110     -5.23355    51.56758
          homeown97 |   51.11937    63.7851     0.80   0.423    -74.20048    176.4392
        dirtfloor97 |  -426.2004   66.69075    -6.39   0.000     -557.229   -295.1717
      electricity97 |  -24.59487   55.18487    -0.45   0.656    -133.0177    83.82794
         org_faenas |   50.58897   116.0717     0.44   0.663    -177.4594    278.6374
           min_dist |  -.3692831   .7529516    -0.49   0.624    -1.848622    1.110056
       lnup_cwagepm |   108.8314   55.64181     1.96   0.051    -.4892028    218.1519
       up2_mcwagepm |   458.0596   352.2216     1.30   0.194    -233.9572    1150.076
       dummy_age_hh |   1322.428   1179.118     1.12   0.263    -994.2085    3639.064
      dummy_educ_hh |   533.0656    727.422     0.73   0.464    -896.1148    1962.246
 dummy_ethnicity_hh |   -496.105   345.1848    -1.44   0.151    -1174.296    182.0863
       dummy_age_sp |   100.3707   177.5629     0.57   0.572    -248.4906    449.2321
      dummy_educ_sp |  -142.5297   169.2456    -0.84   0.400    -475.0499    189.9906
   dummy_dage0_7_97 |   1237.299   930.8803     1.33   0.184    -591.6203    3066.218
  dummy_dirtfloor97 |  -502.6586   197.3927    -2.55   0.011    -890.4801   -114.8372
dummy_electricity97 |   125.2173   101.6069     1.23   0.218    -74.41178    324.8464
              _cons |  -933.8692   450.5455    -2.07   0.039    -1819.065   -48.67357
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    2.29
            Prob > F =    0.1025

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .10250777

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =      49.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1988
                                                Root MSE          =     1.7609

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0615382   .0589966     1.04   0.297    -.0543736      .17745
              wave3 |  -.1060845   .0302448    -3.51   0.000    -.1655069    -.046662
              wave4 |   .0012576    .036396     0.03   0.972    -.0702503    .0727656
           nbani197 |   .1006914    .026057     3.86   0.000     .0494966    .1518861
           nbani297 |    .067582    .012502     5.41   0.000      .043019     .092145
               ha97 |   .2104614   .0298361     7.05   0.000     .1518419     .269081
              no497 |  -.2585205   .0342868    -7.54   0.000    -.3258845   -.1911564
             big497 |   .4060905   .0974513     4.17   0.000      .214626    .5975549
             age_hh |   .0297794   .0067442     4.42   0.000     .0165289    .0430298
            age_hh2 |  -.0002167   .0000677    -3.20   0.001    -.0003498   -.0000836
          female_hh |  -.2127465   .0618236    -3.44   0.001    -.3342125   -.0912805
           educ1_hh |   -.016431    .034309    -0.48   0.632    -.0838385    .0509765
       ethnicity_hh |  -.0612731   .0520792    -1.18   0.240    -.1635942     .041048
             age_sp |   .0050271   .0072187     0.70   0.487    -.0091557    .0192098
            age_sp2 |  -.0000503   .0000788    -0.64   0.523    -.0002052    .0001045
           educ1_sp |  -.0272014   .0310017    -0.88   0.381    -.0881111    .0337083
         dage0_7_97 |  -.1380309   .0421347    -3.28   0.001    -.2208137    -.055248
        dage8_17_97 |   .0366452   .0304055     1.21   0.229    -.0230931    .0963835
       dage18_54_97 |   .1341999    .069727     1.92   0.055    -.0027942     .271194
         dage55p_97 |    .080653   .0405331     1.99   0.047     .0010168    .1602892
           hhsize97 |   .0361666   .0087022     4.16   0.000     .0190692     .053264
          homeown97 |   .2370317   .0355374     6.67   0.000     .1672106    .3068528
        dirtfloor97 |   .0472232   .0415801     1.14   0.257      -.03447    .1289164
      electricity97 |   .0699485    .043818     1.60   0.111    -.0161415    .1560386
         org_faenas |  -.0068438   .1030707    -0.07   0.947     -.209349    .1956613
           min_dist |   .0012661   .0006092     2.08   0.038     .0000692    .0024629
       lnup_cwagepm |   .0007169   .0364469     0.02   0.984     -.070891    .0723249
       up2_mcwagepm |  -.1743229   .2351218    -0.74   0.459    -.6362715    .2876256
       dummy_age_hh |   .0856958   .3063088     0.28   0.780    -.5161152    .6875069
      dummy_educ_hh |   .1174704   .2173066     0.54   0.589    -.3094763     .544417
 dummy_ethnicity_hh |  -.1775373   .2349241    -0.76   0.450    -.6390973    .2840227
       dummy_age_sp |  -.3062445   .1816347    -1.69   0.092    -.6631059    .0506169
      dummy_educ_sp |   .3197574   .1856274     1.72   0.086    -.0449485    .6844632
   dummy_dage0_7_97 |   .1413124   .1720576     0.82   0.412    -.1967325    .4793574
  dummy_dirtfloor97 |   .1399961   .2249757     0.62   0.534    -.3020181    .5820103
dummy_electricity97 |  -.0426829   .3163481    -0.13   0.893    -.6642183    .5788525
              _cons |  -.8295049   .3205406    -2.59   0.010    -1.459277   -.1997324
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |     12,490    1.235323      1.9626          0         20

added scalar:
               e(mean) =  1.2353235

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =      46.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1988
                                                Root MSE          =      1.761

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0898907   .0744622     1.21   0.228    -.0564067    .2361881
      t2_c1_opwave3 |   .0523858   .0686585     0.76   0.446    -.0825089    .1872806
      t2_c1_opwave4 |   .0398857   .0662897     0.60   0.548     -.090355    .1701263
              wave3 |   -.082646   .0475138    -1.74   0.083    -.1759972    .0107053
              wave4 |   .0329687   .0608241     0.54   0.588    -.0865337    .1524711
           nbani197 |   .1006739   .0260529     3.86   0.000     .0494873    .1518605
           nbani297 |    .067573   .0125069     5.40   0.000     .0430005    .0921455
               ha97 |   .2104593    .029838     7.05   0.000     .1518359    .2690826
              no497 |  -.2585541   .0342931    -7.54   0.000    -.3259304   -.1911777
             big497 |    .406066   .0974529     4.17   0.000     .2145984    .5975336
             age_hh |   .0297849   .0067486     4.41   0.000     .0165258    .0430441
            age_hh2 |  -.0002168   .0000678    -3.20   0.001    -.0003499   -.0000836
          female_hh |  -.2126557    .061835    -3.44   0.001    -.3341442   -.0911673
           educ1_hh |  -.0164482   .0342981    -0.48   0.632    -.0838343    .0509378
       ethnicity_hh |  -.0612245   .0521225    -1.17   0.241    -.1636307    .0411818
             age_sp |   .0050137    .007225     0.69   0.488    -.0091813    .0192087
            age_sp2 |  -.0000502   .0000789    -0.64   0.525    -.0002052    .0001048
           educ1_sp |  -.0272046   .0310001    -0.88   0.381    -.0881111    .0337019
         dage0_7_97 |  -.1380791   .0421283    -3.28   0.001    -.2208495   -.0553088
        dage8_17_97 |   .0366802   .0304067     1.21   0.228    -.0230604    .0964207
       dage18_54_97 |   .1341946    .069753     1.92   0.055    -.0028505    .2712397
         dage55p_97 |   .0806464   .0405247     1.99   0.047     .0010267    .1602661
           hhsize97 |   .0361774    .008704     4.16   0.000     .0190765    .0532783
          homeown97 |   .2371194   .0355337     6.67   0.000     .1673056    .3069331
        dirtfloor97 |   .0471969   .0415863     1.13   0.257    -.0345085    .1289023
      electricity97 |   .0698581   .0438484     1.59   0.112    -.0162918    .1560081
         org_faenas |  -.0067553   .1030814    -0.07   0.948    -.2092814    .1957709
           min_dist |   .0012626   .0006092     2.07   0.039     .0000658    .0024595
       lnup_cwagepm |   .0005593   .0364832     0.02   0.988    -.0711199    .0722386
       up2_mcwagepm |  -.1798797    .236026    -0.76   0.446    -.6436046    .2838451
       dummy_age_hh |    .089484   .3051265     0.29   0.769    -.5100041    .6889722
      dummy_educ_hh |   .1177058     .21731     0.54   0.588    -.3092475    .5446591
 dummy_ethnicity_hh |  -.1778492   .2349644    -0.76   0.449    -.6394885    .2837901
       dummy_age_sp |  -.3052601   .1815591    -1.68   0.093    -.6619729    .0514526
      dummy_educ_sp |   .3186997   .1855652     1.72   0.087     -.045884    .6832834
   dummy_dage0_7_97 |   .1421631   .1722104     0.83   0.409    -.1961822    .4805084
  dummy_dirtfloor97 |   .1399154   .2249953     0.62   0.534    -.3021374    .5819683
dummy_electricity97 |  -.0419774   .3163133    -0.13   0.894    -.6634443    .5794896
              _cons |   -.845783   .3223192    -2.62   0.009     -1.47905   -.2125162
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.29
            Prob > F =    0.7490

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .7490164

. ***Output for Table 2 -- Panel A1;
. estout ani1_pc ani2_pc land_pc vani1_pc vani2_pc ha_pc 
>         using "$out_p/main.text", stats(N mean, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles - Unconditional) replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/main.text not found)
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/main.text)

. estout ani1_pc_pvalue ani2_pc_pvalue land_pc_pvalue vani1_pc_pvalue vani2_pc_pvalue ha_pc_pvalue 
>         using "$out_p/time.text", stats(N mean pvalue, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_opwave2 t2_c1_opwave3 t2_c1_opwave4) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles - Unconditional) replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/time.text not found)
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/time.text)

. estimates clear;

. foreach y of global treatcom1 {;
  2. ***Agricultural Assets: Eligibles, Conditional (dummy vars) -- Table 2, Panel A2;
. foreach x of global dep_dum {;
  3.         reg `x' `y' wave3 wave4 $basic $controls if `x'97 ==0, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         est store `x'_pc, title (`x');
  8.         reg `x' `y'wave2 `y'wave3 `y'wave4 wave3 wave4 $basic $controls if `x'97 ==0, cl(comuid);
  9.         test `y'wave2 = `y'wave3 = `y'wave4;
 10.         scalar mean =r(mean);
 11.         estadd scalar mean;
 12.         scalar pvalue =r(p);
 13.         estadd scalar pvalue;
 14.         est store `x'_pc_pvalue, title (`x');
 15. };
 16. ***Agricultural Assets: Eligibles, Conditional (continuous vars) -- Table 2, Panel A2;
. foreach x of global dep_cont {;
 17.         reg `x' `y' wave3 wave4 $basic $controls if `x'97 >0, cl(comuid);
 18.         sum `x' if e(sample) & `y' ==0;
 19.         scalar mean =r(mean);
 20.         estadd scalar mean;
 21.         est store `x'_pc, title (`x');
 22.         reg `x' `y'wave2 `y'wave3 `y'wave4 wave3 wave4 $basic $controls if `x'97 >0, cl(comuid);
 23.         test `y'wave2 = `y'wave3 = `y'wave4;
 24.         scalar pvalue =r(p);
 25.         estadd scalar pvalue;
 26.         est store `x'_pc_pvalue, title (`x');
 27. };
 28. };

Linear regression                               Number of obs     =     21,796
                                                F(35, 495)        =      10.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0603
                                                Root MSE          =     .31849

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0263013    .011317     2.32   0.021     .0040661    .0485366
              wave3 |  -.0005454   .0045993    -0.12   0.906    -.0095819    .0084911
              wave4 |   .0158736   .0064083     2.48   0.014     .0032828    .0284644
           nbani197 |          0  (omitted)
           nbani297 |   .0235533   .0037397     6.30   0.000     .0162057    .0309009
               ha97 |    .003843   .0029514     1.30   0.193    -.0019558    .0096418
              no497 |  -.0307272   .0082994    -3.70   0.000    -.0470335   -.0144208
             big497 |   .0104198   .0150454     0.69   0.489     -.019141    .0399806
             age_hh |  -.0008358   .0016224    -0.52   0.607    -.0040235    .0023519
            age_hh2 |   3.05e-06   .0000159     0.19   0.848    -.0000282    .0000343
          female_hh |  -.0146583   .0125914    -1.16   0.245    -.0393975     .010081
           educ1_hh |   .0286703   .0081974     3.50   0.001     .0125643    .0447762
       ethnicity_hh |  -.0854852   .0125642    -6.80   0.000    -.1101709   -.0607995
             age_sp |   .0015858   .0018758     0.85   0.398    -.0020996    .0052713
            age_sp2 |  -6.87e-06   .0000205    -0.34   0.737    -.0000471    .0000333
           educ1_sp |   .0022028   .0082108     0.27   0.789    -.0139295    .0183351
         dage0_7_97 |  -.0110955    .008882    -1.25   0.212    -.0285466    .0063556
        dage8_17_97 |  -.0018472   .0076327    -0.24   0.809    -.0168436    .0131492
       dage18_54_97 |   .0258505   .0146258     1.77   0.078    -.0028859    .0545869
         dage55p_97 |    .020744   .0101728     2.04   0.042     .0007567    .0407313
           hhsize97 |   .0107658    .002047     5.26   0.000     .0067439    .0147877
          homeown97 |   .0193152    .010739     1.80   0.073    -.0017845    .0404149
        dirtfloor97 |   .0071921   .0098271     0.73   0.465    -.0121159    .0265002
      electricity97 |   .0116095   .0092532     1.25   0.210    -.0065709    .0297898
         org_faenas |  -.0155021   .0191035    -0.81   0.417    -.0530361    .0220319
           min_dist |  -.0005433   .0001393    -3.90   0.000     -.000817   -.0002697
       lnup_cwagepm |   .0155813   .0142393     1.09   0.274    -.0123957    .0435582
       up2_mcwagepm |   .0649287   .0897613     0.72   0.470    -.1114314    .2412887
       dummy_age_hh |   .0597299   .1770509     0.34   0.736    -.2881341    .4075939
      dummy_educ_hh |   .0564145   .0594721     0.95   0.343    -.0604344    .1732634
 dummy_ethnicity_hh |  -.0144887   .0714215    -0.20   0.839    -.1548154     .125838
       dummy_age_sp |   -.105121   .0429845    -2.45   0.015    -.1895756   -.0206665
      dummy_educ_sp |      .0878   .0431387     2.04   0.042     .0030424    .1725576
   dummy_dage0_7_97 |   .0508955   .0700897     0.73   0.468    -.0868144    .1886055
  dummy_dirtfloor97 |    .100603   .0880306     1.14   0.254    -.0723567    .2735626
dummy_electricity97 |   .2647723   .1961595     1.35   0.178    -.1206356    .6501802
              _cons |  -.0449815    .095855    -0.47   0.639    -.2333143    .1433514
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |      8,470    .1072019     .309388          0          1

added scalar:
               e(mean) =  .10720189

Linear regression                               Number of obs     =     21,796
                                                F(37, 495)        =      10.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0604
                                                Root MSE          =      .3185

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0243638   .0128309     1.90   0.058     -.000846    .0495736
      t2_c1_opwave3 |   .0300329   .0124823     2.41   0.016      .005508    .0545577
      t2_c1_opwave4 |   .0246037   .0135618     1.81   0.070    -.0020422    .0512495
              wave3 |  -.0040378   .0080595    -0.50   0.617    -.0198729    .0117974
              wave4 |   .0157664   .0099594     1.58   0.114    -.0038015    .0353342
           nbani197 |          0  (omitted)
           nbani297 |   .0235519   .0037394     6.30   0.000     .0162049    .0308989
               ha97 |   .0038449   .0029511     1.30   0.193    -.0019534    .0096431
              no497 |  -.0307286      .0083    -3.70   0.000    -.0470362    -.014421
             big497 |   .0104128   .0150453     0.69   0.489    -.0191477    .0399733
             age_hh |  -.0008324   .0016224    -0.51   0.608      -.00402    .0023553
            age_hh2 |   3.02e-06   .0000159     0.19   0.849    -.0000282    .0000342
          female_hh |  -.0146789   .0125878    -1.17   0.244     -.039411    .0100532
           educ1_hh |   .0286531   .0081952     3.50   0.001     .0125514    .0447549
       ethnicity_hh |  -.0854521    .012573    -6.80   0.000    -.1101551   -.0607491
             age_sp |   .0015829   .0018758     0.84   0.399    -.0021026    .0052684
            age_sp2 |  -6.83e-06   .0000205    -0.33   0.739    -.0000471    .0000334
           educ1_sp |   .0021981   .0082118     0.27   0.789    -.0139362    .0183325
         dage0_7_97 |  -.0110919   .0088819    -1.25   0.212    -.0285427     .006359
        dage8_17_97 |  -.0018356   .0076344    -0.24   0.810    -.0168354    .0131641
       dage18_54_97 |   .0258295   .0146272     1.77   0.078    -.0029095    .0545685
         dage55p_97 |   .0207311   .0101736     2.04   0.042     .0007423    .0407199
           hhsize97 |    .010765   .0020473     5.26   0.000     .0067426    .0147874
          homeown97 |   .0193161   .0107402     1.80   0.073    -.0017859    .0404182
        dirtfloor97 |   .0072083    .009827     0.73   0.464    -.0120995     .026516
      electricity97 |   .0115777   .0092522     1.25   0.211    -.0066007     .029756
         org_faenas |  -.0155027   .0190976    -0.81   0.417     -.053025    .0220197
           min_dist |  -.0005436   .0001393    -3.90   0.000    -.0008173     -.00027
       lnup_cwagepm |   .0156765   .0142805     1.10   0.273    -.0123814    .0437343
       up2_mcwagepm |   .0651429   .0899559     0.72   0.469    -.1115995    .2418853
       dummy_age_hh |   .0603466   .1769574     0.34   0.733    -.2873337    .4080268
      dummy_educ_hh |   .0563605   .0595051     0.95   0.344    -.0605532    .1732742
 dummy_ethnicity_hh |   -.014395   .0714303    -0.20   0.840     -.154739    .1259491
       dummy_age_sp |  -.1051506   .0429999    -2.45   0.015    -.1896353   -.0206658
      dummy_educ_sp |   .0878514    .043142     2.04   0.042     .0030875    .1726153
   dummy_dage0_7_97 |   .0509602   .0700969     0.73   0.468     -.086764    .1886843
  dummy_dirtfloor97 |   .1006376    .088043     1.14   0.254    -.0723465    .2736216
dummy_electricity97 |   .2648164   .1961684     1.35   0.178    -.1206089    .6502418
              _cons |  -.0443664   .0959337    -0.46   0.644     -.232854    .1441211
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   495) =    0.20
            Prob > F =    0.8181

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .81812922

Linear regression                               Number of obs     =      5,948
                                                F(35, 405)        =       7.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0417
                                                Root MSE          =     .49091

                                      (Std. Err. adjusted for 406 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0564841   .0262136     2.15   0.032     .0049525    .1080157
              wave3 |   .0167306   .0177371     0.94   0.346    -.0181377     .051599
              wave4 |   .0548481   .0188291     2.91   0.004     .0178332     .091863
           nbani197 |   .0579292   .0196325     2.95   0.003     .0193348    .0965236
           nbani297 |          0  (omitted)
               ha97 |   .0013161   .0052776     0.25   0.803    -.0090588     .011691
              no497 |  -.0062437   .0236274    -0.26   0.792    -.0526913    .0402039
             big497 |   .0805409   .0360517     2.23   0.026     .0096691    .1514128
             age_hh |   .0052751   .0043957     1.20   0.231    -.0033661    .0139164
            age_hh2 |  -.0000661    .000042    -1.57   0.117    -.0001487    .0000165
          female_hh |   .1105451   .0403545     2.74   0.006     .0312147    .1898755
           educ1_hh |  -.0181412    .022434    -0.81   0.419    -.0622429    .0259604
       ethnicity_hh |   -.051139   .0285056    -1.79   0.074    -.1071764    .0048984
             age_sp |  -.0024383   .0050386    -0.48   0.629    -.0123433    .0074667
            age_sp2 |   .0000501   .0000549     0.91   0.362    -.0000579     .000158
           educ1_sp |   .0072723   .0271926     0.27   0.789     -.046184    .0607286
         dage0_7_97 |   -.001733   .0285595    -0.06   0.952    -.0578764    .0544103
        dage8_17_97 |   .0171833   .0250413     0.69   0.493    -.0320439    .0664105
       dage18_54_97 |   .0806549   .0393996     2.05   0.041     .0032016    .1581082
         dage55p_97 |   .0975813   .0259191     3.76   0.000     .0466286     .148534
           hhsize97 |   .0098652   .0062574     1.58   0.116    -.0024357    .0221662
          homeown97 |   .0224395    .026181     0.86   0.392    -.0290282    .0739071
        dirtfloor97 |   .0119693   .0223068     0.54   0.592    -.0318822    .0558208
      electricity97 |  -.0168511   .0252077    -0.67   0.504    -.0664054    .0327032
         org_faenas |  -.0136642   .0418196    -0.33   0.744    -.0958748    .0685464
           min_dist |   .0000917    .000271     0.34   0.735    -.0004409    .0006244
       lnup_cwagepm |   .0154165    .015725     0.98   0.327    -.0154963    .0463292
       up2_mcwagepm |   .1067835   .1095212     0.98   0.330    -.1085175    .3220846
       dummy_age_hh |    .430204   .1999115     2.15   0.032     .0372102    .8231978
      dummy_educ_hh |   .0501199   .1101366     0.46   0.649     -.166391    .2666307
 dummy_ethnicity_hh |  -.0169002   .1618169    -0.10   0.917     -.335006    .3012057
       dummy_age_sp |  -.1677347   .0652888    -2.57   0.011    -.2960819   -.0393874
      dummy_educ_sp |  -.0117361   .0593735    -0.20   0.843    -.1284549    .1049826
   dummy_dage0_7_97 |   .2333972   .1492865     1.56   0.119    -.0600761    .5268705
  dummy_dirtfloor97 |   .1971431   .1539746     1.28   0.201    -.1055462    .4998323
dummy_electricity97 |  -.2021272   .1256014    -1.61   0.108    -.4490393    .0447849
              _cons |   .1245902   .1526775     0.82   0.415    -.1755492    .4247296
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |      2,168    .4534133    .4979398          0          1

added scalar:
               e(mean) =  .45341328

Linear regression                               Number of obs     =      5,948
                                                F(37, 405)        =       7.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0419
                                                Root MSE          =     .49093

                                      (Std. Err. adjusted for 406 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0422874   .0312059     1.36   0.176    -.0190584    .1036331
      t2_c1_opwave3 |   .0489823   .0336389     1.46   0.146    -.0171463    .1151109
      t2_c1_opwave4 |   .0799695   .0333149     2.40   0.017     .0144777    .1454613
              wave3 |   .0124996    .027091     0.46   0.645    -.0407569    .0657561
              wave4 |   .0302943   .0237678     1.27   0.203    -.0164294     .077018
           nbani197 |   .0579311   .0196352     2.95   0.003     .0193315    .0965307
           nbani297 |          0  (omitted)
               ha97 |   .0013462   .0052789     0.26   0.799    -.0090313    .0117236
              no497 |  -.0061922   .0236244    -0.26   0.793     -.052634    .0402496
             big497 |   .0803208   .0361031     2.22   0.027      .009348    .1512937
             age_hh |   .0052658   .0043996     1.20   0.232    -.0033832    .0139147
            age_hh2 |  -.0000659    .000042    -1.57   0.118    -.0001486    .0000167
          female_hh |   .1102584   .0403874     2.73   0.007     .0308633    .1896534
           educ1_hh |  -.0181312   .0224549    -0.81   0.420     -.062274    .0260116
       ethnicity_hh |  -.0514248   .0284766    -1.81   0.072    -.1074053    .0045556
             age_sp |  -.0024335   .0050391    -0.48   0.629    -.0123395    .0074726
            age_sp2 |     .00005   .0000549     0.91   0.363     -.000058    .0001579
           educ1_sp |   .0072329    .027208     0.27   0.790    -.0462537    .0607195
         dage0_7_97 |  -.0018512    .028548    -0.06   0.948     -.057972    .0542695
        dage8_17_97 |   .0170818   .0250258     0.68   0.495    -.0321149    .0662784
       dage18_54_97 |   .0810432   .0394078     2.06   0.040     .0035738    .1585125
         dage55p_97 |   .0974873   .0258915     3.77   0.000     .0465888    .1483859
           hhsize97 |   .0098478   .0062609     1.57   0.117    -.0024601    .0221557
          homeown97 |   .0224967   .0262106     0.86   0.391    -.0290292    .0740226
        dirtfloor97 |   .0119862   .0223127     0.54   0.591     -.031877    .0558494
      electricity97 |  -.0167161   .0252133    -0.66   0.508    -.0662813     .032849
         org_faenas |  -.0137911   .0418102    -0.33   0.742    -.0959832    .0684011
           min_dist |   .0000933   .0002708     0.34   0.731    -.0004391    .0006256
       lnup_cwagepm |   .0152157    .015659     0.97   0.332    -.0155675    .0459988
       up2_mcwagepm |   .1102646   .1087361     1.01   0.311    -.1034931    .3240223
       dummy_age_hh |   .4179111     .19977     2.09   0.037     .0251956    .8106266
      dummy_educ_hh |   .0508427   .1099631     0.46   0.644    -.1653269    .2670124
 dummy_ethnicity_hh |  -.0157299   .1614183    -0.10   0.922    -.3330522    .3015925
       dummy_age_sp |  -.1677933   .0653618    -2.57   0.011    -.2962841   -.0393025
      dummy_educ_sp |  -.0115051   .0593905    -0.19   0.846    -.1282572     .105247
   dummy_dage0_7_97 |   .2336733   .1493893     1.56   0.119    -.0600019    .5273484
  dummy_dirtfloor97 |   .1956926   .1541723     1.27   0.205    -.1073853    .4987704
dummy_electricity97 |  -.2036909   .1276507    -1.60   0.111    -.4546316    .0472497
              _cons |   .1347409   .1530548     0.88   0.379    -.1661402    .4356219
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   405) =    0.79
            Prob > F =    0.4536

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .45362002

Linear regression                               Number of obs     =     13,612
                                                F(34, 474)        =      15.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0789
                                                Root MSE          =     .46105

                                      (Std. Err. adjusted for 475 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0503439   .0227466     2.21   0.027     .0056472    .0950406
              wave3 |  -.0180122   .0123012    -1.46   0.144    -.0421839    .0061595
              wave4 |   .0350981   .0138571     2.53   0.012     .0078692     .062327
           nbani197 |   .0180024    .012454     1.45   0.149    -.0064694    .0424742
           nbani297 |   .0345648   .0052185     6.62   0.000     .0243105    .0448191
               ha97 |          0  (omitted)
              no497 |   -.076438   .0127149    -6.01   0.000    -.1014226   -.0514535
             big497 |          0  (omitted)
             age_hh |   .0071342   .0029813     2.39   0.017     .0012759    .0129925
            age_hh2 |  -.0000581   .0000295    -1.97   0.050     -.000116   -9.84e-08
          female_hh |  -.1064107   .0277708    -3.83   0.000    -.1609797   -.0518417
           educ1_hh |   .0388941   .0149325     2.60   0.009     .0095519    .0682362
       ethnicity_hh |   .1143281   .0263997     4.33   0.000     .0624532    .1662031
             age_sp |  -.0052781   .0034404    -1.53   0.126    -.0120384    .0014822
            age_sp2 |   .0000556   .0000386     1.44   0.150    -.0000202    .0001314
           educ1_sp |   .0280797   .0144359     1.95   0.052    -.0002866    .0564459
         dage0_7_97 |  -.0134877   .0172328    -0.78   0.434    -.0473497    .0203743
        dage8_17_97 |   .0076139   .0132273     0.58   0.565    -.0183775    .0336053
       dage18_54_97 |  -.0102825   .0298621    -0.34   0.731     -.068961     .048396
         dage55p_97 |   .0395155   .0197578     2.00   0.046     .0006917    .0783393
           hhsize97 |   .0137879   .0039025     3.53   0.000     .0061197    .0214562
          homeown97 |   .0799084   .0150672     5.30   0.000     .0503017    .1095152
        dirtfloor97 |   .0235523   .0147809     1.59   0.112    -.0054919    .0525966
      electricity97 |    .007056   .0181383     0.39   0.697    -.0285854    .0426973
         org_faenas |  -.0328238   .0521874    -0.63   0.530     -.135371    .0697234
           min_dist |   .0002534   .0002853     0.89   0.375    -.0003072    .0008141
       lnup_cwagepm |  -.0334984   .0144943    -2.31   0.021    -.0619793   -.0050175
       up2_mcwagepm |  -.1311443   .1014491    -1.29   0.197    -.3304899    .0682012
       dummy_age_hh |   .3276823   .1963461     1.67   0.096    -.0581342    .7134988
      dummy_educ_hh |   .0629915   .1038969     0.61   0.545     -.141164    .2671469
 dummy_ethnicity_hh |  -.0473654   .0657943    -0.72   0.472    -.1766499    .0819191
       dummy_age_sp |  -.1029987   .0465614    -2.21   0.027    -.1944911   -.0115064
      dummy_educ_sp |   .0955486   .0470811     2.03   0.043      .003035    .1880621
   dummy_dage0_7_97 |   -.000962   .1166576    -0.01   0.993    -.2301919    .2282679
  dummy_dirtfloor97 |   .0592123   .1017538     0.58   0.561     -.140732    .2591566
dummy_electricity97 |   .0991252   .1910258     0.52   0.604     -.276237    .4744874
              _cons |   .2203469   .1299086     1.70   0.091     -.034921    .4756148
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |      5,344    .3274701    .4693343          0          1

added scalar:
               e(mean) =  .32747006

Linear regression                               Number of obs     =     13,612
                                                F(36, 474)        =      15.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0789
                                                Root MSE          =     .46108

                                      (Std. Err. adjusted for 475 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0509729   .0267986     1.90   0.058    -.0016859    .1036316
      t2_c1_opwave3 |   .0455073   .0272937     1.67   0.096    -.0081243     .099139
      t2_c1_opwave4 |   .0545575   .0276213     1.98   0.049     .0002822    .1088328
              wave3 |  -.0146539   .0187532    -0.78   0.435    -.0515035    .0221958
              wave4 |   .0328312   .0212377     1.55   0.123    -.0089004    .0745628
           nbani197 |   .0179907   .0124548     1.44   0.149    -.0064828    .0424642
           nbani297 |   .0345704     .00522     6.62   0.000     .0243132    .0448277
               ha97 |          0  (omitted)
              no497 |  -.0764426   .0127155    -6.01   0.000    -.1014283   -.0514569
             big497 |          0  (omitted)
             age_hh |   .0071296   .0029816     2.39   0.017     .0012707    .0129884
            age_hh2 |   -.000058   .0000295    -1.97   0.050     -.000116   -6.09e-08
          female_hh |  -.1065039   .0277837    -3.83   0.000    -.1610983   -.0519095
           educ1_hh |   .0389332   .0149548     2.60   0.010     .0095474    .0683191
       ethnicity_hh |   .1143208   .0263945     4.33   0.000     .0624562    .1661855
             age_sp |  -.0052772   .0034407    -1.53   0.126    -.0120381    .0014838
            age_sp2 |   .0000556   .0000386     1.44   0.151    -.0000203    .0001314
           educ1_sp |   .0280903   .0144401     1.95   0.052    -.0002841    .0564647
         dage0_7_97 |   -.013484   .0172321    -0.78   0.434    -.0473448    .0203768
        dage8_17_97 |   .0076144   .0132341     0.58   0.565    -.0183904    .0336193
       dage18_54_97 |  -.0102479   .0298477    -0.34   0.731    -.0688981    .0484023
         dage55p_97 |   .0395215   .0197638     2.00   0.046     .0006859     .078357
           hhsize97 |   .0137849   .0039036     3.53   0.000     .0061144    .0214555
          homeown97 |   .0798969   .0150657     5.30   0.000      .050293    .1095008
        dirtfloor97 |   .0235186   .0147837     1.59   0.112     -.005531    .0525683
      electricity97 |   .0071123   .0181365     0.39   0.695    -.0285257    .0427502
         org_faenas |  -.0328432   .0522005    -0.63   0.530    -.1354161    .0697297
           min_dist |   .0002535   .0002852     0.89   0.375     -.000307     .000814
       lnup_cwagepm |  -.0334913   .0144826    -2.31   0.021    -.0619494   -.0050333
       up2_mcwagepm |  -.1303218   .1014269    -1.28   0.199    -.3296238    .0689802
       dummy_age_hh |   .3260803   .1961061     1.66   0.097    -.0592644    .7114251
      dummy_educ_hh |   .0631908   .1039076     0.61   0.543    -.1409856    .2673673
 dummy_ethnicity_hh |  -.0475139   .0657916    -0.72   0.471    -.1767931    .0817653
       dummy_age_sp |  -.1029496   .0465231    -2.21   0.027    -.1943667   -.0115325
      dummy_educ_sp |   .0955796   .0470153     2.03   0.043     .0031954    .1879637
   dummy_dage0_7_97 |  -.0009264   .1166255    -0.01   0.994    -.2300934    .2282406
  dummy_dirtfloor97 |   .0591636   .1017742     0.58   0.561    -.1408207     .259148
dummy_electricity97 |   .0987647   .1904923     0.52   0.604    -.2755491    .4730785
              _cons |   .2199644   .1298156     1.69   0.091    -.0351209    .4750497
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   474) =    0.06
            Prob > F =    0.9374

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .93738685

Linear regression                               Number of obs     =     11,279
                                                F(34, 461)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1586
                                                Root MSE          =     1251.6

                                      (Std. Err. adjusted for 462 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   104.9467   56.69539     1.85   0.065    -6.466679    216.3602
              wave3 |  -21.22118   30.65937    -0.69   0.489    -81.47062    39.02826
              wave4 |  -43.16358   36.10115    -1.20   0.232    -114.1068    27.77963
           nbani197 |   220.0238   42.69229     5.15   0.000     136.1282    303.9194
           nbani297 |   48.90543   9.013676     5.43   0.000     31.19245    66.61842
               ha97 |   7.341553   10.67244     0.69   0.492     -13.6311    28.31421
              no497 |          0  (omitted)
             big497 |   148.1453   55.53335     2.67   0.008     39.01545    257.2752
             age_hh |    14.8292   8.922925     1.66   0.097    -2.705444    32.36385
            age_hh2 |  -.1166089   .0863339    -1.35   0.177    -.2862656    .0530478
          female_hh |  -176.1592   82.59718    -2.13   0.033    -338.4729   -13.84558
           educ1_hh |  -20.40467   49.90088    -0.41   0.683    -118.4661    77.65671
       ethnicity_hh |  -335.8025   38.05578    -8.82   0.000    -410.5868   -261.0182
             age_sp |    21.0495   10.87889     1.93   0.054    -.3288726    42.42787
            age_sp2 |  -.2275035   .1115295    -2.04   0.042    -.4466727   -.0083343
           educ1_sp |  -66.60717   55.26466    -1.21   0.229     -175.209     41.9947
         dage0_7_97 |  -98.55677   41.18635    -2.39   0.017     -179.493    -17.6205
        dage8_17_97 |  -40.33473   39.83278    -1.01   0.312    -118.6111    37.94159
       dage18_54_97 |  -187.1452    104.998    -1.78   0.075    -393.4792     19.1887
         dage55p_97 |  -10.09461   47.34812    -0.21   0.831    -103.1395    82.95028
           hhsize97 |    33.5114   9.443134     3.55   0.000     14.95448    52.06833
          homeown97 |  -1.036155   81.92074    -0.01   0.990    -162.0205    159.9482
        dirtfloor97 |  -100.4347   42.04238    -2.39   0.017    -183.0532   -17.81625
      electricity97 |   30.14656    46.8244     0.64   0.520    -61.86916    122.1623
         org_faenas |  -88.87524   76.93824    -1.16   0.249    -240.0684    62.31788
           min_dist |  -2.212374   .6374031    -3.47   0.001     -3.46495   -.9597986
       lnup_cwagepm |    177.308   50.31079     3.52   0.000     78.44109    276.1749
       up2_mcwagepm |   994.4638   313.5597     3.17   0.002     378.2803    1610.647
       dummy_age_hh |   576.5412   221.8495     2.60   0.010     140.5795    1012.503
      dummy_educ_hh |  -189.5724   178.5582    -1.06   0.289    -540.4613    161.3164
 dummy_ethnicity_hh |  -728.0789    172.223    -4.23   0.000    -1066.518   -389.6395
       dummy_age_sp |  -36.94603   363.6124    -0.10   0.919    -751.4893    677.5972
      dummy_educ_sp |   14.17906   359.2206     0.04   0.969    -691.7336    720.0917
   dummy_dage0_7_97 |    1645.77   1004.024     1.64   0.102    -327.2613    3618.802
  dummy_dirtfloor97 |  -376.1052   185.6637    -2.03   0.043    -740.9572   -11.25324
dummy_electricity97 |  -556.8555   102.3823    -5.44   0.000    -758.0493   -355.6618
              _cons |  -961.9136   391.1821    -2.46   0.014    -1730.635   -193.1926
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |      4,015    741.9229    1290.738          0   14367.83

added scalar:
               e(mean) =  741.9229

Linear regression                               Number of obs     =     11,279
                                                F(36, 461)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1592
                                                Root MSE          =     1251.3

                                      (Std. Err. adjusted for 462 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   160.7013   60.53215     2.65   0.008     41.74812    279.6544
      t2_c1_opwave3 |   139.8503    68.9197     2.03   0.043     4.414599     275.286
      t2_c1_opwave4 |   7.138116   75.20673     0.09   0.924    -140.6524    154.9286
              wave3 |  -8.182012   47.32586    -0.17   0.863    -101.1832    84.81914
              wave4 |   58.49014   60.65896     0.96   0.335     -60.7122    177.6925
           nbani197 |   219.9021   42.67233     5.15   0.000     136.0457    303.7585
           nbani297 |   48.83111   9.011106     5.42   0.000     31.12318    66.53904
               ha97 |   7.328293   10.67344     0.69   0.493    -13.64632    28.30291
              no497 |          0  (omitted)
             big497 |   147.7664   55.53536     2.66   0.008     38.63254    256.9002
             age_hh |   14.91683   8.933009     1.67   0.096    -2.637636    32.47129
            age_hh2 |   -.117139   .0864319    -1.36   0.176    -.2869883    .0527103
          female_hh |  -175.1086   82.60491    -2.12   0.035    -337.4374   -12.77976
           educ1_hh |  -20.41423   49.92454    -0.41   0.683    -118.5221    77.69365
       ethnicity_hh |  -335.0748   37.99731    -8.82   0.000    -409.7442   -260.4054
             age_sp |   20.94055   10.88663     1.92   0.055     -.453024    42.33413
            age_sp2 |  -.2266341   .1116202    -2.03   0.043    -.4459816   -.0072866
           educ1_sp |  -66.54467    55.2327    -1.20   0.229    -175.0837    41.99438
         dage0_7_97 |  -98.71663    41.1771    -2.40   0.017    -179.6347   -17.79855
        dage8_17_97 |  -40.87452    39.7934    -1.03   0.305    -119.0735    37.32441
       dage18_54_97 |  -187.6814   105.0653    -1.79   0.075    -394.1477    18.78486
         dage55p_97 |  -10.67278   47.39287    -0.23   0.822    -103.8056    82.46006
           hhsize97 |   33.66894   9.441697     3.57   0.000     15.11484    52.22304
          homeown97 |  -.7933868   81.96031    -0.01   0.992    -161.8555    160.2687
        dirtfloor97 |  -100.6156   42.02876    -2.39   0.017    -183.2073   -18.02394
      electricity97 |   29.37376   46.84867     0.63   0.531    -62.68965    121.4372
         org_faenas |  -88.24052    76.8803    -1.15   0.252    -239.3198    62.83874
           min_dist |  -2.225372   .6383791    -3.49   0.001    -3.479865   -.9708781
       lnup_cwagepm |   177.5835   50.59582     3.51   0.000     78.15647    277.0105
       up2_mcwagepm |   969.0743   314.8384     3.08   0.002      350.378     1587.77
       dummy_age_hh |   575.5943   222.3935     2.59   0.010     138.5636    1012.625
      dummy_educ_hh |  -189.0332   178.4848    -1.06   0.290    -539.7779    161.7115
 dummy_ethnicity_hh |  -727.9706   172.1219    -4.23   0.000    -1066.211     -389.73
       dummy_age_sp |  -33.94558   364.2335    -0.09   0.926    -749.7093    681.8181
      dummy_educ_sp |   10.59234   360.0043     0.03   0.977    -696.8605    718.0452
   dummy_dage0_7_97 |   1653.763   999.9653     1.65   0.099    -311.2917    3618.818
  dummy_dirtfloor97 |  -375.6038   185.5177    -2.02   0.043    -740.1689   -11.03867
dummy_electricity97 |  -553.9089   102.0471    -5.43   0.000    -754.4441   -353.3738
              _cons |  -997.7611   394.1201    -2.53   0.012    -1772.256   -223.2665
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   461) =    2.83
            Prob > F =    0.0603

added scalar:
             e(pvalue) =  .06025324

Linear regression                               Number of obs     =     27,107
                                                F(35, 500)        =      18.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2410
                                                Root MSE          =     2861.6

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   208.4204   73.47861     2.84   0.005     64.05552    352.7853
              wave3 |   -.000164   37.93356    -0.00   1.000    -74.52898    74.52865
              wave4 |   57.18734    56.6004     1.01   0.313    -54.01659    168.3913
           nbani197 |   206.9965   58.45251     3.54   0.000     92.15375    321.8393
           nbani297 |   574.9289   45.58286    12.61   0.000     485.3713    664.4864
               ha97 |   44.93142   29.14352     1.54   0.124    -12.32744    102.1903
              no497 |          0  (omitted)
             big497 |   132.0401   131.0643     1.01   0.314    -125.4646    389.5448
             age_hh |   36.95525   12.70152     2.91   0.004     12.00032    61.91018
            age_hh2 |  -.2579618   .1246439    -2.07   0.039    -.5028522   -.0130714
          female_hh |  -242.9126   113.5451    -2.14   0.033    -465.9968   -19.82834
           educ1_hh |  -29.45707   66.98259    -0.44   0.660    -161.0591     102.145
       ethnicity_hh |  -479.8653   79.53694    -6.03   0.000    -636.1331   -323.5975
             age_sp |   3.219925   14.45613     0.22   0.824    -25.18232    31.62217
            age_sp2 |  -.0475689    .153738    -0.31   0.757     -.349621    .2544832
           educ1_sp |  -96.58127   66.37418    -1.46   0.146    -226.9879     33.8254
         dage0_7_97 |  -149.0122   74.47862    -2.00   0.046    -295.3418   -2.682535
        dage8_17_97 |   41.55393   63.69611     0.65   0.514    -83.59108    166.6989
       dage18_54_97 |   216.8595   117.1353     1.85   0.065    -13.27864    446.9976
         dage55p_97 |  -65.93848   89.58318    -0.74   0.462    -241.9443    110.0674
           hhsize97 |   23.37254   16.31986     1.43   0.153    -8.691405    55.43649
          homeown97 |   57.43632   90.63187     0.63   0.527    -120.6299    235.5026
        dirtfloor97 |  -501.0179   79.18129    -6.33   0.000     -656.587   -345.4489
      electricity97 |  -26.65007   62.24796    -0.43   0.669    -148.9499    95.64974
         org_faenas |   53.42921   133.1627     0.40   0.688    -208.1982    315.0567
           min_dist |  -.7240131   .8368155    -0.87   0.387    -2.368121    .9200949
       lnup_cwagepm |    117.856   64.77921     1.82   0.069    -9.417036     245.129
       up2_mcwagepm |   440.4134   409.3997     1.08   0.283    -363.9423    1244.769
       dummy_age_hh |   1762.087   1427.012     1.23   0.217    -1041.593    4565.766
      dummy_educ_hh |   842.5477   1002.549     0.84   0.401     -1127.18    2812.275
 dummy_ethnicity_hh |  -643.2026   426.9296    -1.51   0.133        -1482    195.5944
       dummy_age_sp |   39.97118   268.5596     0.15   0.882    -487.6731    567.6155
      dummy_educ_sp |  -43.50085   258.6092    -0.17   0.866    -551.5955    464.5938
   dummy_dage0_7_97 |   2684.411   1987.868     1.35   0.177    -1221.192    6590.015
  dummy_dirtfloor97 |  -637.4259   223.9604    -2.85   0.005    -1077.445   -197.4065
dummy_electricity97 |   259.6982   100.5316     2.58   0.010     62.18186    457.2145
              _cons |  -994.7229   507.9987    -1.96   0.051    -1992.798    3.352173
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |     10,298    1279.164    3061.942          0   46596.51

added scalar:
               e(mean) =  1279.1645

Linear regression                               Number of obs     =     27,107
                                                F(37, 500)        =      17.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2412
                                                Root MSE          =     2861.4

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   116.1004   93.47742     1.24   0.215    -67.55655    299.7573
      t2_c1_opwave3 |   183.7919   92.52521     1.99   0.048     2.005795     365.578
      t2_c1_opwave4 |   334.9781   86.67156     3.86   0.000     164.6927    505.2634
              wave3 |  -41.89511    62.3325    -0.67   0.502     -164.361    80.57079
              wave4 |  -81.94378   87.93424    -0.93   0.352    -254.7099    90.82238
           nbani197 |    207.098   58.46377     3.54   0.000     92.23307    321.9629
           nbani297 |   575.0023   45.59091    12.61   0.000     485.4289    664.5757
               ha97 |   44.90726   29.13779     1.54   0.124    -12.34034    102.1549
              no497 |          0  (omitted)
             big497 |   132.4341   131.0576     1.01   0.313    -125.0573    389.9255
             age_hh |   36.85413   12.69128     2.90   0.004     11.91932    61.78894
            age_hh2 |  -.2571091   .1245526    -2.06   0.040      -.50182   -.0123981
          female_hh |  -242.7818   113.5517    -2.14   0.033    -465.8791   -19.68449
           educ1_hh |    -29.092   67.02291    -0.43   0.664    -160.7732    102.5892
       ethnicity_hh |  -480.3416   79.53341    -6.04   0.000    -636.6025   -324.0807
             age_sp |   3.368581   14.45539     0.23   0.816     -25.0322    31.76936
            age_sp2 |  -.0491346   .1537953    -0.32   0.749    -.3512992      .25303
           educ1_sp |  -96.42843   66.39155    -1.45   0.147    -226.8692    34.01235
         dage0_7_97 |  -148.6531   74.46274    -2.00   0.046    -294.9515   -2.354691
        dage8_17_97 |   41.41044   63.69028     0.65   0.516    -83.72312     166.544
       dage18_54_97 |   216.8342   117.1419     1.85   0.065    -13.31683    446.9851
         dage55p_97 |  -65.62182   89.62754    -0.73   0.464    -241.7148    110.4712
           hhsize97 |   23.30857   16.32097     1.43   0.154    -8.757567     55.3747
          homeown97 |   56.66422   90.62637     0.63   0.532    -121.3912    234.7197
        dirtfloor97 |  -501.1426   79.18962    -6.33   0.000     -656.728   -345.5572
      electricity97 |  -25.67702   62.24132    -0.41   0.680    -147.9638    96.60974
         org_faenas |   53.13379   133.3048     0.40   0.690    -208.7727    315.0403
           min_dist |  -.7021632   .8394652    -0.84   0.403    -2.351477    .9471508
       lnup_cwagepm |    117.558   63.89515     1.84   0.066    -7.978087     243.094
       up2_mcwagepm |   467.4807   402.0586     1.16   0.245    -322.4518    1257.413
       dummy_age_hh |   1750.085   1418.206     1.23   0.218    -1036.292    4536.462
      dummy_educ_hh |   841.6549   1002.469     0.84   0.402    -1127.916    2811.226
 dummy_ethnicity_hh |  -644.2829   426.0189    -1.51   0.131    -1481.291    192.7249
       dummy_age_sp |   33.98073   268.7966     0.13   0.899    -494.1293    562.0908
      dummy_educ_sp |  -37.85876   258.6524    -0.15   0.884    -546.0383    470.3208
   dummy_dage0_7_97 |   2672.741   1987.715     1.34   0.179    -1232.562    6578.043
  dummy_dirtfloor97 |  -636.3016   224.2023    -2.84   0.005    -1076.796    -195.807
dummy_electricity97 |   257.8643   101.0724     2.55   0.011      59.2854    456.4432
              _cons |  -938.1759   507.7711    -1.85   0.065    -1935.804    59.45205
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    2.20
            Prob > F =    0.1119

added scalar:
             e(pvalue) =  .1119405

Linear regression                               Number of obs     =     19,171
                                                F(35, 485)        =      20.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1416
                                                Root MSE          =     2.0519

                                      (Std. Err. adjusted for 486 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0310281   .0869469     0.36   0.721     -.139811    .2018672
              wave3 |  -.1349769   .0445061    -3.03   0.003    -.2224256   -.0475282
              wave4 |  -.0067829   .0540444    -0.13   0.900     -.112973    .0994072
           nbani197 |   .0844936   .0280486     3.01   0.003     .0293819    .1396054
           nbani297 |   .0538058   .0137202     3.92   0.000     .0268474    .0807642
               ha97 |   .1830755   .0329755     5.55   0.000      .118283    .2478681
              no497 |          0  (omitted)
             big497 |   .3752974   .0974457     3.85   0.000     .1838296    .5667652
             age_hh |   .0463239    .010825     4.28   0.000     .0250542    .0675936
            age_hh2 |  -.0003655   .0001053    -3.47   0.001    -.0005724   -.0001586
          female_hh |  -.2215617   .0900568    -2.46   0.014    -.3985113   -.0446121
           educ1_hh |  -.0998937   .0549306    -1.82   0.070     -.207825    .0080376
       ethnicity_hh |  -.2071065   .0746799    -2.77   0.006    -.3538425   -.0603704
             age_sp |   .0099041   .0123457     0.80   0.423    -.0143536    .0341618
            age_sp2 |  -.0001001   .0001316    -0.76   0.447    -.0003587    .0001585
           educ1_sp |   -.109733   .0517602    -2.12   0.035     -.211435   -.0080311
         dage0_7_97 |  -.1692049   .0565395    -2.99   0.003    -.2802975   -.0581122
        dage8_17_97 |   .0813604   .0515861     1.58   0.115    -.0199994    .1827203
       dage18_54_97 |   .2114596   .0971198     2.18   0.030     .0206321    .4022872
         dage55p_97 |   .0958296    .054032     1.77   0.077    -.0103362    .2019954
           hhsize97 |   .0287119   .0112208     2.56   0.011     .0066645    .0507594
          homeown97 |   .3868492   .0900896     4.29   0.000      .209835    .5638634
        dirtfloor97 |   .0589336   .0633015     0.93   0.352    -.0654455    .1833126
      electricity97 |   .0960563   .0661214     1.45   0.147    -.0338636    .2259761
         org_faenas |   .0287091   .1276094     0.22   0.822    -.2220265    .2794447
           min_dist |   .0012326   .0008507     1.45   0.148    -.0004389    .0029041
       lnup_cwagepm |   .0890751   .0636187     1.40   0.162    -.0359273    .2140775
       up2_mcwagepm |   .2302621    .412521     0.56   0.577    -.5802869    1.040811
       dummy_age_hh |   .0058721   .6298116     0.01   0.993    -1.231624    1.243368
      dummy_educ_hh |   .2135585   .3620241     0.59   0.556    -.4977708    .9248878
 dummy_ethnicity_hh |  -.1473773   .5675121    -0.26   0.795    -1.262463    .9677087
       dummy_age_sp |  -.5124863   .3958366    -1.29   0.196    -1.290253    .2652802
      dummy_educ_sp |   .5181276   .4016529     1.29   0.198     -.271067    1.307322
   dummy_dage0_7_97 |   .3345139   .6395173     0.52   0.601    -.9220527     1.59108
  dummy_dirtfloor97 |   .1346895   .3190059     0.42   0.673    -.4921147    .7614937
dummy_electricity97 |  -.1182364   .4324078    -0.27   0.785    -.9678603    .7313875
              _cons |   -1.70424     .53086    -3.21   0.001    -2.747309   -.6611706
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |      7,016    1.802328    2.251046          0         20

added scalar:
               e(mean) =  1.8023275

Linear regression                               Number of obs     =     19,171
                                                F(37, 485)        =      19.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1416
                                                Root MSE          =      2.052

                                      (Std. Err. adjusted for 486 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0259947   .1089229     0.24   0.811    -.1880243    .2400137
      t2_c1_opwave3 |   .0526561   .1022049     0.52   0.607    -.1481629     .253475
      t2_c1_opwave4 |   .0139369   .1032555     0.13   0.893    -.1889465    .2168202
              wave3 |  -.1520083    .074879    -2.03   0.043    -.2991355    -.004881
              wave4 |    .001335   .0951881     0.01   0.989    -.1856971     .188367
           nbani197 |   .0844463   .0280233     3.01   0.003     .0293843    .1395084
           nbani297 |   .0537912   .0137327     3.92   0.000     .0268084    .0807741
               ha97 |   .1830746   .0329755     5.55   0.000     .1182822    .2478671
              no497 |          0  (omitted)
             big497 |   .3752058   .0974228     3.85   0.000     .1837829    .5666286
             age_hh |   .0463482   .0108353     4.28   0.000     .0250583    .0676381
            age_hh2 |  -.0003657   .0001054    -3.47   0.001    -.0005728   -.0001586
          female_hh |  -.2218639    .090147    -2.46   0.014    -.3989908    -.044737
           educ1_hh |  -.0998676   .0549435    -1.82   0.070    -.2078244    .0080892
       ethnicity_hh |  -.2067919   .0748282    -2.76   0.006    -.3538194   -.0597643
             age_sp |   .0098645   .0123657     0.80   0.425    -.0144325    .0341615
            age_sp2 |  -.0000996   .0001318    -0.76   0.450    -.0003586    .0001594
           educ1_sp |  -.1097453   .0517689    -2.12   0.035    -.2114644   -.0080263
         dage0_7_97 |  -.1691835   .0565481    -2.99   0.003    -.2802929    -.058074
        dage8_17_97 |   .0814377   .0515767     1.58   0.115    -.0199036     .182779
       dage18_54_97 |   .2113722    .097114     2.18   0.030     .0205561    .4021883
         dage55p_97 |   .0957533   .0540071     1.77   0.077    -.0103635    .2018701
           hhsize97 |   .0287221   .0112229     2.56   0.011     .0066706    .0507735
          homeown97 |   .3868218    .090069     4.29   0.000     .2098482    .5637954
        dirtfloor97 |   .0589136   .0633022     0.93   0.352    -.0654669    .1832941
      electricity97 |   .0958433   .0661432     1.45   0.148    -.0341192    .2258058
         org_faenas |   .0286914   .1276366     0.22   0.822    -.2220976    .2794804
           min_dist |   .0012283   .0008505     1.44   0.149    -.0004429    .0028995
       lnup_cwagepm |   .0897704   .0635024     1.41   0.158    -.0350033    .2145442
       up2_mcwagepm |   .2297823   .4120267     0.56   0.577    -.5797954     1.03936
       dummy_age_hh |   .0060616   .6289014     0.01   0.992    -1.229646    1.241769
      dummy_educ_hh |   .2138429   .3621128     0.59   0.555    -.4976606    .9253464
 dummy_ethnicity_hh |  -.1470975   .5675315    -0.26   0.796    -1.262222    .9680266
       dummy_age_sp |  -.5114876   .3959689    -1.29   0.197    -1.289514    .2665387
      dummy_educ_sp |   .5175468   .4017472     1.29   0.198    -.2718331    1.306927
   dummy_dage0_7_97 |   .3363984   .6409755     0.52   0.600    -.9230333     1.59583
  dummy_dirtfloor97 |   .1350609   .3191947     0.42   0.672    -.4921143    .7622362
dummy_electricity97 |  -.1180105   .4322763    -0.27   0.785     -.967376     .731355
              _cons |  -1.704618   .5322607    -3.20   0.001    -2.750439   -.6587961
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   485) =    0.08
            Prob > F =    0.9199

added scalar:
             e(pvalue) =  .91990707

. ***Output for Table 2 -- Panel A2;
. estout ani1_pc ani2_pc land_pc vani1_pc vani2_pc ha_pc 
>          using "$out_p/main.text", stats(N mean, fmt(%9.0fc %9.3fc %9.3fc) 
>          labels("Number Observations" "Mean Dep Var Conditional Sample (Control Households)")) 
>          keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>          starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles - Conditional) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/main.text)

. estout ani1_pc_pvalue ani2_pc_pvalue land_pc_pvalue vani1_pc_pvalue vani2_pc_pvalue ha_pc_pvalue 
>         using "$out_p/time.text", stats(N mean pvalue, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Conditional Sample (Control Households)")) 
>         keep(t2_c1_opwave2 t2_c1_opwave3 t2_c1_opwave4) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Eligibles - Conditional) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/time.text)

. estimates clear;

. ***Micro-Enterprise: Eligibles, Unconditional -- Table 3;
. foreach x of global dep_me {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' wave3 wave4 $basic $controls, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         est store `x'_pc, title (`x');
  8.         reg `x' `y'wave2 `y'wave3 `y'wave4 wave3 wave4 $basic $controls, cl(comuid);
  9.         test `y'wave2 = `y'wave3 = `y'wave4;
 10.         scalar mean =r(mean);
 11.         estadd scalar mean;
 12.         scalar pvalue =r(p);
 13.         estadd scalar pvalue;
 14.         est store `x'_pc_pvalue, title (`x');
 15. };
 16. };

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =       4.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0293
                                                Root MSE          =     .24559

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                me2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0332966   .0147861     2.25   0.025      .004246    .0623473
              wave3 |  -.0074579   .0078757    -0.95   0.344    -.0229315    .0080156
              wave4 |  -.0724492   .0101887    -7.11   0.000    -.0924672   -.0524312
           nbani197 |   .0061025    .002403     2.54   0.011     .0013814    .0108237
           nbani297 |   .0011327   .0010822     1.05   0.296    -.0009935     .003259
               ha97 |   .0012365   .0013536     0.91   0.361    -.0014229    .0038958
              no497 |  -.0028243   .0088229    -0.32   0.749    -.0201589    .0145103
             big497 |   -.011115   .0075862    -1.47   0.144    -.0260198    .0037898
             age_hh |   .0013413   .0012436     1.08   0.281    -.0011021    .0037847
            age_hh2 |  -.0000115   .0000113    -1.02   0.309    -.0000337    .0000107
          female_hh |   .0206884   .0074201     2.79   0.006     .0061099    .0352669
           educ1_hh |  -.0003991   .0089539    -0.04   0.964    -.0179909    .0171927
       ethnicity_hh |   .0178717   .0153743     1.16   0.246    -.0123345    .0480778
             age_sp |   .0006665    .000892     0.75   0.455     -.001086    .0024189
            age_sp2 |  -3.00e-06   9.66e-06    -0.31   0.757     -.000022     .000016
           educ1_sp |  -.0004836   .0065771    -0.07   0.941    -.0134058    .0124386
         dage0_7_97 |   .0029144   .0062857     0.46   0.643    -.0094352     .015264
        dage8_17_97 |  -.0060875   .0045377    -1.34   0.180    -.0150027    .0028278
       dage18_54_97 |   .0112178    .009754     1.15   0.251     -.007946    .0303816
         dage55p_97 |  -.0045414    .004819    -0.94   0.346    -.0140094    .0049266
           hhsize97 |   .0001552   .0009853     0.16   0.875    -.0017807    .0020911
          homeown97 |   .0160691   .0071181     2.26   0.024      .002084    .0300542
        dirtfloor97 |     .00857   .0056318     1.52   0.129    -.0024949    .0196349
      electricity97 |   .0092481   .0136521     0.68   0.498    -.0175744    .0360706
         org_faenas |  -.0514673   .0410085    -1.26   0.210    -.1320375    .0291029
           min_dist |  -.0000417   .0001603    -0.26   0.795    -.0003565    .0002732
       lnup_cwagepm |   .0143871   .0053578     2.69   0.007     .0038606    .0249137
       up2_mcwagepm |   .1740069   .0527571     3.30   0.001     .0703539    .2776599
       dummy_age_hh |  -.0127602   .0925639    -0.14   0.890    -.1946223     .169102
      dummy_educ_hh |   .0101124   .0317772     0.32   0.750    -.0523209    .0725458
 dummy_ethnicity_hh |   .0603019   .0448632     1.34   0.180    -.0278418    .1484456
       dummy_age_sp |   .0050831   .0180373     0.28   0.778    -.0303551    .0405212
      dummy_educ_sp |  -.0098644   .0184053    -0.54   0.592    -.0460257    .0262969
   dummy_dage0_7_97 |  -.0434665   .0142484    -3.05   0.002    -.0714605   -.0154724
  dummy_dirtfloor97 |   .0216521   .0371502     0.58   0.560    -.0513376    .0946418
dummy_electricity97 |   .0368502   .0579935     0.64   0.525    -.0770907    .1507911
              _cons |   -.074266   .0587009    -1.27   0.206    -.1895967    .0410648
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         me2 |     12,490    .0486789    .2152046          0          1

added scalar:
               e(mean) =  .04867894

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =       4.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0294
                                                Root MSE          =     .24559

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                me2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0373331   .0164523     2.27   0.024     .0050089    .0696573
      t2_c1_opwave3 |   .0329144   .0237325     1.39   0.166    -.0137132    .0795421
      t2_c1_opwave4 |   .0292647   .0133051     2.20   0.028     .0031239    .0554055
              wave3 |  -.0047002   .0087209    -0.54   0.590    -.0218343     .012434
              wave4 |  -.0673177   .0115979    -5.80   0.000    -.0901043    -.044531
           nbani197 |   .0060996   .0024014     2.54   0.011     .0013816    .0108176
           nbani297 |   .0011307   .0010831     1.04   0.297    -.0009972    .0032586
               ha97 |   .0012363   .0013537     0.91   0.362    -.0014233    .0038959
              no497 |  -.0028307   .0088113    -0.32   0.748    -.0201424    .0144811
             big497 |  -.0111214   .0075987    -1.46   0.144    -.0260508    .0038079
             age_hh |   .0013432   .0012418     1.08   0.280    -.0010965    .0037829
            age_hh2 |  -.0000115   .0000113    -1.02   0.308    -.0000337    .0000106
          female_hh |   .0207016   .0074224     2.79   0.005     .0061186    .0352845
           educ1_hh |  -.0004053   .0089352    -0.05   0.964    -.0179604    .0171498
       ethnicity_hh |   .0178874   .0153596     1.16   0.245    -.0122898    .0480646
             age_sp |   .0006634     .00089     0.75   0.456    -.0010852     .002412
            age_sp2 |  -2.96e-06   9.64e-06    -0.31   0.759    -.0000219     .000016
           educ1_sp |   -.000485   .0065749    -0.07   0.941    -.0134028    .0124329
         dage0_7_97 |    .002907   .0062823     0.46   0.644    -.0094359    .0152499
        dage8_17_97 |  -.0060809   .0045315    -1.34   0.180     -.014984    .0028223
       dage18_54_97 |   .0112117   .0097639     1.15   0.251    -.0079717    .0303951
         dage55p_97 |  -.0045452   .0048241    -0.94   0.347    -.0140232    .0049327
           hhsize97 |   .0001573   .0009853     0.16   0.873    -.0017786    .0020932
          homeown97 |   .0160842   .0071301     2.26   0.025     .0020755    .0300929
        dirtfloor97 |   .0085689    .005631     1.52   0.129    -.0024944    .0196322
      electricity97 |    .009225    .013571     0.68   0.497    -.0174383    .0358882
         org_faenas |  -.0514526   .0409946    -1.26   0.210    -.1319955    .0290903
           min_dist |  -.0000423   .0001594    -0.27   0.791    -.0003555    .0002709
       lnup_cwagepm |   .0143797    .005261     2.73   0.006     .0040434    .0247161
       up2_mcwagepm |    .173085   .0538257     3.22   0.001     .0673326    .2788374
       dummy_age_hh |  -.0120621   .0922498    -0.13   0.896    -.1933072    .1691829
      dummy_educ_hh |     .01014   .0317768     0.32   0.750    -.0522926    .0725725
 dummy_ethnicity_hh |   .0602744   .0448295     1.34   0.179     -.027803    .1483517
       dummy_age_sp |   .0052436   .0180314     0.29   0.771     -.030183    .0406702
      dummy_educ_sp |  -.0100317   .0184042    -0.55   0.586    -.0461907    .0261273
   dummy_dage0_7_97 |   -.043323   .0141472    -3.06   0.002    -.0711183   -.0155276
  dummy_dirtfloor97 |   .0216539   .0371759     0.58   0.561    -.0513863    .0946942
dummy_electricity97 |   .0369808   .0579462     0.64   0.524    -.0768672    .1508288
              _cons |  -.0766631   .0589489    -1.30   0.194    -.1924812    .0391551
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.22
            Prob > F =    0.7995

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .79954698

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =       1.84
                                                Prob > F          =     0.0026
                                                R-squared         =     0.0317
                                                Root MSE          =     .17175

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             crafts |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0285285   .0118715     2.40   0.017     .0052043    .0518528
              wave3 |   .0009861   .0043331     0.23   0.820    -.0075272    .0094994
              wave4 |  -.0370158   .0087932    -4.21   0.000    -.0542919   -.0197397
           nbani197 |   .0042292   .0017906     2.36   0.019     .0007112    .0077472
           nbani297 |  -.0003629   .0006838    -0.53   0.596    -.0017063    .0009805
               ha97 |   .0000187      .0007     0.03   0.979    -.0013566    .0013939
              no497 |  -.0007277   .0057261    -0.13   0.899    -.0119779    .0105226
             big497 |  -.0128023   .0051246    -2.50   0.013    -.0228706    -.002734
             age_hh |   .0009224   .0010547     0.87   0.382    -.0011497    .0029945
            age_hh2 |  -7.74e-06   9.52e-06    -0.81   0.416    -.0000264     .000011
          female_hh |   .0107809    .004945     2.18   0.030     .0010652    .0204965
           educ1_hh |  -.0010847   .0074813    -0.14   0.885    -.0157833    .0136139
       ethnicity_hh |   .0198024   .0126769     1.56   0.119     -.005104    .0447089
             age_sp |   .0006518   .0006661     0.98   0.328    -.0006569    .0019606
            age_sp2 |  -4.05e-06   7.52e-06    -0.54   0.591    -.0000188    .0000107
           educ1_sp |  -.0002135   .0053516    -0.04   0.968    -.0107279    .0103009
         dage0_7_97 |   .0003992   .0054362     0.07   0.941    -.0102815    .0110799
        dage8_17_97 |  -.0097209   .0033159    -2.93   0.004    -.0162357   -.0032061
       dage18_54_97 |   .0139123   .0082926     1.68   0.094    -.0023803    .0302049
         dage55p_97 |  -.0025736   .0038611    -0.67   0.505    -.0101596    .0050124
           hhsize97 |   .0005243   .0007625     0.69   0.492    -.0009737    .0020223
          homeown97 |   .0063159     .00573     1.10   0.271    -.0049418    .0175737
        dirtfloor97 |   .0066661   .0038988     1.71   0.088    -.0009939    .0143262
      electricity97 |  -.0008396    .011868    -0.07   0.944     -.024157    .0224777
         org_faenas |  -.0325394   .0279695    -1.16   0.245    -.0874916    .0224128
           min_dist |   .0000953    .000117     0.81   0.416    -.0001346    .0003251
       lnup_cwagepm |   .0060495   .0037688     1.61   0.109    -.0013552    .0134541
       up2_mcwagepm |   .1207421   .0476137     2.54   0.012     .0271946    .2142896
       dummy_age_hh |    .036487   .0882812     0.41   0.680    -.1369609    .2099349
      dummy_educ_hh |   .0057626   .0208008     0.28   0.782    -.0351053    .0466304
 dummy_ethnicity_hh |   .0271992   .0255526     1.06   0.288    -.0230044    .0774029
       dummy_age_sp |   .0113106   .0088185     1.28   0.200    -.0060152    .0286364
      dummy_educ_sp |  -.0166464   .0089637    -1.86   0.064    -.0342577    .0009648
   dummy_dage0_7_97 |  -.0213165    .011478    -1.86   0.064    -.0438677    .0012346
  dummy_dirtfloor97 |  -.0071949   .0222623    -0.32   0.747     -.050934    .0365443
dummy_electricity97 |  -.0206864   .0136613    -1.51   0.131     -.047527    .0061543
              _cons |  -.0664256   .0432268    -1.54   0.125    -.1513542    .0185031
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      crafts |     12,490    .0160128    .1255295          0          1

added scalar:
               e(mean) =  .01601281

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =       1.87
                                                Prob > F          =     0.0017
                                                R-squared         =     0.0318
                                                Root MSE          =     .17175

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             crafts |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0332748   .0138585     2.40   0.017     .0060467    .0605029
      t2_c1_opwave3 |   .0247474    .015258     1.62   0.105    -.0052303    .0547251
      t2_c1_opwave4 |   .0272225   .0128708     2.12   0.035     .0019349      .05251
              wave3 |   .0063241    .005222     1.21   0.226    -.0039356    .0165839
              wave4 |  -.0332139   .0095856    -3.46   0.001     -.052047   -.0143809
           nbani197 |   .0042275   .0017882     2.36   0.018     .0007141    .0077408
           nbani297 |  -.0003625   .0006835    -0.53   0.596    -.0017054    .0009804
               ha97 |   .0000179   .0007004     0.03   0.980    -.0013581     .001394
              no497 |  -.0007294     .00572    -0.13   0.899    -.0119677    .0105089
             big497 |  -.0127993   .0051379    -2.49   0.013    -.0228938   -.0027048
             age_hh |   .0009206   .0010519     0.88   0.382    -.0011462    .0029874
            age_hh2 |  -7.73e-06   9.49e-06    -0.81   0.416    -.0000264    .0000109
          female_hh |   .0107953   .0049474     2.18   0.030      .001075    .0205157
           educ1_hh |  -.0010785   .0074648    -0.14   0.885    -.0157446    .0135877
       ethnicity_hh |   .0197891   .0126686     1.56   0.119    -.0051012    .0446794
             age_sp |   .0006525   .0006637     0.98   0.326    -.0006515    .0019566
            age_sp2 |  -4.05e-06   7.49e-06    -0.54   0.589    -.0000188    .0000107
           educ1_sp |  -.0002119    .005348    -0.04   0.968    -.0107193    .0102955
         dage0_7_97 |   .0003924   .0054318     0.07   0.942    -.0102796    .0110645
        dage8_17_97 |  -.0097191   .0033121    -2.93   0.003    -.0162265   -.0032116
       dage18_54_97 |   .0139245   .0082983     1.68   0.094    -.0023794    .0302283
         dage55p_97 |  -.0025676   .0038629    -0.66   0.507    -.0101571     .005022
           hhsize97 |   .0005246   .0007624     0.69   0.492    -.0009732    .0020224
          homeown97 |   .0063242   .0057414     1.10   0.271     -.004956    .0176043
        dirtfloor97 |   .0066554   .0038963     1.71   0.088    -.0009998    .0143106
      electricity97 |  -.0008297    .011806    -0.07   0.944    -.0240252    .0223659
         org_faenas |  -.0325297   .0279658    -1.16   0.245    -.0874746    .0224152
           min_dist |   .0000951   .0001163     0.82   0.414    -.0001334    .0003235
       lnup_cwagepm |   .0059864   .0037055     1.62   0.107    -.0012938    .0132666
       up2_mcwagepm |   .1201312   .0483853     2.48   0.013     .0250678    .2151947
       dummy_age_hh |   .0367336   .0881934     0.42   0.677    -.1365417    .2100089
      dummy_educ_hh |   .0058165   .0207869     0.28   0.780    -.0350238    .0466569
 dummy_ethnicity_hh |   .0271058   .0255434     1.06   0.289    -.0230798    .0772913
       dummy_age_sp |   .0114257   .0088167     1.30   0.196    -.0058967    .0287481
      dummy_educ_sp |  -.0167827   .0089684    -1.87   0.062    -.0344032    .0008377
   dummy_dage0_7_97 |  -.0212289   .0114495    -1.85   0.064     -.043724    .0012662
  dummy_dirtfloor97 |  -.0072409   .0222474    -0.33   0.745    -.0509507     .036469
dummy_electricity97 |  -.0206418   .0137941    -1.50   0.135    -.0477433    .0064597
              _cons |  -.0689562   .0432042    -1.60   0.111    -.1538402    .0159279
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.71
            Prob > F =    0.4938

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .49381305

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =       1.96
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0086
                                                Root MSE          =     .07225

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              const |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0023713   .0039957    -0.59   0.553    -.0102217    .0054792
              wave3 |  -.0002052   .0011444    -0.18   0.858    -.0024536    .0020432
              wave4 |  -.0044452   .0016291    -2.73   0.007     -.007646   -.0012445
           nbani197 |  -.0002404   .0003592    -0.67   0.504    -.0009461    .0004653
           nbani297 |  -.0002368   .0001133    -2.09   0.037    -.0004594   -.0000143
               ha97 |   .0002374   .0002335     1.02   0.310    -.0002214    .0006961
              no497 |   .0011218   .0014632     0.77   0.444     -.001753    .0039967
             big497 |  -.0020046   .0012475    -1.61   0.109    -.0044557    .0004464
             age_hh |    .000081   .0001716     0.47   0.637     -.000256    .0004181
            age_hh2 |  -1.29e-06   1.58e-06    -0.82   0.412    -4.39e-06    1.81e-06
          female_hh |  -.0010164   .0013819    -0.74   0.462    -.0037314    .0016985
           educ1_hh |   .0003277   .0022366     0.15   0.884    -.0040666    .0047219
       ethnicity_hh |   .0071507   .0065549     1.09   0.276    -.0057279    .0200293
             age_sp |  -.0001875   .0003153    -0.59   0.552     -.000807     .000432
            age_sp2 |   1.59e-06   3.01e-06     0.53   0.597    -4.32e-06    7.51e-06
           educ1_sp |   .0010208   .0020269     0.50   0.615    -.0029614     .005003
         dage0_7_97 |  -.0003684   .0010225    -0.36   0.719    -.0023774    .0016406
        dage8_17_97 |  -.0004014   .0009869    -0.41   0.684    -.0023404    .0015376
       dage18_54_97 |  -.0009899   .0015641    -0.63   0.527    -.0040629     .002083
         dage55p_97 |  -.0012842   .0011092    -1.16   0.248    -.0034635    .0008952
           hhsize97 |   .0003392   .0002136     1.59   0.113    -.0000804    .0007588
          homeown97 |   .0041833   .0019269     2.17   0.030     .0003975    .0079691
        dirtfloor97 |   .0015124   .0019789     0.76   0.445    -.0023755    .0054004
      electricity97 |   .0021991   .0030055     0.73   0.465    -.0037059    .0081041
         org_faenas |   .0032257   .0028854     1.12   0.264    -.0024434    .0088947
           min_dist |  -.0001119   .0000949    -1.18   0.239    -.0002983    .0000746
       lnup_cwagepm |   .0005538   .0007743     0.72   0.475    -.0009675     .002075
       up2_mcwagepm |   .0021957   .0051589     0.43   0.671    -.0079401    .0123315
       dummy_age_hh |  -.0144634   .0139506    -1.04   0.300    -.0418725    .0129457
      dummy_educ_hh |   -.008207   .0038211    -2.15   0.032    -.0157145   -.0006995
 dummy_ethnicity_hh |   .0308098   .0305134     1.01   0.313    -.0291406    .0907601
       dummy_age_sp |  -.0155408   .0103675    -1.50   0.135    -.0359101    .0048285
      dummy_educ_sp |   .0128625   .0106555     1.21   0.228    -.0080725    .0337976
   dummy_dage0_7_97 |  -.0041317   .0023984    -1.72   0.086    -.0088439    .0005805
  dummy_dirtfloor97 |  -.0043133    .001514    -2.85   0.005    -.0072879   -.0013387
dummy_electricity97 |   .0706813   .0618627     1.14   0.254    -.0508615    .1922242
              _cons |   .0075891    .009995     0.76   0.448    -.0120483    .0272265
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       const |     12,490    .0069656    .0831722          0          1

added scalar:
               e(mean) =  .00696557

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =       2.06
                                                Prob > F          =     0.0003
                                                R-squared         =     0.0087
                                                Root MSE          =     .07224

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              const |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |  -.0026905   .0049358    -0.55   0.586    -.0123879    .0070069
      t2_c1_opwave3 |  -.0040059   .0065384    -0.61   0.540    -.0168519    .0088402
      t2_c1_opwave4 |   -.000336   .0012339    -0.27   0.785    -.0027602    .0020882
              wave3 |   .0006237   .0020696     0.30   0.763    -.0034424    .0046899
              wave4 |  -.0059664   .0042724    -1.40   0.163    -.0143604    .0024277
           nbani197 |  -.0002393   .0003603    -0.66   0.507    -.0009472    .0004687
           nbani297 |  -.0002353   .0001124    -2.09   0.037     -.000456   -.0000145
               ha97 |   .0002371   .0002334     1.02   0.310    -.0002215    .0006958
              no497 |   .0011252   .0014652     0.77   0.443    -.0017536     .004004
             big497 |  -.0019989    .001246    -1.60   0.109    -.0044469    .0004491
             age_hh |   .0000789   .0001728     0.46   0.648    -.0002606    .0004183
            age_hh2 |  -1.27e-06   1.59e-06    -0.80   0.422    -4.39e-06    1.84e-06
          female_hh |   -.001018   .0013849    -0.74   0.463     -.003739     .001703
           educ1_hh |   .0003349   .0022463     0.15   0.882    -.0040785    .0047483
       ethnicity_hh |   .0071335   .0065248     1.09   0.275    -.0056859     .019953
             age_sp |  -.0001851   .0003124    -0.59   0.554    -.0007989    .0004287
            age_sp2 |   1.57e-06   2.98e-06     0.53   0.599    -4.29e-06    7.43e-06
           educ1_sp |   .0010224   .0020285     0.50   0.614     -.002963    .0050079
         dage0_7_97 |  -.0003669    .001023    -0.36   0.720    -.0023769    .0016431
        dage8_17_97 |  -.0004049   .0009846    -0.41   0.681    -.0023393    .0015295
       dage18_54_97 |  -.0009798   .0015609    -0.63   0.530    -.0040465    .0020869
         dage55p_97 |  -.0012786   .0011073    -1.15   0.249    -.0034541    .0008969
           hhsize97 |    .000338   .0002136     1.58   0.114    -.0000817    .0007576
          homeown97 |   .0041773   .0019186     2.18   0.030     .0004077    .0079469
        dirtfloor97 |   .0015078   .0019716     0.76   0.445    -.0023659    .0053815
      electricity97 |   .0022195   .0030371     0.73   0.465    -.0037475    .0081865
         org_faenas |   .0032208   .0028797     1.12   0.264     -.002437    .0088785
           min_dist |  -.0001116   .0000943    -1.18   0.237    -.0002969    .0000738
       lnup_cwagepm |   .0005272   .0007507     0.70   0.483    -.0009478    .0020021
       up2_mcwagepm |    .002505   .0050082     0.50   0.617    -.0073348    .0123448
       dummy_age_hh |  -.0148055   .0140111    -1.06   0.291    -.0423334    .0127223
      dummy_educ_hh |  -.0081984   .0038178    -2.15   0.032    -.0156994   -.0006975
 dummy_ethnicity_hh |   .0307814   .0305252     1.01   0.314    -.0291921    .0907549
       dummy_age_sp |  -.0155903   .0103542    -1.51   0.133    -.0359334    .0047528
      dummy_educ_sp |    .012906   .0106329     1.21   0.225    -.0079848    .0337967
   dummy_dage0_7_97 |  -.0041836   .0024218    -1.73   0.085    -.0089417    .0005746
  dummy_dirtfloor97 |  -.0043375   .0015354    -2.83   0.005    -.0073541    -.001321
dummy_electricity97 |   .0706165   .0617576     1.14   0.253    -.0507199     .191953
              _cons |   .0079226   .0106264     0.75   0.456    -.0129553    .0288005
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.18
            Prob > F =    0.8325

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .83253762

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =       2.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0023
                                                Root MSE          =     .08139

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             sewing |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    .000401   .0012986     0.31   0.758    -.0021504    .0029523
              wave3 |  -.0018963   .0012449    -1.52   0.128    -.0043421    .0005495
              wave4 |  -.0039088   .0014936    -2.62   0.009    -.0068433   -.0009743
           nbani197 |   .0005464   .0008737     0.63   0.532    -.0011701    .0022628
           nbani297 |   .0000525   .0002325     0.23   0.821    -.0004042    .0005092
               ha97 |  -.0004788   .0002404    -1.99   0.047    -.0009512   -6.44e-06
              no497 |  -.0026743   .0017663    -1.51   0.131    -.0061445    .0007959
             big497 |   .0017934   .0017201     1.04   0.298    -.0015861     .005173
             age_hh |  -.0003764   .0003146    -1.20   0.232    -.0009945    .0002417
            age_hh2 |   2.94e-06   3.03e-06     0.97   0.332    -3.01e-06    8.89e-06
          female_hh |   .0073101   .0026918     2.72   0.007     .0020215    .0125987
           educ1_hh |  -.0017958   .0014043    -1.28   0.202    -.0045548    .0009633
       ethnicity_hh |  -.0003973    .001436    -0.28   0.782    -.0032187    .0024241
             age_sp |   .0002147   .0002988     0.72   0.473    -.0003724    .0008018
            age_sp2 |  -1.23e-06   3.11e-06    -0.40   0.692    -7.34e-06    4.87e-06
           educ1_sp |  -.0006673   .0015009    -0.44   0.657    -.0036161    .0022815
         dage0_7_97 |   -.001009   .0015691    -0.64   0.521    -.0040918    .0020739
        dage8_17_97 |    .000957   .0015672     0.61   0.542    -.0021221    .0040362
       dage18_54_97 |   .0065275   .0023561     2.77   0.006     .0018984    .0111565
         dage55p_97 |   .0010495   .0016017     0.66   0.513    -.0020975    .0041964
           hhsize97 |  -.0001581   .0002935    -0.54   0.590    -.0007347    .0004185
          homeown97 |   .0026334   .0016575     1.59   0.113    -.0006231    .0058899
        dirtfloor97 |   .0004443   .0012187     0.36   0.716    -.0019502    .0028388
      electricity97 |   .0015383   .0012988     1.18   0.237    -.0010133      .00409
         org_faenas |   .0009866   .0017693     0.56   0.577    -.0024897    .0044628
           min_dist |  -9.70e-06   .0000167    -0.58   0.561    -.0000424     .000023
       lnup_cwagepm |   .0021875   .0009682     2.26   0.024     .0002852    .0040897
       up2_mcwagepm |   .0120035   .0059699     2.01   0.045     .0002744    .0237326
       dummy_age_hh |   -.001218   .0048624    -0.25   0.802    -.0107712    .0083353
      dummy_educ_hh |  -.0041846   .0012878    -3.25   0.001    -.0067148   -.0016545
 dummy_ethnicity_hh |  -.0044583    .001277    -3.49   0.001    -.0069673   -.0019493
       dummy_age_sp |   .0086748   .0018427     4.71   0.000     .0050545    .0122951
      dummy_educ_sp |  -.0087458   .0014867    -5.88   0.000    -.0116667   -.0058248
   dummy_dage0_7_97 |   .0014361    .002444     0.59   0.557    -.0033658     .006238
  dummy_dirtfloor97 |   .0195473   .0171151     1.14   0.254    -.0140791    .0531736
dummy_electricity97 |   -.003098   .0017936    -1.73   0.085    -.0066219    .0004259
              _cons |  -.0082648   .0089609    -0.92   0.357    -.0258705    .0093409
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      sewing |     12,490    .0064051    .0797785          0          1

added scalar:
               e(mean) =  .00640512

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =       2.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0023
                                                Root MSE          =     .08139

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             sewing |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0002283   .0021216     0.11   0.914    -.0039401    .0043967
      t2_c1_opwave3 |    .001404    .002072     0.68   0.498    -.0026669    .0054749
      t2_c1_opwave4 |  -.0004438   .0017413    -0.25   0.799    -.0038651    .0029774
              wave3 |  -.0026348   .0023208    -1.14   0.257    -.0071945    .0019249
              wave4 |  -.0034673   .0019642    -1.77   0.078    -.0073263    .0003918
           nbani197 |    .000546   .0008736     0.62   0.532    -.0011704    .0022623
           nbani297 |   .0000517   .0002325     0.22   0.824     -.000405    .0005085
               ha97 |  -.0004786   .0002405    -1.99   0.047    -.0009511   -6.17e-06
              no497 |  -.0026758   .0017663    -1.51   0.130     -.006146    .0007945
             big497 |   .0017906   .0017202     1.04   0.298    -.0015891    .0051703
             age_hh |  -.0003753   .0003144    -1.19   0.233    -.0009929    .0002424
            age_hh2 |   2.93e-06   3.03e-06     0.97   0.333    -3.01e-06    8.88e-06
          female_hh |   .0073098   .0026914     2.72   0.007     .0020219    .0125977
           educ1_hh |  -.0017995   .0014036    -1.28   0.200    -.0045572    .0009583
       ethnicity_hh |  -.0003885   .0014317    -0.27   0.786    -.0032015    .0024244
             age_sp |   .0002135   .0002989     0.71   0.475    -.0003736    .0008007
            age_sp2 |  -1.22e-06   3.11e-06    -0.39   0.695    -7.33e-06    4.89e-06
           educ1_sp |  -.0006681    .001501    -0.45   0.656    -.0036173     .002281
         dage0_7_97 |  -.0010092   .0015689    -0.64   0.520    -.0040917    .0020733
        dage8_17_97 |   .0009585   .0015678     0.61   0.541    -.0021217    .0040387
       dage18_54_97 |    .006522   .0023568     2.77   0.006     .0018915    .0111525
         dage55p_97 |   .0010465   .0016011     0.65   0.514    -.0020992    .0041922
           hhsize97 |  -.0001575   .0002934    -0.54   0.591    -.0007339    .0004188
          homeown97 |   .0026356   .0016571     1.59   0.112    -.0006201    .0058912
        dirtfloor97 |   .0004471   .0012186     0.37   0.714     -.001947    .0028412
      electricity97 |   .0015283   .0012947     1.18   0.238    -.0010153     .004072
         org_faenas |   .0009881    .001769     0.56   0.577    -.0024875    .0044638
           min_dist |  -9.82e-06   .0000166    -0.59   0.555    -.0000425    .0000228
       lnup_cwagepm |   .0022039   .0009605     2.29   0.022     .0003168    .0040911
       up2_mcwagepm |   .0119028   .0059141     2.01   0.045     .0002832    .0235224
       dummy_age_hh |  -.0010778   .0049067    -0.22   0.826    -.0107181    .0085625
      dummy_educ_hh |  -.0041922   .0012892    -3.25   0.001    -.0067252   -.0016592
 dummy_ethnicity_hh |   -.004439   .0012752    -3.48   0.001    -.0069445   -.0019335
       dummy_age_sp |   .0086897   .0018358     4.73   0.000     .0050829    .0122966
      dummy_educ_sp |  -.0087565   .0014866    -5.89   0.000    -.0116772   -.0058358
   dummy_dage0_7_97 |    .001454   .0024546     0.59   0.554    -.0033685    .0062765
  dummy_dirtfloor97 |   .0195614    .017112     1.14   0.254    -.0140589    .0531818
dummy_electricity97 |  -.0030713   .0018121    -1.69   0.091    -.0066315    .0004889
              _cons |  -.0082476   .0090069    -0.92   0.360    -.0259436    .0094484
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.27
            Prob > F =    0.7608

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .76077327

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =       2.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0029
                                                Root MSE          =      .0551

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               food |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0006867   .0007085     0.97   0.333    -.0007053    .0020786
              wave3 |  -.0031032   .0008455    -3.67   0.000    -.0047643   -.0014422
              wave4 |  -.0040647   .0007698    -5.28   0.000    -.0055772   -.0025523
           nbani197 |  -.0003105   .0003265    -0.95   0.342    -.0009519    .0003309
           nbani297 |  -.0002934   .0001526    -1.92   0.055    -.0005932    6.35e-06
               ha97 |   .0000291   .0001653     0.18   0.860    -.0002957    .0003539
              no497 |  -.0011987   .0008783    -1.36   0.173    -.0029243    .0005269
             big497 |  -.0000919    .000992    -0.09   0.926    -.0020408    .0018571
             age_hh |   .0001193   .0002164     0.55   0.582    -.0003059    .0005445
            age_hh2 |  -8.33e-07   2.01e-06    -0.42   0.678    -4.77e-06    3.11e-06
          female_hh |   .0030166   .0019989     1.51   0.132    -.0009106    .0069438
           educ1_hh |  -.0018507   .0009422    -1.96   0.050    -.0037019    5.54e-07
       ethnicity_hh |  -.0024833   .0006911    -3.59   0.000    -.0038412   -.0011254
             age_sp |    .000125   .0002219     0.56   0.574     -.000311     .000561
            age_sp2 |  -1.11e-06   2.24e-06    -0.50   0.619    -5.51e-06    3.29e-06
           educ1_sp |  -.0003557   .0010626    -0.33   0.738    -.0024434    .0017321
         dage0_7_97 |   .0009437   .0010666     0.88   0.377    -.0011519    .0030394
        dage8_17_97 |   .0020866   .0008477     2.46   0.014     .0004211    .0037521
       dage18_54_97 |   .0002544   .0017411     0.15   0.884    -.0031663    .0036751
         dage55p_97 |  -.0007647    .000944    -0.81   0.418    -.0026194    .0010901
           hhsize97 |  -.0001756   .0001872    -0.94   0.349    -.0005433    .0001922
          homeown97 |  -.0000217   .0011876    -0.02   0.985    -.0023549    .0023115
        dirtfloor97 |  -.0010779   .0008471    -1.27   0.204    -.0027422    .0005865
      electricity97 |   .0003711   .0006565     0.57   0.572    -.0009188     .001661
         org_faenas |  -.0011851   .0011878    -1.00   0.319    -.0035188    .0011485
           min_dist |  -4.48e-06   8.59e-06    -0.52   0.602    -.0000214    .0000124
       lnup_cwagepm |   .0009051   .0003941     2.30   0.022     .0001309    .0016793
       up2_mcwagepm |   .0068793   .0026472     2.60   0.010     .0016782    .0120803
       dummy_age_hh |   .0014267   .0018063     0.79   0.430    -.0021223    .0049756
      dummy_educ_hh |   -.002802   .0006329    -4.43   0.000    -.0040455   -.0015585
 dummy_ethnicity_hh |  -.0022493   .0006469    -3.48   0.001    -.0035204   -.0009783
       dummy_age_sp |   .0042612    .001513     2.82   0.005     .0012887    .0072338
      dummy_educ_sp |  -.0030555   .0009227    -3.31   0.001    -.0048682   -.0012427
   dummy_dage0_7_97 |  -.0011878   .0022118    -0.54   0.592    -.0055334    .0031579
  dummy_dirtfloor97 |  -.0035124   .0009031    -3.89   0.000    -.0052867   -.0017382
dummy_electricity97 |  -.0012184   .0008806    -1.38   0.167    -.0029485    .0005118
              _cons |  -.0033245   .0050545    -0.66   0.511    -.0132553    .0066063
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        food |     12,490    .0026421    .0513356          0          1

added scalar:
               e(mean) =  .00264211

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =       2.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0030
                                                Root MSE          =      .0551

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               food |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |  -.0007838   .0014947    -0.52   0.600    -.0037204    .0021528
      t2_c1_opwave3 |   .0019793   .0008725     2.27   0.024      .000265    .0036936
      t2_c1_opwave4 |   .0009664   .0006887     1.40   0.161    -.0003867    .0023195
              wave3 |  -.0048333   .0012043    -4.01   0.000    -.0071994   -.0024671
              wave4 |  -.0051614   .0011436    -4.51   0.000    -.0074082   -.0029147
           nbani197 |    -.00031   .0003265    -0.95   0.343    -.0009515    .0003315
           nbani297 |  -.0002937   .0001526    -1.92   0.055    -.0005934    6.07e-06
               ha97 |   .0000293   .0001653     0.18   0.859    -.0002955    .0003541
              no497 |  -.0011984   .0008783    -1.36   0.173    -.0029241    .0005273
             big497 |  -.0000932   .0009916    -0.09   0.925    -.0020414    .0018551
             age_hh |     .00012   .0002164     0.55   0.579    -.0003052    .0005453
            age_hh2 |  -8.38e-07   2.01e-06    -0.42   0.676    -4.78e-06    3.10e-06
          female_hh |   .0030121   .0019981     1.51   0.132    -.0009136    .0069379
           educ1_hh |  -.0018531   .0009418    -1.97   0.050    -.0037035   -2.61e-06
       ethnicity_hh |   -.002478   .0006909    -3.59   0.000    -.0038354   -.0011206
             age_sp |   .0001246   .0002218     0.56   0.574    -.0003112    .0005604
            age_sp2 |  -1.11e-06   2.24e-06    -0.50   0.620    -5.51e-06    3.29e-06
           educ1_sp |  -.0003563   .0010627    -0.34   0.738    -.0024442    .0017317
         dage0_7_97 |   .0009458   .0010664     0.89   0.376    -.0011495     .003041
        dage8_17_97 |   .0020863   .0008474     2.46   0.014     .0004213    .0037512
       dage18_54_97 |   .0002499   .0017411     0.14   0.886    -.0031709    .0036708
         dage55p_97 |  -.0007669   .0009441    -0.81   0.417    -.0026218     .001088
           hhsize97 |  -.0001756   .0001872    -0.94   0.349    -.0005433    .0001922
          homeown97 |  -.0000239   .0011877    -0.02   0.984    -.0023573    .0023095
        dirtfloor97 |  -.0010742   .0008466    -1.27   0.205    -.0027376    .0005892
      electricity97 |   .0003667   .0006566     0.56   0.577    -.0009234    .0016568
         org_faenas |  -.0011879   .0011875    -1.00   0.318    -.0035211    .0011453
           min_dist |  -4.43e-06   8.60e-06    -0.51   0.607    -.0000213    .0000125
       lnup_cwagepm |   .0009266   .0003907     2.37   0.018     .0001589    .0016943
       up2_mcwagepm |   .0070513   .0026096     2.70   0.007     .0019243    .0121784
       dummy_age_hh |   .0013712   .0018109     0.76   0.449    -.0021868    .0049291
      dummy_educ_hh |  -.0028195   .0006324    -4.46   0.000    -.0040619   -.0015771
 dummy_ethnicity_hh |  -.0022182   .0006475    -3.43   0.001    -.0034904   -.0009459
       dummy_age_sp |   .0042283   .0015099     2.80   0.005     .0012617    .0071948
      dummy_educ_sp |  -.0030154   .0009143    -3.30   0.001    -.0048119    -.001219
   dummy_dage0_7_97 |   -.001212   .0022114    -0.55   0.584    -.0055567    .0031327
  dummy_dirtfloor97 |  -.0034964   .0009015    -3.88   0.000    -.0052676   -.0017253
dummy_electricity97 |  -.0012282   .0008765    -1.40   0.162    -.0029503    .0004939
              _cons |   -.002551   .0051842    -0.49   0.623    -.0127365    .0076346
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    1.42
            Prob > F =    0.2435

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .2435488

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =       0.14
                                                Prob > F          =     1.0000
                                                R-squared         =     0.0010
                                                Root MSE          =     .01099

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             repair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   -.000067    .000127    -0.53   0.598    -.0003166    .0001826
              wave3 |   .0003616   .0001799     2.01   0.045     8.09e-06    .0007151
              wave4 |  -8.76e-06   8.22e-06    -1.07   0.287    -.0000249    7.38e-06
           nbani197 |   -.000027   .0000189    -1.43   0.153    -.0000641    .0000101
           nbani297 |   -.000015   .0000111    -1.35   0.178    -.0000369    6.85e-06
               ha97 |   2.39e-06   .0000223     0.11   0.915    -.0000415    .0000463
              no497 |   .0005577   .0004415     1.26   0.207    -.0003098    .0014251
             big497 |  -.0001404   .0001083    -1.30   0.196    -.0003532    .0000724
             age_hh |   1.30e-06   .0000413     0.03   0.975    -.0000798    .0000824
            age_hh2 |  -6.50e-08   3.52e-07    -0.18   0.853    -7.56e-07    6.26e-07
          female_hh |  -5.13e-07   .0000417    -0.01   0.990    -.0000824    .0000813
           educ1_hh |  -.0001695   .0002563    -0.66   0.509     -.000673    .0003341
       ethnicity_hh |   .0001261   .0001335     0.94   0.346    -.0001363    .0003884
             age_sp |   .0000696    .000054     1.29   0.198    -.0000364    .0001757
            age_sp2 |  -6.40e-07   4.93e-07    -1.30   0.195    -1.61e-06    3.28e-07
           educ1_sp |    -.00023     .00026    -0.88   0.377    -.0007407    .0002808
         dage0_7_97 |   .0001954    .000123     1.59   0.113    -.0000463     .000437
        dage8_17_97 |  -.0002269   .0002229    -1.02   0.309    -.0006649    .0002112
       dage18_54_97 |   .0001256   .0001489     0.84   0.400     -.000167    .0004182
         dage55p_97 |   .0003041    .000246     1.24   0.217    -.0001793    .0007875
           hhsize97 |   .0000135   .0000401     0.34   0.736    -.0000653    .0000924
          homeown97 |   .0002671   .0001531     1.74   0.082    -.0000338    .0005679
        dirtfloor97 |  -.0001436   .0001804    -0.80   0.426    -.0004981    .0002109
      electricity97 |   2.75e-06   .0000945     0.03   0.977     -.000183    .0001885
         org_faenas |   .0001833   .0001016     1.80   0.072    -.0000164    .0003829
           min_dist |  -1.13e-06   8.80e-07    -1.29   0.198    -2.86e-06    5.95e-07
       lnup_cwagepm |   .0000834   .0000859     0.97   0.332    -.0000855    .0002523
       up2_mcwagepm |   .0004828   .0005607     0.86   0.390    -.0006187    .0015844
       dummy_age_hh |   .0001927   .0002053     0.94   0.348    -.0002106     .000596
      dummy_educ_hh |  -.0001669   .0001038    -1.61   0.108    -.0003707     .000037
 dummy_ethnicity_hh |  -1.13e-06   .0000667    -0.02   0.986    -.0001322    .0001299
       dummy_age_sp |   .0000787   .0000891     0.88   0.377    -.0000962    .0002537
      dummy_educ_sp |  -.0001367   .0000854    -1.60   0.110    -.0003045    .0000311
   dummy_dage0_7_97 |  -.0000298     .00018    -0.17   0.869    -.0003834    .0003238
  dummy_dirtfloor97 |  -.0002769   .0001845    -1.50   0.134    -.0006393    .0000856
dummy_electricity97 |  -.0002751    .000245    -1.12   0.262    -.0007565    .0002063
              _cons |  -.0022149   .0013259    -1.67   0.095    -.0048199      .00039
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      repair |     12,490    .0001601    .0126537          0          1

added scalar:
               e(mean) =  .00016013

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =       0.14
                                                Prob > F          =     1.0000
                                                R-squared         =     0.0010
                                                Root MSE          =     .01099

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             repair |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |  -1.46e-07   .0000179    -0.01   0.994    -.0000354    .0000351
      t2_c1_opwave3 |  -.0001997   .0003953    -0.51   0.614    -.0009764    .0005771
      t2_c1_opwave4 |  -3.54e-06   .0000191    -0.19   0.853    -.0000411     .000034
              wave3 |   .0004867   .0003408     1.43   0.154    -.0001828    .0011563
              wave4 |  -8.39e-06   8.74e-06    -0.96   0.337    -.0000256    8.78e-06
           nbani197 |   -.000027   .0000189    -1.43   0.154    -.0000641    .0000102
           nbani297 |   -.000015   .0000112    -1.33   0.183     -.000037    7.07e-06
               ha97 |   2.37e-06   .0000223     0.11   0.916    -.0000415    .0000463
              no497 |   .0005578   .0004417     1.26   0.207      -.00031    .0014256
             big497 |  -.0001401   .0001085    -1.29   0.197    -.0003533    .0000731
             age_hh |   1.18e-06   .0000411     0.03   0.977    -.0000796     .000082
            age_hh2 |  -6.39e-08   3.50e-07    -0.18   0.855    -7.52e-07    6.24e-07
          female_hh |  -3.33e-07   .0000415    -0.01   0.994    -.0000819    .0000812
           educ1_hh |  -.0001691   .0002561    -0.66   0.510    -.0006723    .0003342
       ethnicity_hh |   .0001251   .0001336     0.94   0.349    -.0001374    .0003876
             age_sp |   .0000697   .0000539     1.29   0.196    -.0000362    .0001756
            age_sp2 |  -6.41e-07   4.92e-07    -1.30   0.193    -1.61e-06    3.25e-07
           educ1_sp |  -.0002299   .0002599    -0.88   0.377    -.0007406    .0002809
         dage0_7_97 |   .0001953    .000123     1.59   0.113    -.0000464     .000437
        dage8_17_97 |   -.000227   .0002231    -1.02   0.310    -.0006653    .0002114
       dage18_54_97 |   .0001262   .0001499     0.84   0.400    -.0001683    .0004207
         dage55p_97 |   .0003044   .0002459     1.24   0.216    -.0001787    .0007876
           hhsize97 |   .0000135   .0000401     0.34   0.737    -.0000653    .0000923
          homeown97 |    .000267    .000153     1.75   0.082    -.0000335    .0005675
        dirtfloor97 |   -.000144   .0001798    -0.80   0.424    -.0004973    .0002094
      electricity97 |   3.78e-06   .0000939     0.04   0.968    -.0001807    .0001882
         org_faenas |   .0001832   .0001016     1.80   0.072    -.0000163    .0003828
           min_dist |  -1.13e-06   8.68e-07    -1.30   0.195    -2.83e-06    5.80e-07
       lnup_cwagepm |   .0000812   .0000875     0.93   0.354    -.0000907    .0002531
       up2_mcwagepm |   .0004855   .0005561     0.87   0.383     -.000607     .001578
       dummy_age_hh |   .0001825   .0002099     0.87   0.385    -.0002299    .0005948
      dummy_educ_hh |  -.0001656   .0001034    -1.60   0.110    -.0003688    .0000376
 dummy_ethnicity_hh |  -3.91e-06   .0000683    -0.06   0.954    -.0001381    .0001303
       dummy_age_sp |   .0000786   .0000894     0.88   0.379     -.000097    .0002542
      dummy_educ_sp |  -.0001372   .0000858    -1.60   0.110    -.0003058    .0000313
   dummy_dage0_7_97 |  -.0000305   .0001808    -0.17   0.866    -.0003856    .0003247
  dummy_dirtfloor97 |  -.0002787   .0001834    -1.52   0.129     -.000639    .0000817
dummy_electricity97 |  -.0002771   .0002473    -1.12   0.263     -.000763    .0002088
              _cons |  -.0022437   .0013381    -1.68   0.094    -.0048728    .0003854
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.17
            Prob > F =    0.8447

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .84470928

Linear regression                               Number of obs     =     33,103
                                                F(36, 500)        =       3.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0137
                                                Root MSE          =     .14145

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              other |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    .006943   .0041442     1.68   0.094    -.0011991    .0150852
              wave3 |  -.0027845    .006303    -0.44   0.659    -.0151681    .0095991
              wave4 |  -.0234948   .0031856    -7.38   0.000    -.0297537   -.0172359
           nbani197 |   .0021467   .0013499     1.59   0.112    -.0005054    .0047988
           nbani297 |   .0018246   .0006849     2.66   0.008      .000479    .0031702
               ha97 |   .0015305   .0009925     1.54   0.124    -.0004195    .0034806
              no497 |    .001134   .0039854     0.28   0.776    -.0066962    .0089641
             big497 |   .0007693   .0044839     0.17   0.864    -.0080402    .0095788
             age_hh |   .0005151   .0004351     1.18   0.237    -.0003397    .0013699
            age_hh2 |  -4.01e-06   4.25e-06    -0.94   0.346    -.0000124    4.33e-06
          female_hh |   .0007358   .0042343     0.17   0.862    -.0075835     .009055
           educ1_hh |   .0036168   .0026801     1.35   0.178    -.0016489    .0088825
       ethnicity_hh |  -.0062906    .002817    -2.23   0.026    -.0118251    -.000756
             age_sp |   .0001576   .0004196     0.38   0.707    -.0006668     .000982
            age_sp2 |  -6.35e-07   4.65e-06    -0.14   0.891    -9.77e-06    8.50e-06
           educ1_sp |  -.0003707   .0024221    -0.15   0.878    -.0051294     .004388
         dage0_7_97 |   .0038207   .0024942     1.53   0.126    -.0010798    .0087211
        dage8_17_97 |    .001065   .0021921     0.49   0.627    -.0032419    .0053718
       dage18_54_97 |  -.0087148   .0047823    -1.82   0.069    -.0181106     .000681
         dage55p_97 |  -.0019094     .00233    -0.82   0.413    -.0064872    .0026684
           hhsize97 |  -.0005324   .0004391    -1.21   0.226    -.0013952    .0003303
          homeown97 |   .0032001   .0030262     1.06   0.291    -.0027454    .0091457
        dirtfloor97 |   .0020587   .0024461     0.84   0.400    -.0027472    .0068646
      electricity97 |   .0063382   .0031547     2.01   0.045     .0001401    .0125362
         org_faenas |  -.0236353   .0156226    -1.51   0.131    -.0543294    .0070587
           min_dist |   -.000014   .0000318    -0.44   0.660    -.0000764    .0000484
       lnup_cwagepm |   .0045617   .0027752     1.64   0.101    -.0008909    .0100142
       up2_mcwagepm |    .031289    .016261     1.92   0.055    -.0006593    .0632372
       dummy_age_hh |  -.0353668   .0175393    -2.02   0.044    -.0698265    -.000907
      dummy_educ_hh |   .0189245   .0179054     1.06   0.291    -.0162547    .0541036
 dummy_ethnicity_hh |   .0091139   .0218676     0.42   0.677    -.0338499    .0520777
       dummy_age_sp |   .0026129   .0080113     0.33   0.744    -.0131271    .0183528
      dummy_educ_sp |  -.0000818   .0075658    -0.01   0.991    -.0149465    .0147829
   dummy_dage0_7_97 |  -.0190519   .0067184    -2.84   0.005    -.0322516   -.0058521
  dummy_dirtfloor97 |   .0170444   .0246794     0.69   0.490    -.0314438    .0655325
dummy_electricity97 |  -.0090702    .003691    -2.46   0.014    -.0163219   -.0018185
              _cons |  -.0061741   .0256652    -0.24   0.810     -.056599    .0442508
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       other |     12,490    .0167334    .1282759          0          1

added scalar:
               e(mean) =  .01673339

Linear regression                               Number of obs     =     33,103
                                                F(38, 500)        =       3.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0139
                                                Root MSE          =     .14144

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              other |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      t2_c1_opwave2 |   .0071797   .0055552     1.29   0.197    -.0037347    .0180941
      t2_c1_opwave3 |   .0113547   .0103426     1.10   0.273    -.0089655     .031675
      t2_c1_opwave4 |   .0021354   .0020425     1.05   0.296    -.0018777    .0061484
              wave3 |  -.0054115   .0058007    -0.93   0.351    -.0168082    .0059852
              wave4 |  -.0202236   .0046599    -4.34   0.000    -.0293791   -.0110682
           nbani197 |   .0021441   .0013499     1.59   0.113    -.0005081    .0047963
           nbani297 |   .0018207   .0006855     2.66   0.008     .0004738    .0031676
               ha97 |   .0015312   .0009922     1.54   0.123    -.0004182    .0034807
              no497 |   .0011259   .0039795     0.28   0.777    -.0066926    .0089445
             big497 |   .0007549    .004484     0.17   0.866    -.0080548    .0095647
             age_hh |   .0005206   .0004367     1.19   0.234    -.0003374    .0013787
            age_hh2 |  -4.06e-06   4.26e-06    -0.95   0.342    -.0000124    4.32e-06
          female_hh |   .0007379    .004236     0.17   0.862    -.0075846    .0090604
           educ1_hh |   .0035985   .0026715     1.35   0.179    -.0016502    .0088472
       ethnicity_hh |  -.0062473   .0028043    -2.23   0.026     -.011757   -.0007376
             age_sp |   .0001517   .0004194     0.36   0.718    -.0006723    .0009757
            age_sp2 |  -5.69e-07   4.65e-06    -0.12   0.903    -9.71e-06    8.57e-06
           educ1_sp |   -.000375   .0024202    -0.15   0.877    -.0051299      .00438
         dage0_7_97 |   .0038176   .0024942     1.53   0.127    -.0010828    .0087181
        dage8_17_97 |   .0010733    .002189     0.49   0.624    -.0032274     .005374
       dage18_54_97 |  -.0087409   .0047919    -1.82   0.069    -.0181557    .0006739
         dage55p_97 |  -.0019236   .0023318    -0.82   0.410     -.006505    .0026578
           hhsize97 |  -.0005294   .0004396    -1.20   0.229    -.0013931    .0003344
          homeown97 |   .0032137   .0030285     1.06   0.289    -.0027365    .0091639
        dirtfloor97 |   .0020712   .0024452     0.85   0.397     -.002733    .0068753
      electricity97 |   .0062873   .0031142     2.02   0.044     .0001689    .0124057
         org_faenas |  -.0236245   .0156116    -1.51   0.131    -.0542969     .007048
           min_dist |  -.0000147   .0000317    -0.46   0.643     -.000077    .0000476
       lnup_cwagepm |   .0046336   .0026944     1.72   0.086    -.0006601    .0099273
       up2_mcwagepm |   .0306054   .0163303     1.87   0.061     -.001479    .0626898
       dummy_age_hh |  -.0345617   .0173396    -1.99   0.047    -.0686292   -.0004941
      dummy_educ_hh |   .0188974    .017908     1.06   0.292    -.0162867    .0540816
 dummy_ethnicity_hh |   .0091936   .0218454     0.42   0.674    -.0337265    .0521137
       dummy_age_sp |   .0027203   .0080047     0.34   0.734    -.0130068    .0184474
      dummy_educ_sp |   -.000172   .0075685    -0.02   0.982    -.0150419    .0146979
   dummy_dage0_7_97 |  -.0189355   .0066967    -2.83   0.005    -.0320927   -.0057784
  dummy_dirtfloor97 |   .0171086   .0247467     0.69   0.490    -.0315116    .0657288
dummy_electricity97 |  -.0089175   .0037577    -2.37   0.018    -.0163002   -.0015347
              _cons |  -.0066979   .0267358    -0.25   0.802    -.0592262    .0458305
-------------------------------------------------------------------------------------

 ( 1)  t2_c1_opwave2 - t2_c1_opwave3 = 0
 ( 2)  t2_c1_opwave2 - t2_c1_opwave4 = 0

       F(  2,   500) =    0.60
            Prob > F =    0.5510

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .55103168

. ***Output for Table 3;
. estout me2_pc crafts_pc const_pc sewing_pc food_pc repair_pc other_pc
>         using "$out_p/main.text", stats(N mean, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ME by Type -- ITT Eligibles) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/main.text)

. estout me2_pc_pvalue crafts_pc_pvalue const_pc_pvalue sewing_pc_pvalue food_pc_pvalue repair_pc_pvalue other_pc_pvalue 
>         using "$out_p/time.text", stats(N mean pvalue, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_opwave2 t2_c1_opwave3 t2_c1_opwave4) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(Me by Type -- ITT Eligibles) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/time.text)

. estimates clear;

. *===========================================================================
> Regressions: Agricultural Assets & Micro-Enterprise Activity -- Table A6
>                          Waves 2, 3, 4 pooled (add test that we can pool) & ITT & controls (Unconditional and Conditional)
> *===========================================================================;
. preserve;

. keep if ineligible ==1;
(53,796 observations deleted)

. ***Agricultural Assets & Micro-Enterprises: Ineligibles, Unconditional -- Table A6, Panel 1;
. foreach x of global dep_all_in {;
  2. foreach y of global treatcom2 {;
  3.         reg `x' `y' wave3 wave4 $basic $controls, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         est store `x'_pc, title (`x');
  8.         reg `x' `y'wave2 `y'wave3 `y'wave4 wave3 wave4 $basic $controls, cl(comuid);
  9.         test `y'wave2 = `y'wave3 = `y'wave4;
 10.         scalar mean =r(mean);
 11.         estadd scalar mean;
 12.         scalar pvalue =r(p);
 13.         estadd scalar pvalue;
 14.         est store `x'_pc_pvalue, title (`x');
 15. };
 16. };

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1782
                                                Root MSE          =       .438

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0125361   .0199874     0.63   0.531    -.0267461    .0518182
              wave3 |  -.0258316   .0089938    -2.87   0.004    -.0435075   -.0081557
              wave4 |   .0110442    .010514     1.05   0.294    -.0096195    .0317079
           nbani197 |   .0716192   .0104378     6.86   0.000     .0511054     .092133
           nbani297 |   .0112455   .0017651     6.37   0.000     .0077764    .0147145
               ha97 |   .0022312   .0021738     1.03   0.305     -.002041    .0065035
              no497 |  -.1473492   .0159848    -9.22   0.000    -.1787648   -.1159336
             big497 |   .0714652   .0195279     3.66   0.000     .0330861    .1098444
             age_hh |   .0037527   .0033879     1.11   0.269    -.0029057     .010411
            age_hh2 |  -.0000387   .0000303    -1.28   0.202    -.0000983    .0000209
          female_hh |  -.0784078    .019009    -4.12   0.000    -.1157671   -.0410485
           educ1_hh |   .0518447   .0154128     3.36   0.001     .0215531    .0821363
       ethnicity_hh |  -.1001774   .0199127    -5.03   0.000    -.1393127   -.0610421
             age_sp |   .0041478   .0035162     1.18   0.239    -.0027627    .0110584
            age_sp2 |  -.0000168   .0000358    -0.47   0.639    -.0000873    .0000536
           educ1_sp |   .0573571   .0171657     3.34   0.001     .0236206    .0910936
         dage0_7_97 |  -.0042019   .0146819    -0.29   0.775    -.0330568    .0246531
        dage8_17_97 |    .024302   .0145052     1.68   0.095    -.0042058    .0528097
       dage18_54_97 |   .0269823   .0169234     1.59   0.112     -.006278    .0602426
         dage55p_97 |   .0188921   .0149124     1.27   0.206     -.010416    .0482002
           hhsize97 |   .0058035   .0031744     1.83   0.068    -.0004353    .0120424
          homeown97 |   .0130492   .0201438     0.65   0.517    -.0265403    .0526387
        dirtfloor97 |   .0139256   .0122017     1.14   0.254     -.010055    .0379061
      electricity97 |  -.0169094   .0202733    -0.83   0.405    -.0567534    .0229346
         org_faenas |  -.0153546   .0292601    -0.52   0.600    -.0728609    .0421516
           min_dist |  -.0004446   .0002575    -1.73   0.085    -.0009506    .0000614
       lnup_cwagepm |   .0444143   .0176448     2.52   0.012     .0097362    .0790924
       up2_mcwagepm |   .2159917   .1136426     1.90   0.058    -.0073552    .4393387
       dummy_age_hh |   .0169043   .2034306     0.08   0.934    -.3829072    .4167158
      dummy_educ_hh |  -.0210125   .0667936    -0.31   0.753     -.152285    .1102601
 dummy_ethnicity_hh |   .0484807   .0805176     0.60   0.547    -.1097642    .2067255
       dummy_age_sp |  -.0769745   .0473435    -1.63   0.105    -.1700209    .0160719
      dummy_educ_sp |   .0406018   .0463674     0.88   0.382    -.0505261    .1317297
   dummy_dage0_7_97 |   .3156071   .1711498     1.84   0.066    -.0207614    .6519757
  dummy_dirtfloor97 |  -.0468583   .0993277    -0.47   0.637    -.2420716    .1483551
dummy_electricity97 |   .1013579   .0325194     3.12   0.002      .037446    .1652697
              _cons |   -.312866    .133569    -2.34   0.020    -.5753753   -.0503566
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |      5,282    .3612268    .4804016          0          1

added scalar:
               e(mean) =  .36122681

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1782
                                                Root MSE          =     .43802

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |    .022249   .0224341     0.99   0.322    -.0218419    .0663398
      treatcomwave3 |   .0046724   .0224593     0.21   0.835     -.039468    .0488127
      treatcomwave4 |   .0096625   .0236436     0.41   0.683    -.0368054    .0561304
              wave3 |  -.0151071   .0139994    -1.08   0.281    -.0426207    .0124065
              wave4 |   .0187476    .015968     1.17   0.241     -.012635    .0501303
           nbani197 |    .071605   .0104378     6.86   0.000     .0510911     .092119
           nbani297 |   .0112404   .0017667     6.36   0.000     .0077683    .0147125
               ha97 |   .0022387   .0021751     1.03   0.304    -.0020362    .0065136
              no497 |  -.1472246   .0159809    -9.21   0.000    -.1786325   -.1158167
             big497 |   .0714737   .0195275     3.66   0.000     .0330955     .109852
             age_hh |   .0037489   .0033881     1.11   0.269    -.0029099    .0104076
            age_hh2 |  -.0000387   .0000303    -1.28   0.203    -.0000983    .0000209
          female_hh |   -.078426   .0190058    -4.13   0.000    -.1157789   -.0410732
           educ1_hh |   .0518064   .0154107     3.36   0.001      .021519    .0820938
       ethnicity_hh |  -.1002428   .0199089    -5.04   0.000    -.1393707   -.0611149
             age_sp |   .0041512   .0035171     1.18   0.239    -.0027611    .0110635
            age_sp2 |  -.0000169   .0000358    -0.47   0.638    -.0000873    .0000536
           educ1_sp |   .0574386   .0171758     3.34   0.001     .0236822    .0911949
         dage0_7_97 |  -.0042124   .0146787    -0.29   0.774    -.0330612    .0246364
        dage8_17_97 |   .0243078   .0145097     1.68   0.095    -.0042088    .0528243
       dage18_54_97 |   .0269827   .0169268     1.59   0.112    -.0062843    .0602496
         dage55p_97 |   .0188821   .0149144     1.27   0.206      -.01043    .0481941
           hhsize97 |   .0057989   .0031754     1.83   0.068    -.0004418    .0120397
          homeown97 |   .0130383   .0201434     0.65   0.518    -.0265505     .052627
        dirtfloor97 |   .0139736    .012204     1.15   0.253    -.0100114    .0379587
      electricity97 |  -.0169495    .020269    -0.84   0.403    -.0567851     .022886
         org_faenas |  -.0153779   .0292717    -0.53   0.600    -.0729069    .0421511
           min_dist |  -.0004453   .0002576    -1.73   0.085    -.0009516    .0000611
       lnup_cwagepm |   .0445474   .0177447     2.51   0.012     .0096729     .079422
       up2_mcwagepm |    .216496     .11404     1.90   0.058     -.007632     .440624
       dummy_age_hh |   .0175204   .2035784     0.09   0.931    -.3825815    .4176223
      dummy_educ_hh |  -.0211017   .0668184    -0.32   0.752    -.1524229    .1102195
 dummy_ethnicity_hh |   .0484128    .080546     0.60   0.548     -.109888    .2067136
       dummy_age_sp |  -.0768687   .0473671    -1.62   0.105    -.1699614     .016224
      dummy_educ_sp |   .0404633   .0464087     0.87   0.384    -.0507458    .1316723
   dummy_dage0_7_97 |   .3156967   .1706527     1.85   0.065    -.0196948    .6510881
  dummy_dirtfloor97 |  -.0468913   .0993561    -0.47   0.637    -.2421602    .1483777
dummy_electricity97 |   .1015884    .032529     3.12   0.002     .0376577    .1655192
              _cons |  -.3195126   .1350244    -2.37   0.018    -.5848822    -.054143
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    0.53
            Prob > F =    0.5892

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .58918541

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0982
                                                Root MSE          =     .40561

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0059912   .0140199     0.43   0.669    -.0215627     .033545
              wave3 |  -.0156885   .0098538    -1.59   0.112    -.0350546    .0036776
              wave4 |   .0103171   .0103894     0.99   0.321    -.0101016    .0307358
           nbani197 |   .0121157   .0039287     3.08   0.002     .0043944     .019837
           nbani297 |   .0114331   .0011105    10.30   0.000     .0092506    .0136156
               ha97 |   .0005277    .001469     0.36   0.720    -.0023593    .0034147
              no497 |  -.3076957   .0218132   -14.11   0.000    -.3505662   -.2648251
             big497 |   .0011093   .0124669     0.09   0.929    -.0233926    .0256111
             age_hh |  -.0006622    .002955    -0.22   0.823    -.0064698    .0051455
            age_hh2 |   .0000136    .000026     0.52   0.601    -.0000374    .0000646
          female_hh |    .077546    .020154     3.85   0.000     .0379364    .1171556
           educ1_hh |  -.0066449   .0133767    -0.50   0.620    -.0329347    .0196449
       ethnicity_hh |  -.0162724   .0189778    -0.86   0.392    -.0535703    .0210255
             age_sp |   .0048985   .0031676     1.55   0.123     -.001327    .0111239
            age_sp2 |  -.0000436   .0000309    -1.41   0.160    -.0001043    .0000172
           educ1_sp |  -.0099548   .0147756    -0.67   0.501     -.038994    .0190844
         dage0_7_97 |   -.013248   .0115899    -1.14   0.254    -.0360263    .0095302
        dage8_17_97 |    .005627    .010205     0.55   0.582    -.0144293    .0256834
       dage18_54_97 |   .0108828   .0157326     0.69   0.489    -.0200371    .0418028
         dage55p_97 |   .0138485   .0116202     1.19   0.234    -.0089892    .0366863
           hhsize97 |   .0132733   .0022324     5.95   0.000     .0088857    .0176608
          homeown97 |  -.0160203   .0243756    -0.66   0.511    -.0639268    .0318862
        dirtfloor97 |   .0197132   .0104166     1.89   0.059     -.000759    .0401854
      electricity97 |   -.016987   .0155476    -1.09   0.275    -.0475434    .0135695
         org_faenas |    .046868   .0359203     1.30   0.193    -.0237278    .1174638
           min_dist |  -.0000898   .0001883    -0.48   0.634      -.00046    .0002803
       lnup_cwagepm |   .0385186   .0098035     3.93   0.000     .0192514    .0577858
       up2_mcwagepm |   .1749487   .0658368     2.66   0.008     .0455567    .3043408
       dummy_age_hh |   .1140264   .0844223     1.35   0.177    -.0518927    .2799455
      dummy_educ_hh |   .0865522   .0560568     1.54   0.123    -.0236187    .1967232
 dummy_ethnicity_hh |   .0229817   .0762829     0.30   0.763    -.1269407     .172904
       dummy_age_sp |  -.1474679   .0485953    -3.03   0.003    -.2429745   -.0519613
      dummy_educ_sp |   .0431538   .0449107     0.96   0.337    -.0451112    .1314189
   dummy_dage0_7_97 |  -.2953455   .2098294    -1.41   0.160    -.7077328    .1170417
  dummy_dirtfloor97 |   .1747063   .0343201     5.09   0.000     .1072554    .2421572
dummy_electricity97 |   .2556158   .0325411     7.86   0.000     .1916614    .3195703
              _cons |   .3082495   .1018133     3.03   0.003     .1081513    .5083478
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |      5,282    .7578569     .428421          0          1

added scalar:
               e(mean) =  .75785687

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0983
                                                Root MSE          =     .40562

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |  -.0016143    .017639    -0.09   0.927    -.0362812    .0330525
      treatcomwave3 |   .0020055   .0192134     0.10   0.917    -.0357555    .0397665
      treatcomwave4 |   .0183247   .0177764     1.03   0.303     -.016612    .0532615
              wave3 |  -.0178816   .0176678    -1.01   0.312     -.052605    .0168418
              wave4 |  -.0019669   .0147387    -0.13   0.894    -.0309335    .0269997
           nbani197 |   .0121089    .003929     3.08   0.002     .0043871    .0198307
           nbani297 |   .0114423   .0011113    10.30   0.000     .0092581    .0136265
               ha97 |   .0005225   .0014688     0.36   0.722    -.0023642    .0034092
              no497 |  -.3076327   .0218264   -14.09   0.000    -.3505291   -.2647362
             big497 |   .0011077   .0124683     0.09   0.929    -.0233969    .0256123
             age_hh |  -.0006593   .0029553    -0.22   0.824    -.0064674    .0051488
            age_hh2 |   .0000135    .000026     0.52   0.603    -.0000375    .0000645
          female_hh |   .0774911   .0201607     3.84   0.000     .0378685    .1171138
           educ1_hh |  -.0066189   .0133803    -0.49   0.621    -.0329159    .0196781
       ethnicity_hh |  -.0163245   .0189804    -0.86   0.390    -.0536275    .0209785
             age_sp |   .0048864    .003167     1.54   0.124    -.0013378    .0111106
            age_sp2 |  -.0000434   .0000309    -1.40   0.161    -.0001042    .0000173
           educ1_sp |  -.0099432   .0147772    -0.67   0.501    -.0389855    .0190991
         dage0_7_97 |  -.0132556   .0115914    -1.14   0.253    -.0360367    .0095255
        dage8_17_97 |   .0056142   .0102037     0.55   0.582    -.0144396    .0256679
       dage18_54_97 |   .0108292   .0157347     0.69   0.492     -.020095    .0417534
         dage55p_97 |   .0138388   .0116184     1.19   0.234    -.0089955     .036673
           hhsize97 |   .0132795   .0022336     5.95   0.000     .0088896    .0176694
          homeown97 |  -.0160182   .0243829    -0.66   0.512    -.0639391    .0319026
        dirtfloor97 |   .0196971   .0104231     1.89   0.059     -.000788    .0401821
      electricity97 |  -.0169376    .015536    -1.09   0.276    -.0474713     .013596
         org_faenas |   .0469809   .0359596     1.31   0.192    -.0236921     .117654
           min_dist |  -.0000887   .0001882    -0.47   0.638    -.0004587    .0002812
       lnup_cwagepm |   .0383719   .0095447     4.02   0.000     .0196132    .0571305
       up2_mcwagepm |   .1757251   .0641038     2.74   0.006      .049739    .3017112
       dummy_age_hh |   .1117627   .0835575     1.34   0.182    -.0524567    .2759821
      dummy_educ_hh |   .0865587   .0559708     1.55   0.123    -.0234433    .1965607
 dummy_ethnicity_hh |   .0227979   .0762652     0.30   0.765    -.1270895    .1726853
       dummy_age_sp |  -.1473486   .0485864    -3.03   0.003    -.2428376   -.0518596
      dummy_educ_sp |   .0430919   .0448962     0.96   0.338    -.0451446    .1313284
   dummy_dage0_7_97 |  -.2958581   .2094859    -1.41   0.159    -.7075703    .1158541
  dummy_dirtfloor97 |   .1747227   .0343212     5.09   0.000     .1072697    .2421756
dummy_electricity97 |   .2554952   .0325225     7.86   0.000     .1915772    .3194131
              _cons |   .3138091   .1013062     3.10   0.002     .1147074    .5129108
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    0.61
            Prob > F =    0.5465

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .54646841

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1694
                                                Root MSE          =     .43257

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0128206   .0174584     0.73   0.463    -.0214912    .0471324
              wave3 |    -.01859   .0116812    -1.59   0.112    -.0415476    .0043676
              wave4 |   .0493115   .0130932     3.77   0.000     .0235789     .075044
           nbani197 |   .0198497   .0046618     4.26   0.000     .0106877    .0290118
           nbani297 |   .0011009    .001217     0.90   0.366    -.0012909    .0034927
               ha97 |   .0070988   .0016988     4.18   0.000     .0037601    .0104374
              no497 |   -.270538   .0211089   -12.82   0.000    -.3120243   -.2290517
             big497 |   .1701529    .014677    11.59   0.000     .1413075    .1989983
             age_hh |   .0104207   .0030171     3.45   0.001     .0044911    .0163504
            age_hh2 |  -.0000773   .0000262    -2.95   0.003    -.0001287   -.0000258
          female_hh |  -.1083351    .019834    -5.46   0.000    -.1473157   -.0693546
           educ1_hh |   .0074447    .015333     0.49   0.628    -.0226899    .0375793
       ethnicity_hh |   .0440893   .0198109     2.23   0.027      .005154    .0830246
             age_sp |    .002685   .0029579     0.91   0.365    -.0031283    .0084982
            age_sp2 |  -.0000148   .0000297    -0.50   0.618    -.0000732    .0000435
           educ1_sp |   .0371525   .0163797     2.27   0.024     .0049607    .0693442
         dage0_7_97 |  -.0086414    .013233    -0.65   0.514    -.0346488    .0173661
        dage8_17_97 |   .0033394   .0119462     0.28   0.780     -.020139    .0268177
       dage18_54_97 |   .0219671   .0163363     1.34   0.179    -.0101394    .0540736
         dage55p_97 |   .0064598   .0136724     0.47   0.637    -.0204112    .0333308
           hhsize97 |   .0034558   .0028789     1.20   0.231    -.0022022    .0091139
          homeown97 |   .1093846   .0258319     4.23   0.000     .0586159    .1601533
        dirtfloor97 |   .0016723   .0110917     0.15   0.880    -.0201267    .0234712
      electricity97 |  -.0293815   .0199984    -1.47   0.142    -.0686852    .0099222
         org_faenas |   .0164217   .0259206     0.63   0.527    -.0345213    .0673647
           min_dist |    .000012   .0002096     0.06   0.954       -.0004     .000424
       lnup_cwagepm |   .0077456   .0162617     0.48   0.634    -.0242143    .0397054
       up2_mcwagepm |   .0707814   .1074927     0.66   0.511    -.1404788    .2820417
       dummy_age_hh |   .1025197    .099665     1.03   0.304    -.0933564    .2983959
      dummy_educ_hh |  -.0763025    .068101    -1.12   0.263    -.2101445    .0575394
 dummy_ethnicity_hh |   .2255079   .0527977     4.27   0.000     .1217421    .3292736
       dummy_age_sp |   .0105953   .0379095     0.28   0.780      -.06391    .0851007
      dummy_educ_sp |  -.0176229   .0378704    -0.47   0.642    -.0920512    .0568054
   dummy_dage0_7_97 |  -.0781582   .0938493    -0.83   0.405    -.2626046    .1062882
  dummy_dirtfloor97 |   .0806199   .0659621     1.22   0.222    -.0490184    .2102582
dummy_electricity97 |   .3049825   .0301688    10.11   0.000     .2456903    .3642747
              _cons |  -.0689495   .1276145    -0.54   0.589    -.3197561     .181857
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |      5,282    .6544869    .4755803          0          1

added scalar:
               e(mean) =  .65448694

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1695
                                                Root MSE          =     .43259

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   .0089254   .0222961     0.40   0.689    -.0348941     .052745
      treatcomwave3 |   .0056837   .0229167     0.25   0.804    -.0393556     .050723
      treatcomwave4 |    .024203   .0211815     1.14   0.254     -.017426     .065832
              wave3 |  -.0165962     .01687    -0.98   0.326    -.0497517    .0165593
              wave4 |   .0398793   .0175392     2.27   0.023     .0054087      .07435
           nbani197 |   .0198373   .0046613     4.26   0.000     .0106763    .0289983
           nbani297 |   .0011082   .0012165     0.91   0.363    -.0012826     .003499
               ha97 |   .0070964   .0017001     4.17   0.000      .003755    .0104378
              no497 |  -.2704251   .0210897   -12.82   0.000    -.3118735   -.2289766
             big497 |   .1701546   .0146775    11.59   0.000     .1413082     .199001
             age_hh |   .0104221   .0030167     3.45   0.001     .0044932     .016351
            age_hh2 |  -.0000773   .0000262    -2.95   0.003    -.0001288   -.0000259
          female_hh |   -.108398   .0198286    -5.47   0.000    -.1473681   -.0694279
           educ1_hh |    .007456   .0153376     0.49   0.627    -.0226876    .0375997
       ethnicity_hh |   .0440107   .0198099     2.22   0.027     .0050775    .0829439
             age_sp |    .002674   .0029567     0.90   0.366    -.0031369     .008485
            age_sp2 |  -.0000147   .0000297    -0.50   0.621     -.000073    .0000436
           educ1_sp |   .0371963   .0163801     2.27   0.024     .0050037    .0693889
         dage0_7_97 |  -.0086532   .0132336    -0.65   0.514    -.0346618    .0173555
        dage8_17_97 |   .0033286   .0119497     0.28   0.781    -.0201567    .0268138
       dage18_54_97 |   .0219128    .016328     1.34   0.180    -.0101773    .0540029
         dage55p_97 |   .0064459   .0136691     0.47   0.637    -.0204186    .0333104
           hhsize97 |   .0034604   .0028793     1.20   0.230    -.0021985    .0091193
          homeown97 |   .1093824   .0258177     4.24   0.000     .0586417    .1601231
        dirtfloor97 |   .0016748   .0110914     0.15   0.880    -.0201236    .0234732
      electricity97 |  -.0293473   .0200043    -1.47   0.143    -.0686626    .0099681
         org_faenas |   .0165271   .0259258     0.64   0.524     -.034426    .0674803
           min_dist |   .0000129   .0002097     0.06   0.951    -.0003992     .000425
       lnup_cwagepm |   .0076491   .0161114     0.47   0.635    -.0240155    .0393136
       up2_mcwagepm |   .0717675    .106261     0.68   0.500    -.1370722    .2806071
       dummy_age_hh |   .1004655   .0988367     1.02   0.310    -.0937828    .2947138
      dummy_educ_hh |  -.0763311   .0680906    -1.12   0.263    -.2101527    .0574905
 dummy_ethnicity_hh |   .2252947   .0528089     4.27   0.000      .121507    .3290824
       dummy_age_sp |    .010758   .0378958     0.28   0.777    -.0637204    .0852364
      dummy_educ_sp |  -.0177402   .0378532    -0.47   0.640    -.0921349    .0566544
   dummy_dage0_7_97 |   -.078643   .0936868    -0.84   0.402      -.26277     .105484
  dummy_dirtfloor97 |   .0806236   .0660152     1.22   0.223    -.0491191    .2103663
dummy_electricity97 |   .3049508   .0301759    10.11   0.000     .2456448    .3642568
              _cons |  -.0659238   .1266009    -0.52   0.603    -.3147383    .1828907
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    0.34
            Prob > F =    0.7154

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .71541449

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2246
                                                Root MSE          =     1188.8

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   54.60216   42.30058     1.29   0.197     -28.5331    137.7374
              wave3 |  -54.37702   22.46657    -2.42   0.016     -98.5316   -10.22244
              wave4 |  -27.11387   25.51435    -1.06   0.289    -77.25839    23.03066
           nbani197 |   362.6179   51.81422     7.00   0.000     260.7851    464.4508
           nbani297 |    20.0476   5.408169     3.71   0.000     9.418681    30.67652
               ha97 |   -7.38895   5.851512    -1.26   0.207    -18.88919    4.111293
              no497 |  -114.6998   27.96918    -4.10   0.000    -169.6689   -59.73066
             big497 |   226.6254    49.7475     4.56   0.000     128.8544    324.3964
             age_hh |   4.062615    7.71108     0.53   0.599    -11.09232    19.21755
            age_hh2 |   -.044581   .0763092    -0.58   0.559    -.1945549    .1053929
          female_hh |  -125.7139   45.87999    -2.74   0.006    -215.8839   -35.54386
           educ1_hh |   70.36825    30.1153     2.34   0.020     11.18127    129.5552
       ethnicity_hh |   -197.982   34.11412    -5.80   0.000    -265.0281    -130.936
             age_sp |   5.839344   8.536302     0.68   0.494    -10.93744    22.61613
            age_sp2 |  -.0129685   .0921511    -0.14   0.888    -.1940772    .1681402
           educ1_sp |   54.34997   38.35937     1.42   0.157    -21.03945    129.7394
         dage0_7_97 |   -91.2287   32.42044    -2.81   0.005    -154.9461   -27.51133
        dage8_17_97 |    17.3262   36.24186     0.48   0.633    -53.90157    88.55397
       dage18_54_97 |   65.95567   51.19012     1.29   0.198    -34.65062     166.562
         dage55p_97 |   24.73883   38.56094     0.64   0.521    -51.04675    100.5244
           hhsize97 |   15.06934   9.514046     1.58   0.114    -3.629049    33.76773
          homeown97 |   -2.93247    38.5473    -0.08   0.939    -78.69124     72.8263
        dirtfloor97 |   58.16965   32.57383     1.79   0.075    -5.849187    122.1885
      electricity97 |     87.303   35.58273     2.45   0.015     17.37064    157.2353
         org_faenas |  -28.81997   68.56728    -0.42   0.674    -163.5784    105.9384
           min_dist |  -1.793805   .5160478    -3.48   0.001    -2.808018   -.7795932
       lnup_cwagepm |   156.3804   33.16854     4.71   0.000     91.19276     221.568
       up2_mcwagepm |   879.1283   211.4465     4.16   0.000     463.5629    1294.694
       dummy_age_hh |   -99.2704   246.4454    -0.40   0.687    -583.6207    385.0799
      dummy_educ_hh |  -266.3786   93.45363    -2.85   0.005    -450.0473   -82.70991
 dummy_ethnicity_hh |   209.8881   395.9268     0.53   0.596    -568.2447     988.021
       dummy_age_sp |  -172.3425   91.24882    -1.89   0.060     -351.678    6.992919
      dummy_educ_sp |   137.4481   87.71021     1.57   0.118    -34.93275     309.829
   dummy_dage0_7_97 |   388.0381   236.9217     1.64   0.102    -77.59496    853.6712
  dummy_dirtfloor97 |  -208.3444   90.34017    -2.31   0.022     -385.894   -30.79474
dummy_electricity97 |   116.3572   57.83943     2.01   0.045     2.682761    230.0317
              _cons |   -1110.61   297.0178    -3.74   0.000    -1694.352   -526.8669
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |      5,282    554.8618    1243.163          0   19396.22

added scalar:
               e(mean) =  554.86176

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2247
                                                Root MSE          =     1188.9

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   92.18953   51.01667     1.81   0.071    -8.075862    192.4549
      treatcomwave3 |   42.50354   49.10499     0.87   0.387    -54.00474    139.0118
      treatcomwave4 |   25.25712   50.15495     0.50   0.615    -73.31468    123.8289
              wave3 |  -24.08914    32.6815    -0.74   0.461    -88.31958     40.1413
              wave4 |   13.99703   41.31724     0.34   0.735    -67.20563    95.19968
           nbani197 |   362.5954   51.81614     7.00   0.000     260.7588    464.4321
           nbani297 |   20.01849    5.41332     3.70   0.000     9.379448    30.65754
               ha97 |  -7.361151    5.85414    -1.26   0.209    -18.86656    4.144258
              no497 |  -114.5079   27.94618    -4.10   0.000    -169.4318   -59.58399
             big497 |   226.6492   49.75024     4.56   0.000     128.8727    324.4256
             age_hh |   4.048166   7.710362     0.53   0.600    -11.10536    19.20169
            age_hh2 |  -.0443588   .0763115    -0.58   0.561    -.1943373    .1056196
          female_hh |  -125.6595   45.89127    -2.74   0.006    -215.8517   -35.46735
           educ1_hh |   70.22726   30.10194     2.33   0.020     11.06654     129.388
       ethnicity_hh |  -198.0485     34.056    -5.82   0.000    -264.9803   -131.1167
             age_sp |   5.869401   8.537483     0.69   0.492     -10.9097    22.64851
            age_sp2 |  -.0133547   .0921576    -0.14   0.885    -.1944763    .1677669
           educ1_sp |   54.52906   38.34319     1.42   0.156    -20.82856    129.8867
         dage0_7_97 |  -91.24093   32.43041    -2.81   0.005    -154.9779   -27.50396
        dage8_17_97 |    17.3637   36.24762     0.48   0.632    -53.87541    88.60281
       dage18_54_97 |   66.05349   51.19206     1.29   0.198     -34.5566    166.6636
         dage55p_97 |   24.73199   38.56779     0.64   0.522    -51.06706     100.531
           hhsize97 |   15.04684   9.513617     1.58   0.114    -3.650707    33.74438
          homeown97 |   -2.96293   38.55772    -0.08   0.939    -78.74218    72.81632
        dirtfloor97 |   58.31682   32.58686     1.79   0.074    -5.727609    122.3613
      electricity97 |   87.11539   35.55007     2.45   0.015     17.24721    156.9836
         org_faenas |  -29.08116   68.51136    -0.42   0.671    -163.7297    105.5673
           min_dist |  -1.797478   .5163693    -3.48   0.001    -2.812322    -.782634
       lnup_cwagepm |   156.9724   33.08479     4.74   0.000     91.94933    221.9954
       up2_mcwagepm |    878.963   211.1218     4.16   0.000     464.0358     1293.89
       dummy_age_hh |   -93.6667   245.5069    -0.38   0.703    -576.1725    388.8391
      dummy_educ_hh |  -266.6092   93.48016    -2.85   0.005      -450.33   -82.88837
 dummy_ethnicity_hh |   210.0537   396.0174     0.53   0.596    -568.2573    988.3647
       dummy_age_sp |  -172.2984   91.24595    -1.89   0.060    -351.6282     7.03142
      dummy_educ_sp |     137.22   87.71509     1.56   0.118    -35.17047    309.6105
   dummy_dage0_7_97 |   389.1844   235.7136     1.65   0.099    -74.07427     852.443
  dummy_dirtfloor97 |   -208.455   90.44627    -2.30   0.022    -386.2132   -30.69682
dummy_electricity97 |   117.1413   57.93266     2.02   0.044     3.283583     230.999
              _cons |  -1136.973   298.8732    -3.80   0.000    -1724.362   -549.5837
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    0.94
            Prob > F =    0.3911

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .39114632

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2390
                                                Root MSE          =     4518.8

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   11.82088   180.5208     0.07   0.948    -342.9649    366.6066
              wave3 |  -126.4895     93.847    -1.35   0.178    -310.9313    57.95226
              wave4 |   42.80459   117.6368     0.36   0.716    -188.3925    274.0016
           nbani197 |   164.8869   73.44614     2.25   0.025     20.53986     309.234
           nbani297 |   524.9411   42.19507    12.44   0.000     442.0132     607.869
               ha97 |  -3.600295   31.72745    -0.11   0.910     -65.9557    58.75511
              no497 |   -509.368   98.93794    -5.15   0.000    -703.8152   -314.9207
             big497 |   338.3242   184.0496     1.84   0.067    -23.39686    700.0452
             age_hh |    69.0081   27.02801     2.55   0.011     15.88872    122.1275
            age_hh2 |  -.6134177   .2418554    -2.54   0.012    -1.088747   -.1380883
          female_hh |  -418.8217   178.9366    -2.34   0.020    -770.4939   -67.14957
           educ1_hh |   102.8346   149.0993     0.69   0.491     -190.197    395.8662
       ethnicity_hh |  -356.6169   266.8064    -1.34   0.182    -880.9836    167.7498
             age_sp |   17.78491   31.38989     0.57   0.571    -43.90708    79.47689
            age_sp2 |  -.1631204   .3249528    -0.50   0.616    -.8017649     .475524
           educ1_sp |   215.9056   154.1409     1.40   0.162    -87.03456    518.8458
         dage0_7_97 |  -78.35594     137.82    -0.57   0.570    -349.2198    192.5079
        dage8_17_97 |  -166.5105   123.9435    -1.34   0.180    -410.1023    77.08128
       dage18_54_97 |   323.2771   165.3203     1.96   0.051    -1.634454    648.1886
         dage55p_97 |   103.7183   182.8065     0.57   0.571    -255.5597    462.9963
           hhsize97 |   66.37503   31.92261     2.08   0.038     3.636078     129.114
          homeown97 |  -15.66976    162.418    -0.10   0.923    -334.8772    303.5377
        dirtfloor97 |  -718.6903   125.3306    -5.73   0.000    -965.0083   -472.3724
      electricity97 |   -56.4522   204.2877    -0.28   0.782    -457.9482    345.0438
         org_faenas |   96.52749   248.9661     0.39   0.698     -392.777     585.832
           min_dist |   3.101462   1.907257     1.63   0.105    -.6469576    6.849881
       lnup_cwagepm |   249.8802   150.4557     1.66   0.097    -45.81737    545.5777
       up2_mcwagepm |   767.5099   958.9455     0.80   0.424    -1117.149    2652.169
       dummy_age_hh |   1796.681   2024.658     0.89   0.375    -2182.472    5775.835
      dummy_educ_hh |  -892.2006   403.0668    -2.21   0.027    -1684.366   -100.0351
 dummy_ethnicity_hh |   6.134777   990.0367     0.01   0.995    -1939.629    1951.899
       dummy_age_sp |   186.2292   342.3603     0.54   0.587    -486.6272    859.0856
      dummy_educ_sp |  -177.5375   326.2849    -0.54   0.587       -818.8    463.7251
   dummy_dage0_7_97 |  -141.5758   600.0272    -0.24   0.814    -1320.837    1037.685
  dummy_dirtfloor97 |    898.799   1146.928     0.78   0.434    -1355.311    3152.909
dummy_electricity97 |  -794.1387    333.634    -2.38   0.018    -1449.845   -138.4326
              _cons |  -3396.755   1229.627    -2.76   0.006    -5813.397    -980.114
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |      5,282    2524.224    5151.423          0   51334.27

added scalar:
               e(mean) =  2524.2236

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2393
                                                Root MSE          =     4518.2

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |  -80.69189   222.8507    -0.36   0.717    -518.6705    357.2867
      treatcomwave3 |  -156.6185   206.9668    -0.76   0.450    -563.3799    250.1428
      treatcomwave4 |    281.098   217.8462     1.29   0.198     -147.045     709.241
              wave3 |   -79.7876   167.0088    -0.48   0.633    -408.0175    248.4423
              wave4 |  -180.5565   159.0338    -1.14   0.257    -493.1128    131.9999
           nbani197 |   164.5928   73.37506     2.24   0.025     20.38545    308.8001
           nbani297 |   525.1142   42.20234    12.44   0.000      442.172    608.0563
               ha97 |  -3.656644   31.72903    -0.12   0.908    -66.01515    58.70187
              no497 |  -506.7028   98.80457    -5.13   0.000    -700.8879   -312.5176
             big497 |   338.3643   184.1135     1.84   0.067    -23.48244     700.211
             age_hh |   69.04034     27.015     2.56   0.011     15.94653    122.1341
            age_hh2 |  -.6142434   .2417477    -2.54   0.011    -1.089361   -.1391256
          female_hh |  -420.3073   178.8585    -2.35   0.019    -771.8261   -68.78845
           educ1_hh |   103.1039      149.3     0.69   0.490    -190.3222    396.5299
       ethnicity_hh |  -358.4735   267.2288    -1.34   0.180    -883.6705    166.7235
             age_sp |   17.52605   31.38331     0.56   0.577      -44.153     79.2051
            age_sp2 |  -.1601505   .3248915    -0.49   0.622    -.7986746    .4783736
           educ1_sp |   216.9396   154.1335     1.41   0.160     -85.9861    519.8652
         dage0_7_97 |  -78.63483   137.8198    -0.57   0.569    -349.4983    192.2286
        dage8_17_97 |  -166.7655   123.9283    -1.35   0.179    -410.3274    76.79641
       dage18_54_97 |   321.9931   165.3127     1.95   0.052    -2.903517    646.8897
         dage55p_97 |   103.3912   182.7777     0.57   0.572    -255.8301    462.6125
           hhsize97 |   66.48211   31.91237     2.08   0.038     3.763274     129.201
          homeown97 |  -15.72063    162.428    -0.10   0.923    -334.9477    303.5064
        dirtfloor97 |  -718.6334   125.2958    -5.74   0.000    -964.8828   -472.3839
      electricity97 |  -55.64089   204.2332    -0.27   0.785    -457.0298     345.748
         org_faenas |    99.0213   249.5581     0.40   0.692    -391.4465    589.4891
           min_dist |   3.122284   1.907976     1.64   0.102    -.6275488    6.872117
       lnup_cwagepm |    247.593   149.2814     1.66   0.098     -45.7965    540.9825
       up2_mcwagepm |   790.8052   950.2253     0.83   0.406    -1076.716    2658.326
       dummy_age_hh |   1748.079    2005.22     0.87   0.384    -2192.872    5689.031
      dummy_educ_hh |  -892.8722   401.0453    -2.23   0.026    -1681.065   -104.6796
 dummy_ethnicity_hh |    1.09728   989.8954     0.00   0.999    -1944.389    1946.584
       dummy_age_sp |   190.0714   342.4558     0.56   0.579    -482.9726    863.1153
      dummy_educ_sp |  -180.3066    326.339    -0.55   0.581    -821.6754    461.0623
   dummy_dage0_7_97 |  -153.0433    592.157    -0.26   0.796    -1316.836     1010.75
  dummy_dirtfloor97 |   898.8871   1149.511     0.78   0.435    -1360.299    3158.073
dummy_electricity97 |  -794.8987   333.2607    -2.39   0.017    -1449.871   -139.9263
              _cons |   -3324.93   1226.846    -2.71   0.007    -5736.106   -913.7545
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    2.48
            Prob > F =    0.0848

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .08476142

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2355
                                                Root MSE          =     2.4902

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   -.060022   .1029013    -0.58   0.560    -.2622586    .1422147
              wave3 |   -.155002   .0708528    -2.19   0.029    -.2942522   -.0157518
              wave4 |   .1300721   .0816897     1.59   0.112    -.0304763    .2906206
           nbani197 |   .0456292   .0272587     1.67   0.095    -.0079436    .0992019
           nbani297 |    .026185   .0116399     2.25   0.025     .0033085    .0490614
               ha97 |   .2165142   .0243823     8.88   0.000     .1685946    .2644338
              no497 |  -.3830519   .0705178    -5.43   0.000    -.5216436   -.2444601
             big497 |   .7272392   .1152498     6.31   0.000     .5007335    .9537449
             age_hh |   .0463179   .0144991     3.19   0.002     .0178222    .0748137
            age_hh2 |  -.0002794   .0001295    -2.16   0.032    -.0005339   -.0000248
          female_hh |  -.3858927   .0994346    -3.88   0.000     -.581316   -.1904694
           educ1_hh |  -.0150585   .0735379    -0.20   0.838    -.1595858    .1294689
       ethnicity_hh |  -.2448624    .091512    -2.68   0.008    -.4247152   -.0650097
             age_sp |   .0149959    .018168     0.83   0.410    -.0207104    .0507023
            age_sp2 |  -.0001389   .0001787    -0.78   0.437    -.0004901    .0002123
           educ1_sp |   .0302078   .0837923     0.36   0.719     -.134473    .1948885
         dage0_7_97 |  -.0896875    .077501    -1.16   0.248    -.2420039    .0626288
        dage8_17_97 |  -.0441044   .0722652    -0.61   0.542    -.1861305    .0979216
       dage18_54_97 |   .0177444   .0919516     0.19   0.847    -.1629722     .198461
         dage55p_97 |  -.1999183   .0791424    -2.53   0.012    -.3554604   -.0443762
           hhsize97 |    .037403   .0179635     2.08   0.038     .0020984    .0727075
          homeown97 |   .1897169   .1059882     1.79   0.074    -.0185865    .3980203
        dirtfloor97 |  -.0921956   .0618704    -1.49   0.137    -.2137922    .0294011
      electricity97 |   .1465178   .0900006     1.63   0.104    -.0303644       .3234
         org_faenas |   .1802729   .1503964     1.20   0.231    -.1153079    .4758537
           min_dist |    .001325   .0011113     1.19   0.234    -.0008591    .0035091
       lnup_cwagepm |   .1855947   .0605302     3.07   0.002      .066632    .3045574
       up2_mcwagepm |   .7552871   .3897499     1.94   0.053    -.0107061     1.52128
       dummy_age_hh |  -.3614764   .2808816    -1.29   0.199    -.9135058    .1905531
      dummy_educ_hh |   -.285198    .264303    -1.08   0.281    -.8046447    .2342488
 dummy_ethnicity_hh |   .0644661   .2550924     0.25   0.801    -.4368787    .5658108
       dummy_age_sp |  -.2475888   .2022479    -1.22   0.222    -.6450758    .1498982
      dummy_educ_sp |   .1178373    .197747     0.60   0.552    -.2708039    .5064785
   dummy_dage0_7_97 |  -.0461568    .747671    -0.06   0.951    -1.515589    1.423275
  dummy_dirtfloor97 |    .051653   .4884576     0.11   0.916     -.908335    1.011641
dummy_electricity97 |   .0247314    .160034     0.15   0.877    -.2897907    .3392535
              _cons |  -2.605518   .5699304    -4.57   0.000    -3.725629   -1.485408
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |      5,282    2.104659    2.872788          0         20

added scalar:
               e(mean) =  2.1046592

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2355
                                                Root MSE          =     2.4904

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   -.058095   .1325576    -0.44   0.661    -.3186165    .2024266
      treatcomwave3 |   -.040564   .1221034    -0.33   0.740    -.2805394    .1994114
      treatcomwave4 |  -.0814864   .1448579    -0.56   0.574    -.3661822    .2032093
              wave3 |   -.165731   .1135035    -1.46   0.145    -.3888046    .0573426
              wave4 |   .1445555    .125359     1.15   0.249    -.1018183    .3909292
           nbani197 |   .0456634   .0272624     1.67   0.095    -.0079166    .0992434
           nbani297 |   .0261732   .0116432     2.25   0.025     .0032903    .0490561
               ha97 |   .2165144   .0243869     8.88   0.000     .1685856    .2644431
              no497 |  -.3833598   .0704039    -5.45   0.000    -.5217279   -.2449917
             big497 |   .7272304   .1152431     6.31   0.000      .500738    .9537229
             age_hh |   .0463175   .0144971     3.19   0.001     .0178257    .0748094
            age_hh2 |  -.0002793   .0001295    -2.16   0.032    -.0005338   -.0000248
          female_hh |   -.385753   .0994437    -3.88   0.000    -.5811942   -.1903118
           educ1_hh |  -.0150578   .0735507    -0.20   0.838    -.1596103    .1294946
       ethnicity_hh |  -.2446612   .0915102    -2.67   0.008    -.4245105   -.0648119
             age_sp |   .0150162     .01816     0.83   0.409    -.0206745    .0507069
            age_sp2 |  -.0001391   .0001786    -0.78   0.436    -.0004901    .0002119
           educ1_sp |   .0300676   .0836204     0.36   0.719    -.1342754    .1944106
         dage0_7_97 |  -.0896569    .077501    -1.16   0.248    -.2419732    .0626594
        dage8_17_97 |   -.044086   .0722593    -0.61   0.542    -.1861005    .0979284
       dage18_54_97 |   .0178551   .0919316     0.19   0.846    -.1628223    .1985325
         dage55p_97 |  -.1998838    .079161    -2.53   0.012    -.3554625   -.0443051
           hhsize97 |   .0373966   .0179556     2.08   0.038     .0021077    .0726855
          homeown97 |   .1897281   .1060138     1.79   0.074    -.0186256    .3980818
        dirtfloor97 |  -.0922305   .0618545    -1.49   0.137    -.2137959    .0293349
      electricity97 |   .1464728   .0900525     1.63   0.105    -.0305115    .3234571
         org_faenas |    .180072   .1503296     1.20   0.232    -.1153775    .4755215
           min_dist |   .0013236   .0011123     1.19   0.235    -.0008625    .0035098
       lnup_cwagepm |   .1857091   .0603061     3.08   0.002     .0671868    .3042315
       up2_mcwagepm |   .7529601   .3892897     1.93   0.054    -.0121286    1.518049
       dummy_age_hh |  -.3576631   .2811817    -1.27   0.204    -.9102823    .1949561
      dummy_educ_hh |  -.2850843   .2644457    -1.08   0.282    -.8048114    .2346428
 dummy_ethnicity_hh |   .0649435   .2548349     0.25   0.799    -.4358951    .5657821
       dummy_age_sp |  -.2479867   .2023034    -1.23   0.221    -.6455827    .1496094
      dummy_educ_sp |    .118163   .1978171     0.60   0.551    -.2706159    .5069418
   dummy_dage0_7_97 |  -.0452222   .7473652    -0.06   0.952    -1.514053    1.423609
  dummy_dirtfloor97 |   .0516659   .4886499     0.11   0.916    -.9087001    1.012032
dummy_electricity97 |   .0246531   .1602176     0.15   0.878    -.2902298     .339536
              _cons |  -2.607573   .5672625    -4.60   0.000     -3.72244   -1.492706
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    0.04
            Prob > F =    0.9565

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .95650522

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0308
                                                Root MSE          =      .2695

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                me2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0071003   .0102875     0.69   0.490    -.0131182    .0273188
              wave3 |  -.0422384   .0090407    -4.67   0.000    -.0600064   -.0244703
              wave4 |  -.0931375   .0102005    -9.13   0.000     -.113185   -.0730899
           nbani197 |   .0031375   .0020563     1.53   0.128    -.0009038    .0071789
           nbani297 |   .0006885    .000785     0.88   0.381    -.0008542    .0022312
               ha97 |    -.00062   .0009412    -0.66   0.510    -.0024698    .0012297
              no497 |  -.0049384   .0131468    -0.38   0.707    -.0307764    .0208996
             big497 |   .0037972   .0082941     0.46   0.647    -.0125037     .020098
             age_hh |   .0030442   .0015898     1.91   0.056    -.0000803    .0061687
            age_hh2 |  -.0000204   .0000142    -1.43   0.152    -.0000484    7.56e-06
          female_hh |   .0375401   .0124918     3.01   0.003     .0129894    .0620907
           educ1_hh |  -.0049059   .0096485    -0.51   0.611    -.0238686    .0140569
       ethnicity_hh |   .0434896   .0193292     2.25   0.025      .005501    .0814782
             age_sp |   .0003032   .0019139     0.16   0.874    -.0034583    .0040646
            age_sp2 |  -3.53e-06   .0000191    -0.19   0.853     -.000041    .0000339
           educ1_sp |  -.0005434   .0098429    -0.06   0.956     -.019888    .0188013
         dage0_7_97 |   .0034356   .0082083     0.42   0.676    -.0126965    .0195676
        dage8_17_97 |  -.0044923   .0067182    -0.67   0.504    -.0176959    .0087113
       dage18_54_97 |    .000374   .0105936     0.04   0.972    -.0204461    .0211941
         dage55p_97 |  -.0250619   .0063264    -3.96   0.000    -.0374955   -.0126283
           hhsize97 |  -.0020083   .0016502    -1.22   0.224    -.0052516     .001235
          homeown97 |   .0242713    .012184     1.99   0.047     .0003256     .048217
        dirtfloor97 |   .0133384   .0081984     1.63   0.104    -.0027742    .0294511
      electricity97 |  -.0065157   .0197564    -0.33   0.742    -.0453439    .0323125
         org_faenas |  -.0404748   .0414654    -0.98   0.330    -.1219686    .0410189
           min_dist |   .0000698   .0001483     0.47   0.638    -.0002217    .0003613
       lnup_cwagepm |   .0045366   .0123475     0.37   0.713    -.0197304    .0288036
       up2_mcwagepm |   .0486573   .0800899     0.61   0.544    -.1087471    .2060617
       dummy_age_hh |  -.1154847   .0400383    -2.88   0.004    -.1941738   -.0367956
      dummy_educ_hh |  -.0276487   .0302692    -0.91   0.362    -.0871381    .0318406
 dummy_ethnicity_hh |   .0700023   .0541438     1.29   0.197     -.036409    .1764136
       dummy_age_sp |   .0230379   .0199727     1.15   0.249    -.0162153     .062291
      dummy_educ_sp |  -.0475826   .0214807    -2.22   0.027    -.0897996   -.0053656
   dummy_dage0_7_97 |  -.0633829   .0182659    -3.47   0.001    -.0992816   -.0274841
  dummy_dirtfloor97 |   .1007861   .0886421     1.14   0.256    -.0734262    .2749984
dummy_electricity97 |  -.1230439   .0322081    -3.82   0.000     -.186344   -.0597437
              _cons |   .0108165   .0994607     0.11   0.913    -.1846581    .2062912
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         me2 |      5,282    .0751609    .2636758          0          1

added scalar:
               e(mean) =  .07516092

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0308
                                                Root MSE          =     .26951

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                me2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   .0023159   .0170124     0.14   0.892    -.0311193    .0357512
      treatcomwave3 |   .0128724   .0172325     0.75   0.455    -.0209954    .0467402
      treatcomwave4 |   .0066283   .0082069     0.81   0.420    -.0095011    .0227576
              wave3 |  -.0486824   .0134868    -3.61   0.000    -.0751887   -.0221761
              wave4 |  -.0957617    .014227    -6.73   0.000    -.1237227   -.0678008
           nbani197 |   .0031479   .0020554     1.53   0.126    -.0008916    .0071873
           nbani297 |   .0006901   .0007841     0.88   0.379    -.0008509    .0022311
               ha97 |  -.0006238   .0009405    -0.66   0.508    -.0024723    .0012247
              no497 |  -.0050298   .0130741    -0.38   0.701    -.0307249    .0206653
             big497 |   .0037921   .0082944     0.46   0.648    -.0125094    .0200935
             age_hh |   .0030461   .0015902     1.92   0.056    -.0000792    .0061715
            age_hh2 |  -.0000204   .0000142    -1.43   0.152    -.0000484    7.55e-06
          female_hh |    .037562   .0125113     3.00   0.003      .012973     .062151
           educ1_hh |  -.0048862   .0096515    -0.51   0.613    -.0238548    .0140823
       ethnicity_hh |   .0435412   .0193568     2.25   0.025     .0054984     .081584
             age_sp |   .0003033   .0019128     0.16   0.874    -.0034561    .0040627
            age_sp2 |  -3.52e-06   .0000191    -0.18   0.853     -.000041    .0000339
           educ1_sp |  -.0005976   .0098279    -0.06   0.952    -.0199129    .0187176
         dage0_7_97 |   .0034437   .0082089     0.42   0.675    -.0126897    .0195771
        dage8_17_97 |  -.0044936   .0067177    -0.67   0.504    -.0176962     .008709
       dage18_54_97 |   .0003838   .0105798     0.04   0.971    -.0204092    .0211768
         dage55p_97 |  -.0250537   .0063257    -3.96   0.000    -.0374859   -.0126215
           hhsize97 |  -.0020065   .0016511    -1.22   0.225    -.0052515    .0012384
          homeown97 |   .0242778   .0121884     1.99   0.047     .0003233    .0482324
        dirtfloor97 |   .0133107   .0082066     1.62   0.106     -.002818    .0294395
      electricity97 |  -.0064993   .0197455    -0.33   0.742     -.045306    .0323074
         org_faenas |  -.0404811   .0414753    -0.98   0.330    -.1219945    .0410322
           min_dist |     .00007    .000148     0.47   0.637     -.000221    .0003609
       lnup_cwagepm |    .004479   .0122778     0.36   0.715     -.019651     .028609
       up2_mcwagepm |   .0481896   .0803862     0.60   0.549     -.109797    .2061763
       dummy_age_hh |  -.1154548    .039795    -2.90   0.004    -.1936658   -.0372438
      dummy_educ_hh |  -.0275929   .0302907    -0.91   0.363    -.0871246    .0319388
 dummy_ethnicity_hh |   .0700801   .0541378     1.29   0.196    -.0363195    .1764797
       dummy_age_sp |   .0229479   .0199431     1.15   0.250    -.0162471    .0621429
      dummy_educ_sp |  -.0474824   .0214386    -2.21   0.027    -.0896166   -.0053482
   dummy_dage0_7_97 |  -.0633442   .0181776    -3.48   0.001    -.0990693    -.027619
  dummy_dirtfloor97 |   .1008041   .0885969     1.14   0.256    -.0733195    .2749277
dummy_electricity97 |  -.1231686   .0322184    -3.82   0.000     -.186489   -.0598483
              _cons |   .0140241   .0988601     0.14   0.887    -.1802703    .2083184
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    0.17
            Prob > F =    0.8427

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .84270762

Linear regression                               Number of obs     =     13,437
                                                F(35, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0260
                                                Root MSE          =     .16795

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             crafts |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0103298   .0073136     1.41   0.159     -.004044    .0247036
              wave3 |  -.0042739   .0048638    -0.88   0.380    -.0138329    .0052852
              wave4 |  -.0329459   .0074367    -4.43   0.000    -.0475617   -.0183302
           nbani197 |   .0014512   .0012751     1.14   0.256    -.0010548    .0039572
           nbani297 |  -.0001912   .0003914    -0.49   0.625    -.0009605     .000578
               ha97 |   -.000797   .0005018    -1.59   0.113    -.0017833    .0001892
              no497 |  -.0070744   .0072974    -0.97   0.333    -.0214162    .0072675
             big497 |  -.0057872   .0050087    -1.16   0.249    -.0156309    .0040566
             age_hh |  -.0003843   .0010147    -0.38   0.705    -.0023787      .00161
            age_hh2 |   4.76e-06   8.45e-06     0.56   0.574    -.0000119    .0000214
          female_hh |   .0157587   .0070643     2.23   0.026     .0018749    .0296424
           educ1_hh |   .0027435   .0067147     0.41   0.683    -.0104533    .0159403
       ethnicity_hh |   .0417145    .016006     2.61   0.009     .0102572    .0731719
             age_sp |   .0013033    .001055     1.24   0.217    -.0007702    .0033769
            age_sp2 |  -.0000133   9.88e-06    -1.35   0.177    -.0000328    6.07e-06
           educ1_sp |   .0035573   .0060825     0.58   0.559    -.0083969    .0155116
         dage0_7_97 |   .0049642    .004813     1.03   0.303    -.0044949    .0144234
        dage8_17_97 |  -.0015039   .0044958    -0.33   0.738    -.0103398    .0073319
       dage18_54_97 |   -.002186   .0069906    -0.31   0.755     -.015925     .011553
         dage55p_97 |  -.0097868   .0040005    -2.45   0.015    -.0176492   -.0019244
           hhsize97 |  -.0008163    .000944    -0.86   0.388    -.0026715     .001039
          homeown97 |   .0168439   .0070342     2.39   0.017     .0030193    .0306684
        dirtfloor97 |   .0091337   .0056146     1.63   0.104     -.001901    .0201684
      electricity97 |  -.0101658    .017782    -0.57   0.568    -.0451135     .024782
         org_faenas |  -.0199138    .023845    -0.84   0.404    -.0667775    .0269499
           min_dist |   .0000532   .0001164     0.46   0.647    -.0001754    .0002819
       lnup_cwagepm |   .0053404   .0054868     0.97   0.331    -.0054431    .0161239
       up2_mcwagepm |    .059931   .0356791     1.68   0.094    -.0101908    .1300529
       dummy_age_hh |  -.0489689   .0286403    -1.71   0.088    -.1052571    .0073192
      dummy_educ_hh |   .0069532   .0280771     0.25   0.805     -.048228    .0621344
 dummy_ethnicity_hh |   .0023503    .021197     0.11   0.912    -.0393092    .0440098
       dummy_age_sp |  -.0072241    .012691    -0.57   0.569    -.0321664    .0177182
      dummy_educ_sp |  -.0090095   .0142673    -0.63   0.528    -.0370497    .0190307
   dummy_dage0_7_97 |  -.0171615   .0112446    -1.53   0.128     -.039261     .004938
  dummy_dirtfloor97 |   .0566583   .0495699     1.14   0.254    -.0407636    .1540802
dummy_electricity97 |  -.0809603   .0296765    -2.73   0.007    -.1392849   -.0226358
              _cons |  -.0169382   .0405554    -0.42   0.676    -.0966435    .0627671
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      crafts |      5,282      .02234    .1478008          0          1

added scalar:
               e(mean) =  .02234002

Linear regression                               Number of obs     =     13,437
                                                F(37, 442)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0261
                                                Root MSE          =     .16796

                                      (Std. Err. adjusted for 443 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             crafts |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   .0119821   .0112219     1.07   0.286    -.0100728    .0340371
      treatcomwave3 |      .0127   .0112385     1.13   0.259    -.0093875    .0347876
      treatcomwave4 |   .0061548   .0053684     1.15   0.252     -.004396    .0167056
              wave3 |  -.0047176   .0072174    -0.65   0.514    -.0189023    .0094671
              wave4 |  -.0293499   .0076356    -3.84   0.000    -.0443564   -.0143434
           nbani197 |   .0014553   .0012765     1.14   0.255    -.0010534    .0039641
           nbani297 |   -.000194   .0003907    -0.50   0.620    -.0009618    .0005738
               ha97 |   -.000796   .0005006    -1.59   0.113    -.0017799    .0001879
              no497 |  -.0071119   .0072727    -0.98   0.329    -.0214052    .0071814
             big497 |  -.0057876   .0050074    -1.16   0.248    -.0156289    .0040538
             age_hh |  -.0003849   .0010149    -0.38   0.705    -.0023795    .0016097
            age_hh2 |   4.77e-06   8.45e-06     0.56   0.573    -.0000118    .0000214
          female_hh |   .0157808   .0070543     2.24   0.026     .0019166    .0296451
           educ1_hh |   .0027385   .0067136     0.41   0.684    -.0104562    .0159331
       ethnicity_hh |   .0417412   .0160264     2.60   0.010     .0102439    .0732385
             age_sp |   .0013074   .0010538     1.24   0.215    -.0007638    .0033785
            age_sp2 |  -.0000134   9.86e-06    -1.36   0.175    -.0000328    5.99e-06
           educ1_sp |   .0035436   .0060781     0.58   0.560     -.008402    .0154893
         dage0_7_97 |   .0049682   .0048142     1.03   0.303    -.0044934    .0144298
        dage8_17_97 |  -.0014999   .0044941    -0.33   0.739    -.0103324    .0073326
       dage18_54_97 |  -.0021664   .0069738    -0.31   0.756    -.0158723    .0115394
         dage55p_97 |  -.0097821   .0040004    -2.45   0.015    -.0176442   -.0019199
           hhsize97 |   -.000818   .0009444    -0.87   0.387     -.002674     .001038
          homeown97 |   .0168444   .0070312     2.40   0.017     .0030257    .0306631
        dirtfloor97 |    .009134   .0056246     1.62   0.105    -.0019203    .0201884
      electricity97 |  -.0101791   .0177727    -0.57   0.567    -.0451086    .0247504
         org_faenas |  -.0199524   .0238249    -0.84   0.403    -.0667766    .0268719
           min_dist |   .0000529   .0001159     0.46   0.648     -.000175    .0002808
       lnup_cwagepm |   .0053786   .0053909     1.00   0.319    -.0052164    .0159736
       up2_mcwagepm |   .0595887   .0356814     1.67   0.096    -.0105375    .1297148
       dummy_age_hh |  -.0482129   .0286962    -1.68   0.094    -.1046108     .008185
      dummy_educ_hh |   .0069612   .0280642     0.25   0.804    -.0481946     .062117
 dummy_ethnicity_hh |   .0024254   .0212009     0.11   0.909    -.0392417    .0440924
       dummy_age_sp |    -.00728   .0126717    -0.57   0.566    -.0321842    .0176243
      dummy_educ_sp |  -.0089708   .0142681    -0.63   0.530    -.0370125     .019071
   dummy_dage0_7_97 |  -.0169845   .0111041    -1.53   0.127     -.038808    .0048389
  dummy_dirtfloor97 |   .0566561   .0495761     1.14   0.254    -.0407781    .1540904
dummy_electricity97 |   -.080943   .0296419    -2.73   0.007    -.1391995   -.0226865
              _cons |  -.0181987   .0395036    -0.46   0.645     -.095837    .0594396
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   442) =    0.17
            Prob > F =    0.8439

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .84388672

. ***Output for Table 6 -- Panel 1;
. estout ani1_pc ani2_pc land_pc vani1_pc vani2_pc ha_pc me2_pc crafts_pc 
>          using "$out_p/main.text", stats(N mean, fmt(%9.0fc %9.3fc  %9.3fc) 
>          labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>          keep(treatcom) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>          starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(Ineligibles - Unconditional) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/main.text)

. estout ani1_pc_pvalue ani2_pc_pvalue land_pc_pvalue vani1_pc_pvalue vani2_pc_pvalue ha_pc_pvalue me2_pc_pvalue crafts_pc_pv
> alue
>          using "$out_p/time.text", stats(N mean pvalue, fmt(%9.0fc %9.3fc  %9.3fc) 
>          labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)")) 
>          keep(treatcomwave2 treatcomwave3 treatcomwave4) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>          starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(Ineligibles - Unconditional) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/time.text)

. estimates clear;

. foreach y of global treatcom2 {;
  2. ***Agricultural Assets: Ineligibles, Conditional (Dummy Vars) -- Table A6, Panel 2;
. foreach x of global dep_dum {;
  3.         reg `x' `y' wave3 wave4 $basic $controls if `x'97 ==0, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         est store `x'_pc, title (`x');
  8.         reg `x' `y'wave2 `y'wave3 `y'wave4 wave3 wave4 $basic $controls if `x'97 ==0, cl(comuid);
  9.         test `y'wave2 = `y'wave3 = `y'wave4;
 10.         scalar mean =r(mean);
 11.         estadd scalar mean;
 12.         scalar pvalue =r(p);
 13.         estadd scalar pvalue;
 14.         est store `x'_pc_pvalue, title (`x');
 15. };
 16. ***Agricultural Assets: Ineligibles, Conditional (Continuous Vars) -- Table A6, Panel 2;
. foreach x of global dep_cont {;
 17.         reg `x' `y' wave3 wave4 $basic $controls if `x'97 >0, cl(comuid);
 18.         sum `x' if e(sample) & `y' ==0;
 19.         scalar mean =r(mean);
 20.         estadd scalar mean;
 21.         est store `x'_pc, title (`x');
 22.         reg `x' `y'wave2 `y'wave3 `y'wave4 wave3 wave4 $basic $controls if `x'97 >0, cl(comuid);
 23.         test `y'wave2 = `y'wave3 = `y'wave4;
 24.         scalar mean =r(mean);
 25.         estadd scalar mean;
 26.         scalar pvalue =r(p);
 27.         estadd scalar pvalue;
 28.         est store `x'_pc_pvalue, title (`x');
 29. };
 30. };

Linear regression                               Number of obs     =      7,134
                                                F(34, 398)        =       5.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0399
                                                Root MSE          =     .33209

                                      (Std. Err. adjusted for 399 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0133034   .0156997     0.85   0.397    -.0175613    .0441681
              wave3 |  -.0066849   .0074258    -0.90   0.369    -.0212836    .0079138
              wave4 |   .0234986   .0101176     2.32   0.021     .0036079    .0433893
           nbani197 |          0  (omitted)
           nbani297 |   .0058175   .0022417     2.60   0.010     .0014105    .0102246
               ha97 |   .0007674    .002615     0.29   0.769    -.0043736    .0059084
              no497 |   -.055783   .0134094    -4.16   0.000    -.0821451   -.0294209
             big497 |  -.0026871   .0198661    -0.14   0.892    -.0417427    .0363685
             age_hh |   .0033149   .0031407     1.06   0.292    -.0028595    .0094893
            age_hh2 |  -.0000346   .0000289    -1.20   0.232    -.0000913    .0000222
          female_hh |   -.031286   .0169278    -1.85   0.065    -.0645651     .001993
           educ1_hh |     .03254   .0144316     2.25   0.025     .0041682    .0609117
       ethnicity_hh |  -.0504757   .0150134    -3.36   0.001    -.0799913   -.0209602
             age_sp |   -.004459   .0036522    -1.22   0.223    -.0116391    .0027211
            age_sp2 |   .0000662   .0000404     1.64   0.102    -.0000132    .0001455
           educ1_sp |   .0308062   .0156866     1.96   0.050    -.0000328    .0616452
         dage0_7_97 |  -.0111227   .0143915    -0.77   0.440    -.0394155    .0171701
        dage8_17_97 |   .0152723   .0145398     1.05   0.294    -.0133122    .0438568
       dage18_54_97 |   .0122045    .018957     0.64   0.520    -.0250639    .0494729
         dage55p_97 |  -.0060948   .0183145    -0.33   0.739       -.0421    .0299104
           hhsize97 |   .0026805   .0035764     0.75   0.454    -.0043504    .0097115
          homeown97 |  -.0073841   .0213373    -0.35   0.729    -.0493319    .0345638
        dirtfloor97 |   .0265075   .0124459     2.13   0.034     .0020396    .0509754
      electricity97 |  -.0061738   .0214472    -0.29   0.774    -.0483378    .0359902
         org_faenas |  -.0438577   .0259092    -1.69   0.091    -.0947937    .0070782
           min_dist |   -.000283   .0002027    -1.40   0.163    -.0006815    .0001155
       lnup_cwagepm |   .0452838   .0124917     3.63   0.000     .0207259    .0698417
       up2_mcwagepm |   .2485795   .0792253     3.14   0.002     .0928271    .4043318
       dummy_age_hh |  -.0956718   .0754623    -1.27   0.206    -.2440263    .0526826
      dummy_educ_hh |  -.0653641   .0677304    -0.97   0.335     -.198518    .0677899
 dummy_ethnicity_hh |   .0813873   .1132256     0.72   0.473    -.1412078    .3039824
       dummy_age_sp |  -.0210706   .0861605    -0.24   0.807    -.1904572    .1483159
      dummy_educ_sp |  -.0114354    .087181    -0.13   0.896    -.1828282    .1599574
   dummy_dage0_7_97 |  -.0649652   .0362812    -1.79   0.074     -.136292    .0063615
  dummy_dirtfloor97 |  -.1429185   .0406302    -3.52   0.000    -.2227952   -.0630418
dummy_electricity97 |          0  (omitted)
              _cons |  -.1586579   .1258322    -1.26   0.208    -.4060369     .088721
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani1 |      2,878    .1247394    .3304806          0          1

added scalar:
               e(mean) =  .1247394

Linear regression                               Number of obs     =      7,134
                                                F(36, 398)        =       5.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0401
                                                Root MSE          =     .33209

                                      (Std. Err. adjusted for 399 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   .0193072   .0178896     1.08   0.281    -.0158627    .0544771
      treatcomwave3 |  -.0025798   .0184628    -0.14   0.889    -.0388766    .0337169
      treatcomwave4 |   .0227106   .0198843     1.14   0.254    -.0163808     .061802
              wave3 |   .0065175   .0118407     0.55   0.582    -.0167606    .0297957
              wave4 |   .0213946   .0152721     1.40   0.162    -.0086295    .0514187
           nbani197 |          0  (omitted)
           nbani297 |   .0058274   .0022429     2.60   0.010      .001418    .0102368
               ha97 |    .000777   .0026173     0.30   0.767    -.0043684    .0059225
              no497 |   -.055521   .0134059    -4.14   0.000    -.0818763   -.0291658
             big497 |  -.0026899   .0198748    -0.14   0.892    -.0417625    .0363827
             age_hh |   .0032947   .0031412     1.05   0.295    -.0028807      .00947
            age_hh2 |  -.0000344   .0000289    -1.19   0.234    -.0000912    .0000224
          female_hh |  -.0313613   .0169384    -1.85   0.065    -.0646612    .0019387
           educ1_hh |   .0325337   .0144357     2.25   0.025      .004154    .0609134
       ethnicity_hh |  -.0506437   .0150247    -3.37   0.001    -.0801813   -.0211061
             age_sp |  -.0044594   .0036505    -1.22   0.223    -.0116361    .0027172
            age_sp2 |   .0000662   .0000403     1.64   0.102    -.0000131    .0001455
           educ1_sp |    .030893   .0156851     1.97   0.050     .0000569     .061729
         dage0_7_97 |  -.0111374   .0143939    -0.77   0.440    -.0394349    .0171602
        dage8_17_97 |   .0152898   .0145423     1.05   0.294    -.0132995    .0438791
       dage18_54_97 |   .0120219   .0189739     0.63   0.527    -.0252796    .0493235
         dage55p_97 |  -.0060948   .0183227    -0.33   0.740    -.0421161    .0299265
           hhsize97 |   .0026877   .0035778     0.75   0.453     -.004346    .0097214
          homeown97 |   -.007381    .021332    -0.35   0.730    -.0493185    .0345566
        dirtfloor97 |   .0265674   .0124466     2.13   0.033     .0020981    .0510368
      electricity97 |  -.0062251     .02145    -0.29   0.772    -.0483946    .0359444
         org_faenas |  -.0438056   .0259757    -1.69   0.093    -.0948723    .0072611
           min_dist |   -.000283   .0002029    -1.39   0.164    -.0006819    .0001159
       lnup_cwagepm |   .0451287   .0126616     3.56   0.000     .0202368    .0700206
       up2_mcwagepm |   .2489092    .080389     3.10   0.002     .0908691    .4069494
       dummy_age_hh |  -.0968256   .0760577    -1.27   0.204    -.2463506    .0526994
      dummy_educ_hh |  -.0659289   .0678439    -0.97   0.332    -.1993061    .0674484
 dummy_ethnicity_hh |   .0814426   .1132634     0.72   0.473    -.1412267     .304112
       dummy_age_sp |  -.0208165   .0861933    -0.24   0.809    -.1902675    .1486345
      dummy_educ_sp |  -.0116415   .0872277    -0.13   0.894    -.1831261    .1598432
   dummy_dage0_7_97 |  -.0642286   .0367219    -1.75   0.081    -.1364217    .0079646
  dummy_dirtfloor97 |  -.1425895   .0406129    -3.51   0.000    -.2224321   -.0627468
dummy_electricity97 |          0  (omitted)
              _cons |  -.1606888   .1268661    -1.27   0.206    -.4101001    .0887226
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   398) =    1.37
            Prob > F =    0.2556

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .25564365

Linear regression                               Number of obs     =      1,944
                                                F(32, 251)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0644
                                                Root MSE          =     .48208

                                      (Std. Err. adjusted for 252 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0014005   .0320881     0.04   0.965    -.0617957    .0645967
              wave3 |   .0736197   .0267468     2.75   0.006      .020943    .1262964
              wave4 |   .0963666   .0266575     3.61   0.000     .0438658    .1488674
           nbani197 |   .0708173   .0391835     1.81   0.072     -.006353    .1479877
           nbani297 |          0  (omitted)
               ha97 |   .0034424   .0064437     0.53   0.594    -.0092482    .0161329
              no497 |  -.0421798   .0398141    -1.06   0.290    -.1205921    .0362325
             big497 |  -.0666309     .04864    -1.37   0.172    -.1624254    .0291636
             age_hh |   .0028685   .0091305     0.31   0.754    -.0151136    .0208507
            age_hh2 |  -.0000209   .0000866    -0.24   0.809    -.0001915    .0001497
          female_hh |   .1278953   .0550131     2.32   0.021     .0195492    .2362413
           educ1_hh |  -.0379219   .0394298    -0.96   0.337    -.1155772    .0397335
       ethnicity_hh |   .0241332   .0407428     0.59   0.554    -.0561081    .1043744
             age_sp |  -.0044258   .0092545    -0.48   0.633    -.0226522    .0138006
            age_sp2 |   .0000602   .0000948     0.63   0.526    -.0001265    .0002469
           educ1_sp |   .0210964   .0473713     0.45   0.656    -.0721995    .1143923
         dage0_7_97 |  -.0387803   .0378432    -1.02   0.306    -.1133111    .0357504
        dage8_17_97 |   .0184677   .0389512     0.47   0.636    -.0582451    .0951806
       dage18_54_97 |   .0324223   .0523969     0.62   0.537    -.0707713    .1356159
         dage55p_97 |   .0120493   .0517852     0.23   0.816    -.0899395    .1140382
           hhsize97 |   .0209166   .0094691     2.21   0.028     .0022676    .0395656
          homeown97 |  -.0687207    .053491    -1.28   0.200    -.1740691    .0366277
        dirtfloor97 |   .0629396   .0309821     2.03   0.043     .0019216    .1239576
      electricity97 |   .0754082   .0465609     1.62   0.107    -.0162917    .1671081
         org_faenas |   .0121226    .056708     0.21   0.831    -.0995615    .1238068
           min_dist |   .0000659   .0003638     0.18   0.856    -.0006506    .0007823
       lnup_cwagepm |   .0647221   .0213066     3.04   0.003     .0227596    .1066845
       up2_mcwagepm |   .3182272   .1426099     2.23   0.027     .0373627    .5990916
       dummy_age_hh |          0  (omitted)
      dummy_educ_hh |  -.2749906   .1016046    -2.71   0.007    -.4750969   -.0748844
 dummy_ethnicity_hh |   -.261212   .1154916    -2.26   0.025     -.488668    -.033756
       dummy_age_sp |  -.1114647   .1164484    -0.96   0.339    -.3408053    .1178758
      dummy_educ_sp |  -.0395833   .1232301    -0.32   0.748    -.2822801    .2031134
   dummy_dage0_7_97 |  -.3677344   .1195521    -3.08   0.002    -.6031874   -.1322814
  dummy_dirtfloor97 |   .1940882   .0747148     2.60   0.010     .0469403    .3412361
dummy_electricity97 |          0  (omitted)
              _cons |  -.1526134   .2581097    -0.59   0.555    -.6609503    .3557234
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ani2 |        801    .4269663    .4949464          0          1

added scalar:
               e(mean) =  .42696629

Linear regression                               Number of obs     =      1,944
                                                F(34, 251)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0649
                                                Root MSE          =      .4822

                                      (Std. Err. adjusted for 252 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               ani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   .0310349   .0419954     0.74   0.461    -.0516735    .1137432
      treatcomwave3 |  -.0185322   .0446538    -0.42   0.678     -.106476    .0694117
      treatcomwave4 |  -.0118245   .0417814    -0.28   0.777    -.0941113    .0704622
              wave3 |   .1030269   .0363035     2.84   0.005     .0315285    .1745252
              wave4 |   .1214904   .0394356     3.08   0.002     .0438235    .1991572
           nbani197 |   .0710146   .0392803     1.81   0.072    -.0063464    .1483755
           nbani297 |          0  (omitted)
               ha97 |   .0035047   .0064627     0.54   0.588    -.0092234    .0162328
              no497 |  -.0416679   .0398489    -1.05   0.297    -.1201486    .0368129
             big497 |  -.0669105   .0486835    -1.37   0.171    -.1627907    .0289698
             age_hh |   .0029217   .0091447     0.32   0.750    -.0150883    .0209317
            age_hh2 |  -.0000214   .0000868    -0.25   0.805    -.0001923    .0001495
          female_hh |   .1277263   .0550175     2.32   0.021     .0193715    .2360811
           educ1_hh |   -.037721   .0394586    -0.96   0.340    -.1154332    .0399913
       ethnicity_hh |   .0237169   .0406469     0.58   0.560    -.0563355    .1037693
             age_sp |  -.0044151    .009263    -0.48   0.634    -.0226582    .0138279
            age_sp2 |   .0000599   .0000948     0.63   0.528    -.0001268    .0002467
           educ1_sp |   .0214034   .0474698     0.45   0.652    -.0720865    .1148933
         dage0_7_97 |   -.038488   .0378908    -1.02   0.311    -.1131124    .0361364
        dage8_17_97 |   .0182459   .0389333     0.47   0.640    -.0584317    .0949236
       dage18_54_97 |   .0322981   .0524009     0.62   0.538    -.0709034    .1354997
         dage55p_97 |   .0120066   .0518491     0.23   0.817    -.0901082    .1141214
           hhsize97 |   .0208594   .0094695     2.20   0.029     .0022096    .0395093
          homeown97 |  -.0686826   .0535457    -1.28   0.201    -.1741388    .0367735
        dirtfloor97 |   .0631999   .0310048     2.04   0.043     .0021371    .1242627
      electricity97 |   .0755521    .046542     1.62   0.106    -.0161105    .1672147
         org_faenas |   .0114164   .0565561     0.20   0.840    -.0999686    .1228013
           min_dist |   .0000624   .0003637     0.17   0.864    -.0006539    .0007787
       lnup_cwagepm |   .0650932   .0211925     3.07   0.002     .0233553     .106831
       up2_mcwagepm |   .3198583    .142057     2.25   0.025     .0400828    .5996338
       dummy_age_hh |          0  (omitted)
      dummy_educ_hh |  -.2857835   .1037136    -2.76   0.006    -.4900433   -.0815237
 dummy_ethnicity_hh |  -.2604659   .1156286    -2.25   0.025    -.4881917     -.03274
       dummy_age_sp |  -.1124137    .116576    -0.96   0.336    -.3420054    .1171781
      dummy_educ_sp |  -.0387426   .1234277    -0.31   0.754    -.2818286    .2043435
   dummy_dage0_7_97 |  -.3689848   .1262683    -2.92   0.004    -.6176653   -.1203044
  dummy_dirtfloor97 |   .1952096   .0746213     2.62   0.009      .048246    .3421732
dummy_electricity97 |          0  (omitted)
              _cons |  -.1732218   .2572906    -0.67   0.501    -.6799454    .3335019
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   251) =    0.50
            Prob > F =    0.6076

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .60757315

Linear regression                               Number of obs     =      3,919
                                                F(31, 339)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0867
                                                Root MSE          =     .45441

                                      (Std. Err. adjusted for 340 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0325259    .027786     1.17   0.243    -.0221287    .0871805
              wave3 |   .0076657   .0193199     0.40   0.692    -.0303362    .0456676
              wave4 |   .0766929    .022014     3.48   0.001     .0333917     .119994
           nbani197 |    .097742    .017332     5.64   0.000     .0636502    .1318338
           nbani297 |   .0072933    .004526     1.61   0.108    -.0016093    .0161959
               ha97 |          0  (omitted)
              no497 |  -.0956792   .0204893    -4.67   0.000    -.1359815    -.055377
             big497 |          0  (omitted)
             age_hh |   .0066506   .0053649     1.24   0.216    -.0039021    .0172032
            age_hh2 |  -.0000345   .0000501    -0.69   0.491    -.0001331     .000064
          female_hh |  -.1020287   .0393382    -2.59   0.010    -.1794064    -.024651
           educ1_hh |  -.0024377    .025167    -0.10   0.923    -.0519409    .0470655
       ethnicity_hh |    .054468   .0370619     1.47   0.143    -.0184322    .1273683
             age_sp |  -.0087703   .0059897    -1.46   0.144     -.020552    .0030113
            age_sp2 |   .0000979   .0000649     1.51   0.133    -.0000298    .0002256
           educ1_sp |   .0468601   .0271781     1.72   0.086    -.0065989     .100319
         dage0_7_97 |  -.0229559   .0245536    -0.93   0.350    -.0712526    .0253408
        dage8_17_97 |  -.0207255   .0223612    -0.93   0.355    -.0647096    .0232586
       dage18_54_97 |   .0230676   .0370626     0.62   0.534    -.0498341    .0959694
         dage55p_97 |    .002303   .0324948     0.07   0.944    -.0616139    .0662198
           hhsize97 |  -.0021811   .0066232    -0.33   0.742    -.0152088    .0108466
          homeown97 |   .0418423   .0261294     1.60   0.110    -.0095539    .0932385
        dirtfloor97 |    .031522   .0207545     1.52   0.130    -.0093017    .0723458
      electricity97 |  -.0549232    .037134    -1.48   0.140    -.1279653    .0181188
         org_faenas |  -.0251172   .0436132    -0.58   0.565    -.1109038    .0606694
           min_dist |   .0001504   .0003086     0.49   0.626    -.0004566    .0007574
       lnup_cwagepm |    .015248   .0184894     0.82   0.410    -.0211204    .0516164
       up2_mcwagepm |   .1308836   .1267792     1.03   0.303    -.1184893    .3802566
       dummy_age_hh |          0  (omitted)
      dummy_educ_hh |  -.0995966   .0994101    -1.00   0.317    -.2951349    .0959418
 dummy_ethnicity_hh |   .3563299   .1043094     3.42   0.001     .1511547     .561505
       dummy_age_sp |   .0485878   .0676574     0.72   0.473    -.0844933     .181669
      dummy_educ_sp |   -.052958   .0746922    -0.71   0.479    -.1998766    .0939607
   dummy_dage0_7_97 |  -.1921948   .0618393    -3.11   0.002    -.3138319   -.0705576
  dummy_dirtfloor97 |          0  (omitted)
dummy_electricity97 |   .4439072   .0639419     6.94   0.000     .3181345      .56968
              _cons |   .1282142    .174332     0.74   0.463    -.2146945     .471123
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        land |      1,553    .3122988    .4635802          0          1

added scalar:
               e(mean) =  .31229878

Linear regression                               Number of obs     =      3,919
                                                F(33, 339)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0868
                                                Root MSE          =      .4545

                                      (Std. Err. adjusted for 340 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               land |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   .0330004   .0341931     0.97   0.335     -.034257    .1002579
      treatcomwave3 |   .0202771   .0380371     0.53   0.594    -.0545414    .0950955
      treatcomwave4 |   .0441454   .0359782     1.23   0.221    -.0266233     .114914
              wave3 |   .0155072   .0306012     0.51   0.613    -.0446849    .0756992
              wave4 |    .070107   .0282218     2.48   0.013     .0145951     .125619
           nbani197 |   .0977716   .0173374     5.64   0.000     .0636691    .1318741
           nbani297 |   .0072926    .004529     1.61   0.108    -.0016158    .0162009
               ha97 |          0  (omitted)
              no497 |  -.0955564   .0204704    -4.67   0.000    -.1358215   -.0552913
             big497 |          0  (omitted)
             age_hh |   .0066418   .0053657     1.24   0.217    -.0039125     .017196
            age_hh2 |  -.0000345   .0000501    -0.69   0.491    -.0001331    .0000641
          female_hh |  -.1021842   .0393348    -2.60   0.010    -.1795552   -.0248133
           educ1_hh |  -.0025189   .0251967    -0.10   0.920    -.0520805    .0470428
       ethnicity_hh |   .0544054   .0370423     1.47   0.143    -.0184562     .127267
             age_sp |  -.0087776   .0059929    -1.46   0.144    -.0205655    .0030104
            age_sp2 |    .000098    .000065     1.51   0.132    -.0000298    .0002259
           educ1_sp |   .0470268   .0272343     1.73   0.085    -.0065428    .1005963
         dage0_7_97 |  -.0229714   .0245697    -0.93   0.350    -.0712997    .0253569
        dage8_17_97 |  -.0206895   .0223685    -0.92   0.356    -.0646881    .0233091
       dage18_54_97 |   .0229553   .0370255     0.62   0.536    -.0498734     .095784
         dage55p_97 |   .0023002   .0324891     0.07   0.944    -.0616054    .0662059
           hhsize97 |  -.0021896   .0066255    -0.33   0.741    -.0152218    .0108427
          homeown97 |    .041911    .026112     1.61   0.109     -.009451     .093273
        dirtfloor97 |   .0315809   .0207689     1.52   0.129    -.0092712     .072433
      electricity97 |  -.0549361    .037132    -1.48   0.140    -.1279743    .0181021
         org_faenas |  -.0251769   .0436275    -0.58   0.564    -.1109916    .0606378
           min_dist |   .0001484   .0003085     0.48   0.631    -.0004583    .0007552
       lnup_cwagepm |   .0153278   .0181211     0.85   0.398    -.0203163    .0509718
       up2_mcwagepm |   .1315722   .1246164     1.06   0.292    -.1135466    .3766911
       dummy_age_hh |          0  (omitted)
      dummy_educ_hh |  -.0999935   .0994582    -1.01   0.315    -.2956265    .0956394
 dummy_ethnicity_hh |   .3564416   .1038667     3.43   0.001     .1521372    .5607461
       dummy_age_sp |    .048763   .0675295     0.72   0.471    -.0840667    .1815927
      dummy_educ_sp |  -.0530477   .0746116    -0.71   0.478    -.1998078    .0937123
   dummy_dage0_7_97 |  -.1922881   .0619912    -3.10   0.002    -.3142239   -.0703523
  dummy_dirtfloor97 |          0  (omitted)
dummy_electricity97 |   .4439974   .0639697     6.94   0.000       .31817    .5698248
              _cons |   .1281152   .1724596     0.74   0.458    -.2111104    .4673408
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   339) =    0.19
            Prob > F =    0.8246

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .8245956

Linear regression                               Number of obs     =      6,281
                                                F(33, 389)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1638
                                                Root MSE          =     1570.1

                                      (Std. Err. adjusted for 390 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   36.88943    73.8408     0.50   0.618    -108.2876    182.0664
              wave3 |  -96.61087   44.91367    -2.15   0.032    -184.9148   -8.306962
              wave4 |  -81.61543   48.58042    -1.68   0.094    -177.1285    13.89761
           nbani197 |   294.5194   51.68293     5.70   0.000     192.9066    396.1322
           nbani297 |    16.7568   6.671042     2.51   0.012     3.640994    29.87261
               ha97 |  -13.95653   7.752335    -1.80   0.073    -29.19824    1.285193
              no497 |          0  (omitted)
             big497 |   311.9867   70.93566     4.40   0.000     172.5215     451.452
             age_hh |   13.19584   16.11526     0.82   0.413    -18.48806    44.87975
            age_hh2 |  -.1155671   .1521641    -0.76   0.448    -.4147341       .1836
          female_hh |  -171.4143   107.1692    -1.60   0.111    -382.1177    39.28911
           educ1_hh |   56.26045    69.5862     0.81   0.419    -80.55166    193.0726
       ethnicity_hh |  -312.4348   61.55997    -5.08   0.000    -433.4667   -191.4029
             age_sp |   10.63604   18.88348     0.56   0.574    -26.49041    47.76249
            age_sp2 |  -.0704657   .1877737    -0.38   0.708    -.4396441    .2987127
           educ1_sp |   37.48107    79.6144     0.47   0.638    -119.0473    194.0094
         dage0_7_97 |  -182.6681   62.00716    -2.95   0.003    -304.5792   -60.75699
        dage8_17_97 |   1.463809   69.17181     0.02   0.983    -134.5336    137.4612
       dage18_54_97 |   115.8489   100.2106     1.16   0.248    -81.17314     312.871
         dage55p_97 |   69.73953   63.17876     1.10   0.270    -54.47503    193.9541
           hhsize97 |   23.59316   16.13064     1.46   0.144    -8.120983    55.30731
          homeown97 |  -7.354052    110.391    -0.07   0.947    -224.3917    209.6836
        dirtfloor97 |   42.96006   59.68006     0.72   0.472    -74.37577    160.2959
      electricity97 |   152.1892   62.72198     2.43   0.016     28.87268    275.5057
         org_faenas |   -15.7293    160.381    -0.10   0.922    -331.0513    299.5927
           min_dist |  -3.148543   .8698807    -3.62   0.000    -4.858799   -1.438287
       lnup_cwagepm |   243.6525   61.45102     3.96   0.000     122.8348    364.4702
       up2_mcwagepm |    1384.07   400.0151     3.46   0.001     597.6082    2170.533
       dummy_age_hh |   -265.033   816.8812    -0.32   0.746    -1871.088    1341.022
      dummy_educ_hh |  -452.4304   146.5842    -3.09   0.002    -740.6268    -164.234
 dummy_ethnicity_hh |   295.6804   789.2216     0.37   0.708    -1255.993    1847.354
       dummy_age_sp |  -360.1502   206.9691    -1.74   0.083    -767.0683    46.76789
      dummy_educ_sp |   321.2745   203.5681     1.58   0.115    -78.95695     721.506
   dummy_dage0_7_97 |   592.2646   260.4956     2.27   0.024     80.10912     1104.42
  dummy_dirtfloor97 |  -289.6544   101.6141    -2.85   0.005    -489.4359   -89.87279
dummy_electricity97 |   176.4085   117.0448     1.51   0.133    -53.71096     406.528
              _cons |  -1732.977   554.5285    -3.13   0.002    -2823.225   -642.7295
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani1 |      2,398    1064.244    1601.979          0   19396.22

added scalar:
               e(mean) =  1064.2436

Linear regression                               Number of obs     =      6,281
                                                F(35, 389)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1640
                                                Root MSE          =     1570.2

                                      (Std. Err. adjusted for 390 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |   105.7474   91.96591     1.15   0.251    -75.06504    286.5598
      treatcomwave3 |   5.928666   89.14207     0.07   0.947    -169.3319    181.1892
      treatcomwave4 |  -7.560966   91.21436    -0.08   0.934    -186.8958    171.7739
              wave3 |    -34.727   70.96159    -0.49   0.625    -174.2432    104.7892
              wave4 |  -10.60254   80.23322    -0.13   0.895    -168.3476    147.1425
           nbani197 |   294.4619   51.68503     5.70   0.000      192.845    396.0789
           nbani297 |   16.72299   6.679298     2.50   0.013     3.590947    29.85503
               ha97 |  -13.90591   7.759605    -1.79   0.074    -29.16193    1.350101
              no497 |          0  (omitted)
             big497 |   312.2042   70.95204     4.40   0.000     172.7067    451.7016
             age_hh |   13.16861   16.10874     0.82   0.414    -18.50247    44.83969
            age_hh2 |  -.1152108   .1521166    -0.76   0.449    -.4142844    .1838628
          female_hh |  -171.3579   107.1758    -1.60   0.111    -382.0742    39.35837
           educ1_hh |   55.77689   69.48728     0.80   0.423    -80.84074    192.3945
       ethnicity_hh |  -312.8127   61.40118    -5.09   0.000    -433.5324   -192.0931
             age_sp |   10.73592   18.87827     0.57   0.570     -26.3803    47.85213
            age_sp2 |  -.0714994   .1877066    -0.38   0.703    -.4405458     .297547
           educ1_sp |   38.11765   79.58327     0.48   0.632    -118.3495    194.5848
         dage0_7_97 |  -182.5984   62.00201    -2.95   0.003    -304.4994   -60.69745
        dage8_17_97 |   1.603964   69.18019     0.02   0.982    -134.4099    137.6178
       dage18_54_97 |   115.9397   100.2505     1.16   0.248    -81.16103    313.0404
         dage55p_97 |   69.47812    63.2288     1.10   0.273    -54.83483    193.7911
           hhsize97 |   23.52319   16.13548     1.46   0.146    -8.200464    55.24685
          homeown97 |  -7.294015   110.4489    -0.07   0.947    -224.4456    209.8576
        dirtfloor97 |   43.22405   59.70204     0.72   0.470    -74.15501    160.6031
      electricity97 |   151.8123   62.70511     2.42   0.016     28.52893    275.0956
         org_faenas |  -16.14296   160.1811    -0.10   0.920    -331.0721    298.7861
           min_dist |  -3.155274   .8707387    -3.62   0.000    -4.867217   -1.443331
       lnup_cwagepm |   243.4821   61.97831     3.93   0.000     121.6277    365.3365
       up2_mcwagepm |   1375.864   401.7358     3.42   0.001     586.0186    2165.709
       dummy_age_hh |  -251.4948   816.4525    -0.31   0.758    -1856.707    1353.717
      dummy_educ_hh |  -454.2072   146.4262    -3.10   0.002     -742.093   -166.3213
 dummy_ethnicity_hh |   295.3133    789.438     0.37   0.709    -1256.786    1847.412
       dummy_age_sp |  -358.8874   207.3939    -1.73   0.084    -766.6406    48.86589
      dummy_educ_sp |   319.9408   204.0001     1.57   0.118    -81.13999    721.0217
   dummy_dage0_7_97 |   587.2849   259.3835     2.26   0.024     77.31601    1097.254
  dummy_dirtfloor97 |  -292.2463   102.7875    -2.84   0.005    -494.3349   -90.15763
dummy_electricity97 |    177.673   117.3302     1.51   0.131    -53.00766    408.3536
              _cons |  -1775.134   566.1038    -3.14   0.002     -2888.14   -662.1279
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   389) =    0.74
            Prob > F =    0.4768

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .47680326

Linear regression                               Number of obs     =     11,447
                                                F(34, 439)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2279
                                                Root MSE          =     4789.7

                                      (Std. Err. adjusted for 440 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   48.15246   198.6584     0.24   0.809    -342.2872    438.5922
              wave3 |  -143.5316   105.4263    -1.36   0.174    -350.7346    63.67145
              wave4 |   43.39716   132.2001     0.33   0.743    -216.4267     303.221
           nbani197 |   149.0334   73.89969     2.02   0.044     3.792244    294.2746
           nbani297 |   518.6557   42.86557    12.10   0.000     434.4085     602.903
               ha97 |   -16.3018    33.2792    -0.49   0.624    -81.70815    49.10455
              no497 |          0  (omitted)
             big497 |    451.319   194.8259     2.32   0.021     68.41164    834.2263
             age_hh |   81.01509   31.33662     2.59   0.010     19.42665    142.6035
            age_hh2 |   -.721952   .2746622    -2.63   0.009    -1.261768   -.1821358
          female_hh |  -623.1882   226.5525    -2.75   0.006     -1068.45   -177.9259
           educ1_hh |   90.94498   177.5913     0.51   0.609    -258.0898    439.9798
       ethnicity_hh |  -358.7875   303.0703    -1.18   0.237    -954.4365    236.8615
             age_sp |   23.04048   37.46011     0.62   0.539    -50.58297    96.66393
            age_sp2 |  -.2071319   .3830817    -0.54   0.589     -.960034    .5457702
           educ1_sp |   218.8853   180.6634     1.21   0.226    -136.1874     573.958
         dage0_7_97 |  -104.9215   156.1953    -0.67   0.502    -411.9049     202.062
        dage8_17_97 |  -186.8348   142.1793    -1.31   0.190    -466.2716    92.60198
       dage18_54_97 |   296.1747   186.0809     1.59   0.112    -69.54538    661.8948
         dage55p_97 |   93.62171    199.028     0.47   0.638    -297.5444    484.7879
           hhsize97 |   70.98065   34.48728     2.06   0.040     3.199956    138.7613
          homeown97 |   38.97718   224.9178     0.17   0.862    -403.0723    481.0266
        dirtfloor97 |  -821.2904   144.2024    -5.70   0.000    -1104.703   -537.8776
      electricity97 |  -84.02943   232.9915    -0.36   0.719    -541.9468    373.8879
         org_faenas |   148.5117    295.492     0.50   0.616    -432.2431    729.2665
           min_dist |   2.989401   2.091493     1.43   0.154    -1.121182    7.099984
       lnup_cwagepm |   238.7516   157.2495     1.52   0.130    -70.30373    547.8069
       up2_mcwagepm |   599.8283   1003.443     0.60   0.550    -1372.321    2571.977
       dummy_age_hh |    1576.72   2072.792     0.76   0.447    -2497.108    5650.548
      dummy_educ_hh |  -958.1051    423.122    -2.26   0.024    -1789.702   -126.5085
 dummy_ethnicity_hh |   204.4155   1256.441     0.16   0.871    -2264.972    2673.803
       dummy_age_sp |   364.0343   458.1166     0.79   0.427    -536.3401    1264.409
      dummy_educ_sp |  -170.3228   405.4215    -0.42   0.675    -967.1312    626.4855
   dummy_dage0_7_97 |   91.81595   681.5789     0.13   0.893    -1247.747    1431.379
  dummy_dirtfloor97 |   1169.075   1286.619     0.91   0.364    -1359.623    3697.774
dummy_electricity97 |   -959.936   374.8022    -2.56   0.011    -1696.566   -223.3063
              _cons |  -3738.504   1382.403    -2.70   0.007    -6455.453   -1021.554
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       vani2 |      4,464     2855.19    5372.359          0   51334.27

added scalar:
               e(mean) =  2855.1898

Linear regression                               Number of obs     =     11,447
                                                F(36, 439)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2282
                                                Root MSE          =     4789.2

                                      (Std. Err. adjusted for 440 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
              vani2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |  -36.75153   244.3545    -0.15   0.881    -517.0015    443.4984
      treatcomwave3 |  -132.7856    227.607    -0.58   0.560    -580.1204    314.5491
      treatcomwave4 |    321.619   246.0308     1.31   0.192    -161.9255    805.1635
              wave3 |  -84.63337   185.1115    -0.46   0.648    -448.4484    279.1816
              wave4 |  -179.6081    177.891    -1.01   0.313    -529.2319    170.0156
           nbani197 |   148.7319   73.81861     2.01   0.045     3.650077    293.8137
           nbani297 |   518.8244   42.87699    12.10   0.000     434.5548    603.0941
               ha97 |  -16.32861   33.29075    -0.49   0.624    -81.75766    49.10045
              no497 |          0  (omitted)
             big497 |   451.7726   194.9214     2.32   0.021     68.67756    834.8677
             age_hh |   81.06737   31.31329     2.59   0.010     19.52479      142.61
            age_hh2 |  -.7228347   .2744601    -2.63   0.009    -1.262254   -.1834156
          female_hh |  -623.7574   226.5302    -2.75   0.006    -1068.976   -178.5389
           educ1_hh |   90.30497   177.6814     0.51   0.612    -258.9069    439.5169
       ethnicity_hh |  -360.7163   303.4359    -1.19   0.235    -957.0839    235.6514
             age_sp |    22.8037   37.45636     0.61   0.543    -50.81237    96.41976
            age_sp2 |  -.2044035   .3830471    -0.53   0.594    -.9572375    .5484306
           educ1_sp |   219.7753   180.6547     1.22   0.224    -135.2803     574.831
         dage0_7_97 |  -105.7183   156.2085    -0.68   0.499    -412.7276    201.2911
        dage8_17_97 |  -187.8182   142.1705    -1.32   0.187    -467.2376    91.60115
       dage18_54_97 |   295.3176   186.1066     1.59   0.113    -70.45292    661.0882
         dage55p_97 |   93.03057   199.0121     0.47   0.640    -298.1044    484.1655
           hhsize97 |    71.1262   34.47505     2.06   0.040     3.369535    138.8829
          homeown97 |   38.06265   225.0814     0.17   0.866    -404.3083    480.4336
        dirtfloor97 |  -821.0366   144.1723    -5.69   0.000     -1104.39   -537.6828
      electricity97 |  -82.65082   232.9108    -0.35   0.723    -540.4096     375.108
         org_faenas |   150.6085   296.2793     0.51   0.611    -431.6936    732.9106
           min_dist |   3.012016   2.091234     1.44   0.150    -1.098058     7.12209
       lnup_cwagepm |   235.5558    154.836     1.52   0.129    -68.75619    539.8678
       up2_mcwagepm |   619.6882   985.2406     0.63   0.530    -1316.687    2556.063
       dummy_age_hh |   1531.356   2055.194     0.75   0.457    -2507.887    5570.598
      dummy_educ_hh |   -961.958   420.9023    -2.29   0.023    -1789.192   -134.7239
 dummy_ethnicity_hh |   196.2552   1255.993     0.16   0.876    -2272.252    2664.763
       dummy_age_sp |   365.7374   457.8592     0.80   0.425    -534.1309    1265.606
      dummy_educ_sp |  -171.5426   405.2414    -0.42   0.672    -967.9969    624.9117
   dummy_dage0_7_97 |   74.90187   674.9037     0.11   0.912    -1251.542    1401.346
  dummy_dirtfloor97 |   1169.351   1289.462     0.91   0.365    -1364.935    3703.638
dummy_electricity97 |  -959.7771    374.533    -2.56   0.011    -1695.878   -223.6765
              _cons |  -3665.088    1375.99    -2.66   0.008    -6369.434   -960.7409
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   439) =    2.03
            Prob > F =    0.1330

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .1330302

Linear regression                               Number of obs     =      9,429
                                                F(34, 424)        =      26.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1708
                                                Root MSE          =     2.7957

                                      (Std. Err. adjusted for 425 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |  -.1255616   .1397927    -0.90   0.370    -.4003346    .1492113
              wave3 |  -.2277364   .0936413    -2.43   0.015    -.4117954   -.0436774
              wave4 |   .0857308   .1085075     0.79   0.430    -.1275488    .2990105
           nbani197 |   .0160063   .0265846     0.60   0.547    -.0362476    .0682603
           nbani297 |   .0197325   .0126675     1.56   0.120    -.0051665    .0446315
               ha97 |   .2102096   .0249417     8.43   0.000     .1611849    .2592343
              no497 |          0  (omitted)
             big497 |   .6261028   .1115678     5.61   0.000      .406808    .8453977
             age_hh |   .0560924   .0234032     2.40   0.017     .0100917    .1020931
            age_hh2 |  -.0003466   .0001968    -1.76   0.079    -.0007336    .0000403
          female_hh |  -.3862738   .1240004    -3.12   0.002    -.6300059   -.1425418
           educ1_hh |  -.0254225   .1071174    -0.24   0.813    -.2359696    .1851247
       ethnicity_hh |  -.3218524   .1251298    -2.57   0.010    -.5678043   -.0759005
             age_sp |   .0308223   .0286645     1.08   0.283    -.0255198    .0871645
            age_sp2 |  -.0003075   .0002688    -1.14   0.253    -.0008358    .0002207
           educ1_sp |   -.030474   .1251469    -0.24   0.808    -.2764595    .2155116
         dage0_7_97 |  -.0581589    .105548    -0.55   0.582    -.2656213    .1493036
        dage8_17_97 |  -.0179956   .0951651    -0.19   0.850    -.2050497    .1690584
       dage18_54_97 |  -.0215358   .1182686    -0.18   0.856    -.2540017      .21093
         dage55p_97 |  -.2602259    .098586    -2.64   0.009    -.4540041   -.0664476
           hhsize97 |   .0424628   .0219392     1.94   0.054    -.0006603    .0855859
          homeown97 |   .3043256   .2516439     1.21   0.227    -.1902994    .7989506
        dirtfloor97 |  -.0958799   .0825642    -1.16   0.246     -.258166    .0664062
      electricity97 |    .141497   .1173877     1.21   0.229    -.0892373    .3722312
         org_faenas |   .2590336   .2256216     1.15   0.252    -.1844425    .7025098
           min_dist |   .0011251   .0014842     0.76   0.449    -.0017923    .0040425
       lnup_cwagepm |   .2824677   .0923796     3.06   0.002     .1008888    .4640467
       up2_mcwagepm |   1.267856   .5881553     2.16   0.032     .1117924    2.423919
       dummy_age_hh |  -.3185878   .3212541    -0.99   0.322    -.9500368    .3128611
      dummy_educ_hh |  -.3859045    .355279    -1.09   0.278    -1.084232     .312423
 dummy_ethnicity_hh |   .1476827   .3147619     0.47   0.639    -.4710054    .7663708
       dummy_age_sp |  -.4638023   .3547524    -1.31   0.192    -1.161095    .2334901
      dummy_educ_sp |   .2584515   .3558403     0.73   0.468    -.4409791    .9578822
   dummy_dage0_7_97 |   .2411469   1.211527     0.20   0.842    -2.140199    2.622493
  dummy_dirtfloor97 |  -.0470985   .4978169    -0.09   0.925    -1.025595    .9313977
dummy_electricity97 |          0  (omitted)
              _cons |  -3.681738   .8689081    -4.24   0.000    -5.389642   -1.973835
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          ha |      3,686    2.740681    3.084999          0         20

added scalar:
               e(mean) =  2.740681

Linear regression                               Number of obs     =      9,429
                                                F(36, 424)        =      26.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1708
                                                Root MSE          =     2.7959

                                      (Std. Err. adjusted for 425 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
                 ha |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
      treatcomwave2 |  -.0957428    .176855    -0.54   0.589    -.4433645    .2518789
      treatcomwave3 |  -.0927731   .1662633    -0.56   0.577    -.4195761    .2340298
      treatcomwave4 |  -.1912991   .1967506    -0.97   0.331     -.578027    .1954289
              wave3 |  -.2294999    .158196    -1.45   0.148    -.5404459    .0814462
              wave4 |   .1455397   .1743915     0.83   0.404    -.1972399    .4883193
           nbani197 |   .0160574   .0265947     0.60   0.546    -.0362165    .0683314
           nbani297 |   .0196831   .0126751     1.55   0.121    -.0052307    .0445969
               ha97 |    .210228   .0249416     8.43   0.000     .1612035    .2592526
              no497 |          0  (omitted)
             big497 |   .6260485   .1115158     5.61   0.000     .4068558    .8452411
             age_hh |   .0560199   .0234081     2.39   0.017     .0100094    .1020303
            age_hh2 |   -.000346   .0001969    -1.76   0.080     -.000733    .0000411
          female_hh |  -.3859259   .1240281    -3.11   0.002    -.6297124   -.1421395
           educ1_hh |  -.0256139   .1071499    -0.24   0.811    -.2362249    .1849972
       ethnicity_hh |  -.3213563   .1251366    -2.57   0.011    -.5673216    -.075391
             age_sp |   .0309282   .0286481     1.08   0.281    -.0253817    .0872381
            age_sp2 |  -.0003087   .0002686    -1.15   0.251    -.0008366    .0002193
           educ1_sp |  -.0304338   .1249187    -0.24   0.808    -.2759709    .2151033
         dage0_7_97 |  -.0579852   .1055183    -0.55   0.583    -.2653893    .1494188
        dage8_17_97 |  -.0179473   .0950992    -0.19   0.850    -.2048719    .1689772
       dage18_54_97 |  -.0212098    .118252    -0.18   0.858     -.253643    .2112234
         dage55p_97 |  -.2601498   .0985981    -2.64   0.009    -.4539517   -.0663478
           hhsize97 |   .0424117   .0219227     1.93   0.054    -.0006789    .0855024
          homeown97 |   .3049879   .2518681     1.21   0.227    -.1900777    .8000534
        dirtfloor97 |  -.0958786   .0825192    -1.16   0.246    -.2580763     .066319
      electricity97 |   .1409776   .1175158     1.20   0.231    -.0900085    .3719637
         org_faenas |   .2580547   .2255651     1.14   0.253    -.1853104    .7014199
           min_dist |   .0011155   .0014851     0.75   0.453    -.0018036    .0040345
       lnup_cwagepm |   .2836119   .0913609     3.10   0.002     .1040354    .4631885
       up2_mcwagepm |   1.263587   .5833271     2.17   0.031     .1170139     2.41016
       dummy_age_hh |   -.307395   .3196959    -0.96   0.337    -.9357811    .3209912
      dummy_educ_hh |  -.3861775   .3556159    -1.09   0.278    -1.085167    .3128122
 dummy_ethnicity_hh |   .1495586   .3143119     0.48   0.634    -.4682449    .7673621
       dummy_age_sp |  -.4643051    .355003    -1.31   0.192     -1.16209    .2334798
      dummy_educ_sp |   .2586676   .3559015     0.73   0.468    -.4408833    .9582185
   dummy_dage0_7_97 |   .2417619   1.213291     0.20   0.842    -2.143053    2.626576
  dummy_dirtfloor97 |  -.0473558   .4988443    -0.09   0.924    -1.027871    .9331599
dummy_electricity97 |          0  (omitted)
              _cons |  -3.706136   .8677146    -4.27   0.000    -5.411694   -2.000578
-------------------------------------------------------------------------------------

 ( 1)  treatcomwave2 - treatcomwave3 = 0
 ( 2)  treatcomwave2 - treatcomwave4 = 0

       F(  2,   424) =    0.17
            Prob > F =    0.8446

added scalar:
               e(mean) =  .

added scalar:
             e(pvalue) =  .84462026

. ***Output for Table 6 -- Panel 2;
. estout ani1_pc ani2_pc land_pc vani1_pc vani2_pc ha_pc
>          using "$out_p/main.text", stats(N mean, fmt(%9.0fc  %9.3fc %9.3fc) 
>          labels("Number Observations" "Mean Dep Var Conditional Sample (Control Households)")) 
>          keep(treatcom) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>          starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(Ineligibles - Conditional) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/main.text)

. estout ani1_pc_pvalue ani2_pc_pvalue land_pc_pvalue vani1_pc_pvalue vani2_pc_pvalue ha_pc_pvalue 
>          using "$out_p/time.text", stats(N mean pvalue, fmt(%9.0fc %9.3fc  %9.3fc) 
>          labels("Number Observations" "Mean Dep Var Conditional Sample (Control Households)")) 
>          keep(treatcomwave2 treatcomwave3 treatcomwave4) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>          starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(Ineligibles - Conditional) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/time.text)

. restore;

. log close;
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/investments.log
  log type:  text
 closed on:  29 Nov 2019, 14:22:36
-----------------------------------------------------------------------------------------------------------------------------
