----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/investments_
> des.log
  log type:  text
 opened on:  29 Nov 2019, 13:14:43

. u "$data/investments_data.dta";
(Complete Investments Data Base)

. *======================================
>  Create Wave & Edu Dummies
>  Recover Missing Values for Summary Stats (values had been replaced)
> =======================================;
. ***Wave Dummies;
. foreach x in 0 2 3 4 5 6 7 {;
  2.         gen byte wave`x' = (wave ==`x');
  3.         label var wave`x' "Wave `x' =1";
  4. };

. ***Recover missing values;
. foreach x in no497 small497 big497 {;
  2.         replace `x' =. if deffarm97 ==.;
  3. };
(0 real changes made)
(0 real changes made)
(0 real changes made)

. foreach x in age_hh female_hh ethnicity_hh educ_hh age_sp educ_sp hhsize97 homeown97 dirtfloor97 electricity97
>  {;
  2.         replace `x' =. if dummy_`x' ==1;
  3. };
(874 real changes made, 874 to missing)
(797 real changes made, 797 to missing)
(9,924 real changes made, 9,924 to missing)
(8,171 real changes made, 8,171 to missing)
(26,629 real changes made, 26,629 to missing)
(32,037 real changes made, 32,037 to missing)
(10,508 real changes made, 10,508 to missing)
(10,578 real changes made, 10,578 to missing)
(10,861 real changes made, 10,861 to missing)
(10,582 real changes made, 10,582 to missing)

. foreach x in dage0_7 dage8_17_97 dage18_54_97 dage55p {;
  2.         replace `x' =. if dummy_dage0_7 ==1;
  3. };
(10,664 real changes made, 10,664 to missing)
(10,664 real changes made, 10,664 to missing)
(10,664 real changes made, 10,664 to missing)
(10,664 real changes made, 10,664 to missing)

. replace up_cwagepm =. if up2_mcwagepm ==1;
(12,360 real changes made, 12,360 to missing)

.   replace up_cwagepw =. if up2_mcwagepm ==1;
(12,360 real changes made, 12,360 to missing)

.   replace up_cwagepc =. if up2_mcwagepm ==1;
(12,360 real changes made, 12,360 to missing)

.   ***Education Dummies;
. foreach x in hh sp {;
  2.         drop educ1_`x';
  3.         g educ0_`x' =(educ_`x' <=0.5);
  4.         g educ1_`x' =(educ_`x' >=1 & educ_`x' <=5);
  5.         g educ2_`x' =(educ_`x' ==6);
  6.         g educ3_`x' =(educ_`x' >=7 & educ_`x'<=18);
  7. };

. foreach x in hh sp {;
  2.         foreach y in 0 1 2 3 {;
  3.                 replace educ`y'_`x' =. if educ_`x' ==.;
  4.         };
  5. };
(8,171 real changes made, 8,171 to missing)
(8,171 real changes made, 8,171 to missing)
(8,171 real changes made, 8,171 to missing)
(8,171 real changes made, 8,171 to missing)
(32,037 real changes made, 32,037 to missing)
(32,037 real changes made, 32,037 to missing)
(32,037 real changes made, 32,037 to missing)
(32,037 real changes made, 32,037 to missing)

. *===========================================
>   Define Globals for Summary Statistics
> ============================================;
. gl dep97_d              ani197 ani297 land97;

. gl dep97_c              vani197 vani297 ha97;

. gl cont_d               female_hh ethnicity_hh educ0_hh educ1_hh educ2_hh educ3_hh educ0_sp educ1_sp educ2_sp 
> educ3_sp 
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p_97 
>                                 homeown97 dirtfloor97 electricity97 no497 small497 big497 org_faenas;

. gl cont_c               age_hh age_sp hhsize97 min_dist up_cwagepm;

. gl cont_ent     age_ent1 educ_ent1 female_ent1 benef_ent1;

. *Treatment/control groups;
. gl treatcom1 t2_c1_op;

. gl treatcom3 treatcom;

. version 7.0;

.  *change version to run old code for sum stats;
. svyset psu comuid;

. *=============================
>   Sample Sizes 
> ==============================;
. tab wave0;

  Wave 0 =1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    134,165       84.93       84.93
          1 |     23,806       15.07      100.00
------------+-----------------------------------
      Total |    157,971      100.00

. tab t2_c1_op if wave ==0;

   Original |
      Poor: |
  intention |
 to treat = |
     1, all |
 controls = |
          0 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,644       37.75       37.75
          1 |      7,658       62.25      100.00
------------+-----------------------------------
      Total |     12,302      100.00

. tab t1_c2_op if wave ==0;

   Original |
      Poor: |
     actual |
treatment = |
  1, actual |
 controls = |
          0 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,159       37.88       37.88
          1 |      6,819       62.12      100.00
------------+-----------------------------------
      Total |     10,978      100.00

. *================================================================================
>  Covariates & Dependent Vars at Baseline (wave 0): Eligible Households (Table 1)
> *================================================================================;
. **Covariates;
. postfile eligibles str20 name obstret treat tstd obscont control cstd tstat using "$out_p/eligibles.dta", repl
> ace;

.         foreach var of global cont_d {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post eligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0)  (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   female_hh |      4,644    .0839793    .2773867          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   female_hh |      7,658     .081614    .2737936          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12302
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12302

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
female_hh      |
   t2_c1_op==0 |   .0839793     .004735        4644
   t2_c1_op==1 |    .081614    .0041152        7658
------------------------------------------------------------------------------

 ( 1)  - [female_hh]0 + [female_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0023653   .0062733    -0.38   0.706    -.0146907      .00996
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ethnicity_hh |      4,636    .4370147    .4960705          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ethnicity_hh |      7,646    .4190426    .4934346          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12282
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12282

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ethnicity_hh   |
   t2_c1_op==0 |   .4370147    .0438478        4636
   t2_c1_op==1 |   .4190426     .033891        7646
------------------------------------------------------------------------------

 ( 1)  - [ethnicity_hh]0 + [ethnicity_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.017972   .0554187    -0.32   0.746    -.1268542    .0909102
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_hh |      4,637    .3265042    .4689847          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_hh |      7,634     .314383    .4643001          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12271
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12271

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ0_hh       |
   t2_c1_op==0 |   .3265042    .0173238        4637
   t2_c1_op==1 |    .314383    .0142231        7634
------------------------------------------------------------------------------

 ( 1)  - [educ0_hh]0 + [educ0_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0121212   .0224146    -0.54   0.589    -.0561595    .0319171
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_hh |      4,637    .4675437    .4989993          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_hh |      7,634     .462798    .4986468          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12271
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12271

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ1_hh       |
   t2_c1_op==0 |   .4675437    .0134269        4637
   t2_c1_op==1 |    .462798    .0108364        7634
------------------------------------------------------------------------------

 ( 1)  - [educ1_hh]0 + [educ1_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0047457   .0172542    -0.28   0.783    -.0386453     .029154
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_hh |      4,637    .1559198    .3628184          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_hh |      7,634    .1693739    .3751064          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12271
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12271

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ2_hh       |
   t2_c1_op==0 |   .1559198    .0107362        4637
   t2_c1_op==1 |   .1693739    .0083763        7634
------------------------------------------------------------------------------

 ( 1)  - [educ2_hh]0 + [educ2_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0134541   .0136172     0.99   0.324    -.0132999     .040208
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_hh |      4,637    .0500323    .2180352          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_hh |      7,634    .0534451    .2249341          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12271
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12271

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ3_hh       |
   t2_c1_op==0 |   .0500323     .004992        4637
   t2_c1_op==1 |   .0534451     .004333        7634
------------------------------------------------------------------------------

 ( 1)  - [educ3_hh]0 + [educ3_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0034128   .0066102     0.52   0.606    -.0095745    .0164001
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_sp |      4,067     .373494     .483791          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_sp |      6,700     .361791    .4805546          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     10767
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     10767

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ0_sp       |
   t2_c1_op==0 |    .373494    .0219339        4067
   t2_c1_op==1 |    .361791    .0181715        6700
------------------------------------------------------------------------------

 ( 1)  - [educ0_sp]0 + [educ0_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0117029   .0284833    -0.41   0.681     -.067665    .0442591
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_sp |      4,067    .4069339    .4913228          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_sp |      6,700    .4164179    .4930013          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     10767
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     10767

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ1_sp       |
   t2_c1_op==0 |   .4069339    .0157862        4067
   t2_c1_op==1 |   .4164179    .0120981        6700
------------------------------------------------------------------------------

 ( 1)  - [educ1_sp]0 + [educ1_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0094841   .0198889     0.48   0.634    -.0295922    .0485603
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_sp |      4,067    .1696582    .3753784          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_sp |      6,700    .1837313    .3872938          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     10767
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     10767

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ2_sp       |
   t2_c1_op==0 |   .1696582    .0112453        4067
   t2_c1_op==1 |   .1837313    .0087947        6700
------------------------------------------------------------------------------

 ( 1)  - [educ2_sp]0 + [educ2_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0140731    .014276     0.99   0.325    -.0139753    .0421215
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_sp |      4,067    .0499139    .2177939          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_sp |      6,700    .0380597    .1913547          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     10767
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     10767

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ3_sp       |
   t2_c1_op==0 |   .0499139    .0049962        4067
   t2_c1_op==1 |   .0380597    .0034434        6700
------------------------------------------------------------------------------

 ( 1)  - [educ3_sp]0 + [educ3_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0118542   .0060678    -1.95   0.051    -.0237759    .0000674
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage0_7_97 |      4,639    .7704247    .4206051          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage0_7_97 |      7,645    .7535644    .4309633          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12284
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12284

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage0_7_97     |
   t2_c1_op==0 |   .7704247    .0089429        4639
   t2_c1_op==1 |   .7535644     .008113        7645
------------------------------------------------------------------------------

 ( 1)  - [dage0_7_97]0 + [dage0_7_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0168602   .0120746    -1.40   0.163    -.0405834     .006863
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dage8_17_97 |      4,639    .6954085    .4602838          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dage8_17_97 |      7,645    .6901243    .4624724          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12284
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12284

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage8_17_97    |
   t2_c1_op==0 |   .6954085    .0085719        4639
   t2_c1_op==1 |   .6901243    .0071964        7645
------------------------------------------------------------------------------

 ( 1)  - [dage8_17_97]0 + [dage8_17_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0052842   .0111922    -0.47   0.637    -.0272737    .0167053
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dage18_54_97 |      4,639    .9523604    .2130254          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dage18_54_97 |      7,645    .9468934    .2242607          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12284
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12284

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage18_54_97   |
   t2_c1_op==0 |   .9523604    .0037739        4639
   t2_c1_op==1 |   .9468934    .0033804        7645
------------------------------------------------------------------------------

 ( 1)  - [dage18_54_97]0 + [dage18_54_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.005467   .0050665    -1.08   0.281    -.0154214    .0044873
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage55p_97 |      4,639    .2720414    .4450591          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage55p_97 |      7,645    .2699804    .4439783          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12284
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12284

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage55p_97     |
   t2_c1_op==0 |   .2720414    .0093379        4639
   t2_c1_op==1 |   .2699804    .0066318        7645
------------------------------------------------------------------------------

 ( 1)  - [dage55p_97]0 + [dage55p_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.002061   .0114532    -0.18   0.857    -.0245634    .0204414
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   homeown97 |      4,643    .9209563     .269836          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   homeown97 |      7,655    .9338994    .2484741          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12298
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12298

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
homeown97      |
   t2_c1_op==0 |   .9209563    .0072412        4643
   t2_c1_op==1 |   .9338994    .0048189        7655
------------------------------------------------------------------------------

 ( 1)  - [homeown97]0 + [homeown97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0129431   .0086981     1.49   0.137    -.0041462    .0300324
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dirtfloor97 |      4,630    .7572354    .4288002          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dirtfloor97 |      7,641    .7317105    .4430981          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12271
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12271

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dirtfloor97    |
   t2_c1_op==0 |   .7572354    .0197641        4630
   t2_c1_op==1 |   .7317105    .0155467        7641
------------------------------------------------------------------------------

 ( 1)  - [dirtfloor97]0 + [dirtfloor97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0255249    .025146    -1.02   0.311    -.0749298      .02388
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
electrici~97 |      4,642    .6057734    .4887366          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
electrici~97 |      7,653    .5765059    .4941445          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12295
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12295

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
electricity97  |
   t2_c1_op==0 |   .6057734    .0323585        4642
   t2_c1_op==1 |   .5765059    .0279735        7653
------------------------------------------------------------------------------

 ( 1)  - [electricity97]0 + [electricity97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0292674   .0427737    -0.68   0.494    -.1133058    .0547709
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       no497 |      4,630    .1187905    .3235768          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       no497 |      7,635    .1063523    .3083082          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12265
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12265

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
no497          |
   t2_c1_op==0 |   .1187905    .0102163        4630
   t2_c1_op==1 |   .1063523    .0070261        7635
------------------------------------------------------------------------------

 ( 1)  - [no497]0 + [no497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0124382   .0123991    -1.00   0.316     -.036799    .0119226
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    small497 |      4,630    .6617711     .473158          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    small497 |      7,635    .6991487    .4586582          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12265
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12265

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
small497       |
   t2_c1_op==0 |   .6617711    .0145153        4630
   t2_c1_op==1 |   .6991487    .0103726        7635
------------------------------------------------------------------------------

 ( 1)  - [small497]0 + [small497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0373776   .0178405     2.10   0.037      .002326    .0724292
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      big497 |      4,630    .2194384    .4139109          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      big497 |      7,635     .194499    .3958405          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12265
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12265

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
big497         |
   t2_c1_op==0 |   .2194384    .0149373        4630
   t2_c1_op==1 |    .194499    .0111781        7635
------------------------------------------------------------------------------

 ( 1)  - [big497]0 + [big497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0249394   .0186567    -1.34   0.182    -.0615946    .0117158
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  org_faenas |      4,644    .8774763     .327925          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  org_faenas |      7,658    .8784278    .3268124          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12302
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12302

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
org_faenas     |
   t2_c1_op==0 |   .8774763    .0355235        4644
   t2_c1_op==1 |   .8784278    .0282164        7658
------------------------------------------------------------------------------

 ( 1)  - [org_faenas]0 + [org_faenas]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0009515   .0453661     0.02   0.983    -.0881801    .0900831
------------------------------------------------------------------------------

.         foreach var of global cont_c {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if `var' >0 & wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if `var' >0 & wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post eligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_hh |      4,643    42.33319    14.52093         15         88

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_hh |      7,655    41.94631     14.1329         14         88

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12298
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12298

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_hh         |
   t2_c1_op==0 |   42.33319    .3325835        4643
   t2_c1_op==1 |   41.94631    .2404325        7655
------------------------------------------------------------------------------

 ( 1)  - [age_hh]0 + [age_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3868801   .4103895    -0.94   0.346    -1.193181    .4194202
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_sp |      4,074    36.17084    12.22284         14         85

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_sp |      6,713    36.27454    12.22464         14         88

Survey mean estimation

pweight:  <none>                                  Number of obs    =     10787
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     10787

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_sp         |
   t2_c1_op==0 |   36.17084    .2847056        4074
   t2_c1_op==1 |   36.27454    .2040778        6713
------------------------------------------------------------------------------

 ( 1)  - [age_sp]0 + [age_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1037025   .3502928     0.30   0.767    -.5845281     .791933
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    hhsize97 |      4,644    5.943368    2.412907          1         17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    hhsize97 |      7,658    5.909115    2.433247          1         24

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12302
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12302

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
hhsize97       |
   t2_c1_op==0 |   5.943368    .0579033        4644
   t2_c1_op==1 |   5.909115    .0474922        7658
------------------------------------------------------------------------------

 ( 1)  - [hhsize97]0 + [hhsize97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0342531   .0748886    -0.46   0.648    -.1813882    .1128819
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    min_dist |      4,644    105.1127    43.72098   9.465392   169.3153

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    min_dist |      7,658    107.7253    41.36075   13.31589   170.4576

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12302
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12302

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
min_dist       |
   t2_c1_op==0 |   105.1127    3.999255        4644
   t2_c1_op==1 |   107.7253    3.012551        7658
------------------------------------------------------------------------------

 ( 1)  - [min_dist]0 + [min_dist]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.612536   5.006946     0.52   0.602     -7.22471    12.44978
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |      2,781    585.2341    172.1152        360       1440

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |      4,426    573.8589    172.0054   303.1579       1200

Survey mean estimation

pweight:  <none>                                  Number of obs    =      7207
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       332
                                                  Population size  =      7207

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
up_cwagepm     |
   t2_c1_op==0 |   585.2341    19.09358        2781
   t2_c1_op==1 |   573.8589    15.45954        4426
------------------------------------------------------------------------------

 ( 1)  - [up_cwagepm]0 + [up_cwagepm]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -11.37516    24.5675    -0.46   0.644    -59.70329    36.95297
------------------------------------------------------------------------------

. ***Characteristics entrepreneur -- use info in wave ==2 (Oct 98) because there is no infomration availabel at 
> baseline;
.         foreach var of global cont_ent {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==2 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean `var' if wave ==2, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post eligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    age_ent1 |        338    40.24852    14.29938          4         82

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    age_ent1 |        823     40.2418    13.98091          0         81

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1161
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       308
                                                  Population size  =      1161

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_ent1       |
   t2_c1_op==0 |   40.24852    .8574972         338
   t2_c1_op==1 |    40.2418    .6004723         823
------------------------------------------------------------------------------

 ( 1)  - [age_ent1]0 + [age_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0067224   1.046837    -0.01   0.995    -2.066606    2.053162
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   educ_ent1 |        335    2.610448    2.582132          0         12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   educ_ent1 |        818     2.77934    2.771251          0         15

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1153
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       307
                                                  Population size  =      1153

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ_ent1      |
   t2_c1_op==0 |   2.610448    .1867784         335
   t2_c1_op==1 |    2.77934    .1661552         818
------------------------------------------------------------------------------

 ( 1)  - [educ_ent1]0 + [educ_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1688921   .2499875     0.68   0.500    -.3230199    .6608041
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 female_ent1 |        338    .5443787     .498765          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 female_ent1 |        823    .5321993    .4992655          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1161
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       308
                                                  Population size  =      1161

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
female_ent1    |
   t2_c1_op==0 |   .5443787    .0615437         338
   t2_c1_op==1 |   .5321993    .0295937         823
------------------------------------------------------------------------------

 ( 1)  - [female_ent1]0 + [female_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0121794   .0682892    -0.18   0.859    -.1465535    .1221947
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  benef_ent1 |        335     .358209    .4801912          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  benef_ent1 |        818    .3484108    .4767584          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1153
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       306
                                                  Population size  =      1153

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
benef_ent1     |
   t2_c1_op==0 |    .358209    .0407504         335
   t2_c1_op==1 |   .3484108    .0236261         818
------------------------------------------------------------------------------

 ( 1)  - [benef_ent1]0 + [benef_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0097982    .047104    -0.21   0.835    -.1024882    .0828918
------------------------------------------------------------------------------

. ***Dependent Variables;
.         foreach var of global dep97_d {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post eligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani197 |      4,644    .3176141    .4655986          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani197 |      7,658    .3448681    .4753563          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12302
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12302

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ani197         |
   t2_c1_op==0 |   .3176141    .0165774        4644
   t2_c1_op==1 |   .3448681    .0154878        7658
------------------------------------------------------------------------------

 ( 1)  - [ani197]0 + [ani197]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .027254   .0226866     1.20   0.230    -.0173189    .0718269
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani297 |      4,643    .8145596    .3886963          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani297 |      7,656      .80721    .3945153          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12299
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12299

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ani297         |
   t2_c1_op==0 |   .8145596    .0131415        4643
   t2_c1_op==1 |     .80721    .0114051        7656
------------------------------------------------------------------------------

 ( 1)  - [ani297]0 + [ani297]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0073495   .0174004    -0.42   0.673    -.0415365    .0268375
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      land97 |      4,644    .5602929    .4964049          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      land97 |      7,658    .5911465    .4916542          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     12302
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =     12302

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
land97         |
   t2_c1_op==0 |   .5602929    .0226555        4644
   t2_c1_op==1 |   .5911465     .017733        7658
------------------------------------------------------------------------------

 ( 1)  - [land97]0 + [land97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0308537   .0287703     1.07   0.284     -.025672    .0873793
------------------------------------------------------------------------------

.         foreach var of global dep97_c {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if `var' >0 & wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if  `var' >0 & wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post eligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani197 |      1,472    1641.435    2270.887   173.7144   50688.73

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani197 |      2,633    1748.511    2681.141    107.433   49209.59

Survey mean estimation

pweight:  <none>                                  Number of obs    =      4105
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       463
                                                  Population size  =      4105

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
vani197        |
   t2_c1_op==0 |   1641.435    106.8355        1472
   t2_c1_op==1 |   1748.511    89.58279        2633
------------------------------------------------------------------------------

 ( 1)  - [vani197]0 + [vani197]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   107.0753   139.4234     0.77   0.443    -166.9074     381.058
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani297 |      3,773    2225.846    4480.324   16.95261   63729.17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani297 |      6,172     2264.08    4438.938   15.19086   61180.48

Survey mean estimation

pweight:  <none>                                  Number of obs    =      9945
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       501
                                                  Population size  =      9945

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
vani297        |
   t2_c1_op==0 |   2225.846    158.1305        3773
   t2_c1_op==1 |    2264.08    123.9826        6172
------------------------------------------------------------------------------

 ( 1)  - [vani297]0 + [vani297]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   38.23353   200.9401     0.19   0.849    -356.5576    433.0246
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ha97 |      2,543    3.042076     2.95458          1         24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ha97 |      4,432    2.693141    2.780411          1         24

Survey mean estimation

pweight:  <none>                                  Number of obs    =      6975
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       486
                                                  Population size  =      6975

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ha97           |
   t2_c1_op==0 |   3.042076    .1430312        2543
   t2_c1_op==1 |   2.693141    .0984328        4432
------------------------------------------------------------------------------

 ( 1)  - [ha97]0 + [ha97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3489355   .1736287    -2.01   0.045    -.6900929   -.0077781
------------------------------------------------------------------------------

. postclose eligibles;

. *====================================================================================
>  Covariates & Dependent Vars at Baseline (wave 0): Ineligible Households (Table A5)
> *====================================================================================;
. preserve;

. keep if ineligible ==1;
(124,611 observations deleted)

. **Covariates;
. postfile ineligibles str20 name obstret treat tstd obscont control cstd tstat using "$out_p/ineligibles.dta", 
> replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/ineligibles.dta no
> t found)

.         foreach var of global cont_d {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==0 & treatcom ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if wave ==0, obs  by(treatcom);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post ineligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0)  (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   female_hh |      2,037    .1134021    .3171615          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   female_hh |      3,212    .1127024    .3162779          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5249
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5249

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
female_hh      |
   treatcom==0 |   .1134021    .0077401        2037
   treatcom==1 |   .1127024    .0063074        3212
------------------------------------------------------------------------------

 ( 1)  - [female_hh]0 + [female_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0006997   .0099846    -0.07   0.944    -.0203225    .0189232
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ethnicity_hh |      2,035     .187715    .3905804          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ethnicity_hh |      3,198    .2098186    .4072427          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5233
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5233

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ethnicity_hh   |
   treatcom==0 |    .187715     .034015        2035
   treatcom==1 |   .2098186    .0298535        3198
------------------------------------------------------------------------------

 ( 1)  - [ethnicity_hh]0 + [ethnicity_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0221036   .0452576     0.49   0.626    -.0668421    .1110494
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_hh |      2,028    .2569034    .4370334          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_hh |      3,197    .2918361    .4546784          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5225
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5225

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ0_hh       |
   treatcom==0 |   .2569034    .0143534        2028
   treatcom==1 |   .2918361    .0135957        3197
------------------------------------------------------------------------------

 ( 1)  - [educ0_hh]0 + [educ0_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0349327   .0197703     1.77   0.078    -.0039222    .0737877
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_hh |      2,028    .5039448    .5001078          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_hh |      3,197    .4635596    .4987483          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5225
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5225

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ1_hh       |
   treatcom==0 |   .5039448    .0154022        2028
   treatcom==1 |   .4635596    .0136699        3197
------------------------------------------------------------------------------

 ( 1)  - [educ1_hh]0 + [educ1_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0403852   .0205935    -1.96   0.050    -.0808581    .0000877
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_hh |      2,028    .1410256    .3481338          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_hh |      3,197    .1366906    .3435742          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5225
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5225

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ2_hh       |
   treatcom==0 |   .1410256    .0091404        2028
   treatcom==1 |   .1366906     .007898        3197
------------------------------------------------------------------------------

 ( 1)  - [educ2_hh]0 + [educ2_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.004335   .0120799    -0.36   0.720     -.028076     .019406
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_hh |      2,028    .0981262    .2975586          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_hh |      3,197    .1079137    .3103199          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5225
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5225

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ3_hh       |
   treatcom==0 |   .0981262    .0077804        2028
   treatcom==1 |   .1079137    .0091915        3197
------------------------------------------------------------------------------

 ( 1)  - [educ3_hh]0 + [educ3_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0097874   .0120423     0.81   0.417    -.0138796    .0334545
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_sp |      1,625    .2867692    .4523921          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_sp |      2,556    .3188576    .4661249          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      4181
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       437
                                                  Population size  =      4181

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ0_sp       |
   treatcom==0 |   .2867692    .0183099        1625
   treatcom==1 |   .3188576    .0151037        2556
------------------------------------------------------------------------------

 ( 1)  - [educ0_sp]0 + [educ0_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0320884   .0237355     1.35   0.177    -.0145619    .0787387
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_sp |      1,625    .4486154    .4975057          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_sp |      2,556    .4233177    .4941815          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      4181
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       437
                                                  Population size  =      4181

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ1_sp       |
   treatcom==0 |   .4486154    .0189717        1625
   treatcom==1 |   .4233177    .0150984        2556
------------------------------------------------------------------------------

 ( 1)  - [educ1_sp]0 + [educ1_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0252977   .0242464    -1.04   0.297     -.072952    .0223566
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_sp |      1,625    .1673846    .3734338          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_sp |      2,556    .1568858    .3637642          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      4181
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       437
                                                  Population size  =      4181

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ2_sp       |
   treatcom==0 |   .1673846    .0120994        1625
   treatcom==1 |   .1568858      .00917        2556
------------------------------------------------------------------------------

 ( 1)  - [educ2_sp]0 + [educ2_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0104989   .0151818    -0.69   0.490    -.0403374    .0193397
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_sp |      1,625    .0972308    .2963629          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_sp |      2,556     .100939    .3013068          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      4181
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       437
                                                  Population size  =      4181

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ3_sp       |
   treatcom==0 |   .0972308     .008549        1625
   treatcom==1 |    .100939    .0072523        2556
------------------------------------------------------------------------------

 ( 1)  - [educ3_sp]0 + [educ3_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0037082   .0112108     0.33   0.741    -.0183257    .0257421
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage0_7_97 |      2,034    .3775811    .4849012          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage0_7_97 |      3,206    .3608858    .4803324          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5240
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5240

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage0_7_97     |
   treatcom==0 |   .3775811     .014947        2034
   treatcom==1 |   .3608858    .0148449        3206
------------------------------------------------------------------------------

 ( 1)  - [dage0_7_97]0 + [dage0_7_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0166953   .0210662    -0.79   0.428    -.0580972    .0247066
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dage8_17_97 |      2,034    .5432645    .4982472          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dage8_17_97 |      3,206    .5165315    .4998046          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5240
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5240

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage8_17_97    |
   treatcom==0 |   .5432645    .0147766        2034
   treatcom==1 |   .5165315     .012027        3206
------------------------------------------------------------------------------

 ( 1)  - [dage8_17_97]0 + [dage8_17_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.026733   .0190525    -1.40   0.161    -.0641773    .0107113
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dage18_54_97 |      2,034    .8982301    .3024198          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dage18_54_97 |      3,206     .886151    .3176774          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5240
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5240

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage18_54_97   |
   treatcom==0 |   .8982301    .0083742        2034
   treatcom==1 |    .886151    .0072835        3206
------------------------------------------------------------------------------

 ( 1)  - [dage18_54_97]0 + [dage18_54_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0120791   .0110984    -1.09   0.277    -.0338911    .0097329
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage55p_97 |      2,034      .46706    .4990365          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage55p_97 |      3,206    .4819089    .4997506          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5240
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5240

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage55p_97     |
   treatcom==0 |     .46706    .0122085        2034
   treatcom==1 |   .4819089     .011581        3206
------------------------------------------------------------------------------

 ( 1)  - [dage55p_97]0 + [dage55p_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0148489   .0168276     0.88   0.378    -.0182227    .0479205
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   homeown97 |      2,036    .9543222    .2088367          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   homeown97 |      3,209    .9607354     .194254          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5245
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5245

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
homeown97      |
   treatcom==0 |   .9543222    .0054451        2036
   treatcom==1 |   .9607354     .004343        3209
------------------------------------------------------------------------------

 ( 1)  - [homeown97]0 + [homeown97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0064132    .006965     0.92   0.358    -.0072752    .0201016
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dirtfloor97 |      2,036    .3305501    .4705268          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dirtfloor97 |      3,204    .3389513    .4734272          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5240
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5240

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dirtfloor97    |
   treatcom==0 |   .3305501    .0244676        2036
   treatcom==1 |   .3389513    .0188415        3204
------------------------------------------------------------------------------

 ( 1)  - [dirtfloor97]0 + [dirtfloor97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0084012   .0308814     0.27   0.786    -.0522907    .0690931
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
electrici~97 |      2,038    .9278705    .2587658          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
electrici~97 |      3,211    .8729368    .3330957          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5249
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5249

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
electricity97  |
   treatcom==0 |   .9278705    .0118983        2038
   treatcom==1 |   .8729368    .0171207        3211
------------------------------------------------------------------------------

 ( 1)  - [electricity97]0 + [electricity97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0549337   .0208492    -2.63   0.009    -.0959091   -.0139583
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       no497 |      2,014    .0834161    .2765788          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       no497 |      3,159    .0756569    .2644901          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5173
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       443
                                                  Population size  =      5173

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
no497          |
   treatcom==0 |   .0834161    .0087593        2014
   treatcom==1 |   .0756569     .007573        3159
------------------------------------------------------------------------------

 ( 1)  - [no497]0 + [no497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0077592   .0115791    -0.67   0.503    -.0305162    .0149977
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    small497 |      2,014    .4960278    .5001084          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    small497 |      3,159    .5371953    .4986935          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5173
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       443
                                                  Population size  =      5173

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
small497       |
   treatcom==0 |   .4960278    .0218465        2014
   treatcom==1 |   .5371953    .0158381        3159
------------------------------------------------------------------------------

 ( 1)  - [small497]0 + [small497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0411675   .0269836     1.53   0.128    -.0118647    .0941997
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      big497 |      2,014    .4205561    .4937709          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      big497 |      3,159    .3871478     .487175          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5173
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       443
                                                  Population size  =      5173

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
big497         |
   treatcom==0 |   .4205561    .0245565        2014
   treatcom==1 |   .3871478     .017887        3159
------------------------------------------------------------------------------

 ( 1)  - [big497]0 + [big497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0334083   .0303804    -1.10   0.272    -.0931162    .0262997
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  org_faenas |      2,038    .9435721    .2308027          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  org_faenas |      3,212    .9218555    .2684406          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5250
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5250

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
org_faenas     |
   treatcom==0 |   .9435721    .0216135        2038
   treatcom==1 |   .9218555    .0199068        3212
------------------------------------------------------------------------------

 ( 1)  - [org_faenas]0 + [org_faenas]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0217166   .0293841    -0.74   0.460    -.0794657    .0360326
------------------------------------------------------------------------------

.         foreach var of global cont_c {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if `var' >0 & wave ==0 & treatcom ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if `var' >0 & wave ==0, obs  by(treatcom);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post ineligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_hh |      2,037    50.33775     14.0008         15         87

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_hh |      3,211     50.6484    14.10113         16         88

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5248
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5248

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_hh         |
   treatcom==0 |   50.33775    .3664335        2037
   treatcom==1 |    50.6484    .3573573        3211
------------------------------------------------------------------------------

 ( 1)  - [age_hh]0 + [age_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3106445   .5118376     0.61   0.544    -.6952808     1.31657
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_sp |      1,628    45.05405    13.40677         14         80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_sp |      2,559    45.10864    13.72205         15         83

Survey mean estimation

pweight:  <none>                                  Number of obs    =      4187
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       437
                                                  Population size  =      4187

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_sp         |
   treatcom==0 |   45.05405     .412948        1628
   treatcom==1 |   45.10864    .3673341        2559
------------------------------------------------------------------------------

 ( 1)  - [age_sp]0 + [age_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0545821   .5526848     0.10   0.921    -1.031675     1.14084
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    hhsize97 |      2,038    4.904318    2.505991          1         19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    hhsize97 |      3,212    4.650996    2.433018          1         18

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5250
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5250

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
hhsize97       |
   treatcom==0 |   4.904318    .0968879        2038
   treatcom==1 |   4.650996    .0876385        3212
------------------------------------------------------------------------------

 ( 1)  - [hhsize97]0 + [hhsize97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2533217   .1306436    -1.94   0.053    -.5100784     .003435
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    min_dist |      2,038    93.15454    43.03457   9.465392   169.3153

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    min_dist |      3,212    95.22661    40.59531   13.31589    168.103

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5250
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5250

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
min_dist       |
   treatcom==0 |   93.15454    4.495937        2038
   treatcom==1 |   95.22661    3.452353        3212
------------------------------------------------------------------------------

 ( 1)  - [min_dist]0 + [min_dist]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.072065   5.668526     0.37   0.715    -9.068411    13.21254
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |      1,405     636.858     158.994        360       1440

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |      2,094    625.9199      158.94   303.1579       1200

Survey mean estimation

pweight:  <none>                                  Number of obs    =      3499
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       299
                                                  Population size  =      3499

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
up_cwagepm     |
   treatcom==0 |    636.858    16.14017        1405
   treatcom==1 |   625.9199    13.56028        2094
------------------------------------------------------------------------------

 ( 1)  - [up_cwagepm]0 + [up_cwagepm]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -10.93815   21.08047    -0.52   0.604    -52.42359     30.5473
------------------------------------------------------------------------------

. ***Characteristics entrepreneur -- use info in wave ==2 (Oct 98) because there is no infomration available at 
> baseline;
.         foreach var of global cont_ent {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==2 & treatcom ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean `var' if wave ==2, obs  by(treatcom);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post ineligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    age_ent1 |        271    47.45018    15.69372         15         81

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    age_ent1 |        440    47.96364    14.48913         13         82

Survey mean estimation

pweight:  <none>                                  Number of obs    =       711
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       246
                                                  Population size  =       711

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_ent1       |
   treatcom==0 |   47.45018    1.139029         271
   treatcom==1 |   47.96364     .896904         440
------------------------------------------------------------------------------

 ( 1)  - [age_ent1]0 + [age_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5134519   1.449767     0.35   0.724    -2.342145    3.369048
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   educ_ent1 |        255    3.529412    3.165718          0         16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   educ_ent1 |        405    3.197531     3.40435          0         15

Survey mean estimation

pweight:  <none>                                  Number of obs    =       660
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       231
                                                  Population size  =       660

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ_ent1      |
   treatcom==0 |   3.529412    .2207699         255
   treatcom==1 |   3.197531    .2346068         405
------------------------------------------------------------------------------

 ( 1)  - [educ_ent1]0 + [educ_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3318809   .3221486    -1.03   0.304    -.9666206    .3028588
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 female_ent1 |        271    .4723247    .5001571          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 female_ent1 |        440    .4681818    .4995546          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =       711
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       246
                                                  Population size  =       711

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
female_ent1    |
   treatcom==0 |   .4723247    .0435409         271
   treatcom==1 |   .4681818    .0321883         440
------------------------------------------------------------------------------

 ( 1)  - [female_ent1]0 + [female_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0041429   .0541469    -0.08   0.939    -.1107958      .10251
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  benef_ent1 |        255    .1803922    .3852699          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  benef_ent1 |        406    .2118227     .409104          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =       661
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       231
                                                  Population size  =       661

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
benef_ent1     |
   treatcom==0 |   .1803922    .0289002         255
   treatcom==1 |   .2118227    .0253455         406
------------------------------------------------------------------------------

 ( 1)  - [benef_ent1]0 + [benef_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0314305   .0384398     0.82   0.414    -.0443086    .1071696
------------------------------------------------------------------------------

. ***Dependent Variables;
.         foreach var of global dep97_d {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==0 & treatcom ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if wave ==0, obs  by(treatcom);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post ineligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani197 |      2,038    .4499509    .4976109          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani197 |      3,212    .4729141    .4993436          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5250
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5250

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ani197         |
   treatcom==0 |   .4499509    .0228351        2038
   treatcom==1 |   .4729141    .0191822        3212
------------------------------------------------------------------------------

 ( 1)  - [ani197]0 + [ani197]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0229631   .0298228     0.77   0.442    -.0356483    .0815746
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani297 |      2,038    .8331698    .3729157          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani297 |      3,212    .8508717    .3562703          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5250
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5250

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ani297         |
   treatcom==0 |   .8331698    .0126791        2038
   treatcom==1 |   .8508717    .0111826        3212
------------------------------------------------------------------------------

 ( 1)  - [ani297]0 + [ani297]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .017702   .0169059     1.05   0.296    -.0155236    .0509275
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      land97 |      2,038    .6928361    .4614312          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      land97 |      3,212    .7085928    .4544814          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      5250
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       445
                                                  Population size  =      5250

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
land97         |
   treatcom==0 |   .6928361    .0185041        2038
   treatcom==1 |   .7085928    .0157361        3212
------------------------------------------------------------------------------

 ( 1)  - [land97]0 + [land97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0157567   .0242905     0.65   0.517    -.0319819    .0634952
------------------------------------------------------------------------------

.         foreach var of global dep97_c {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if `var' >0 & wave ==0 & treatcom ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if  `var' >0 & wave ==0, obs  by(treatcom);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post ineligibles  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani197 |        912    2168.847     3013.93   173.7144   46857.89

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani197 |      1,513    2334.446    3095.655    107.433   42512.15

Survey mean estimation

pweight:  <none>                                  Number of obs    =      2425
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       396
                                                  Population size  =      2425

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
vani197        |
   treatcom==0 |   2168.847    154.4758         912
   treatcom==1 |   2334.446    120.6834        1513
------------------------------------------------------------------------------

 ( 1)  - [vani197]0 + [vani197]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   165.5991   196.0287     0.84   0.399    -219.7909    550.9891
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani297 |      1,690    4864.523    7962.966   16.95261   55189.18

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani297 |      2,720    5234.029    8347.037   15.19086   75397.09

Survey mean estimation

pweight:  <none>                                  Number of obs    =      4410
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       442
                                                  Population size  =      4410

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
vani297        |
   treatcom==0 |   4864.523    428.6087        1690
   treatcom==1 |   5234.029    312.5703        2720
------------------------------------------------------------------------------

 ( 1)  - [vani297]0 + [vani297]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   369.5064   530.4768     0.70   0.486    -673.0702    1412.083
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ha97 |      1,370    4.583212    4.016858          1         24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ha97 |      2,206    4.395739    4.312378          1         24

Survey mean estimation

pweight:  <none>                                  Number of obs    =      3576
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       425
                                                  Population size  =      3576

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ha97           |
   treatcom==0 |   4.583212    .2325508        1370
   treatcom==1 |   4.395739    .2291878        2206
------------------------------------------------------------------------------

 ( 1)  - [ha97]0 + [ha97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1874728   .3265072    -0.57   0.566     -.829247    .4543014
------------------------------------------------------------------------------

. postclose ineligibles;

. restore;

. *=========================================================
>   Animal Prices (Community Selling Prices)  -- Table A2, Panel B
>         - Use information from wave 2 (Oct 98) as there is no information on animal prices at baseline. 
>         - The animal prices (community averaged) are constructed using household reports on value of animals s
> old in October 1998 and May 1999
> *=========================================================;
. gl prices csprice1_av csprice2_av csprice3_av csprice4_av csprice5_av csprice6_av csprice7_av csprice8_av;

. preserve;

. keep if wave ==2;
(134,168 observations deleted)

.  bys comuid wave: g counter_comu =_n;

. keep if counter_comu ==1;
(23,297 observations deleted)

.  *one observation per community;
. postfile aprices str20 name obstret treat tstd obscont control cstd  tstat using "$out_p/aprices.dta", replace
> ;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/aprices.dta not fo
> und)

. foreach var of global prices {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if treatcom ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var', obs  by(treatcom);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post aprices (name) (N1) (coef1) (std1) (N0) (coef0) (std0)  (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice1_av |        186    263.0658    43.90013   169.5261   399.0511

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice1_av |        320    264.2261    43.57884   179.0549   383.8159

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice1_av    |
   treatcom==0 |   263.0658    3.213426         186
   treatcom==1 |   264.2261    2.434729         320
------------------------------------------------------------------------------

 ( 1)  - [csprice1_av]0 + [csprice1_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.160291   4.031626     0.29   0.774    -6.760534    9.081117
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice2_av |        186    1805.362    282.2493   935.7175   2579.068

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice2_av |        320    1845.146    277.8853   1137.154   2706.711

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice2_av    |
   treatcom==0 |   1805.362    20.66024         186
   treatcom==1 |   1845.146    15.52532         320
------------------------------------------------------------------------------

 ( 1)  - [csprice2_av]0 + [csprice2_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   39.78416    25.8434     1.54   0.124    -10.98965    90.55797
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice3_av |        186    27.96218    7.748639   16.95261   53.42842

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice3_av |        320    28.33978    8.115058   18.19081   69.84179

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice3_av    |
   treatcom==0 |   27.96218    .5671892         186
   treatcom==1 |   28.33978    .4533844         320
------------------------------------------------------------------------------

 ( 1)  - [csprice3_av]0 + [csprice3_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3775986   .7261274     0.52   0.603    -1.049004    1.804201
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice4_av |        186    302.0517    80.04493   124.7623   575.7238

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice4_av |        320    299.1062    80.76989   109.2391   613.1054

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice4_av    |
   treatcom==0 |   302.0517    5.859173         186
   treatcom==1 |   299.1062    4.512575         320
------------------------------------------------------------------------------

 ( 1)  - [csprice4_av]0 + [csprice4_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -2.94551   7.395488    -0.40   0.691    -17.47522     11.5842
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice5_av |        186     69.5468    84.83836   15.19086   248.9485

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice5_av |        320    75.92362    98.57262   15.19086   895.2747

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice5_av    |
   treatcom==0 |    69.5468    6.210045         186
   treatcom==1 |   75.92362    5.507205         320
------------------------------------------------------------------------------

 ( 1)  - [csprice5_av]0 + [csprice5_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   6.376822   8.300239     0.77   0.443     -9.93043    22.68407
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice6_av |        186    1013.011    328.0383    663.811   1695.261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice6_av |        320    1004.214      345.01   447.6373   1716.202

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice6_av    |
   treatcom==0 |   1013.011    24.01193         186
   treatcom==1 |   1004.214    19.27554         320
------------------------------------------------------------------------------

 ( 1)  - [csprice6_av]0 + [csprice6_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -8.797494   30.79155    -0.29   0.775     -69.2928    51.69781
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice7_av |        186    301.3518    77.22709   173.7144   388.5803

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice7_av |        320    288.8537    81.64986    107.433   537.1648

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice7_av    |
   treatcom==0 |   301.3518    5.652911         186
   treatcom==1 |   288.8537    4.561738         320
------------------------------------------------------------------------------

 ( 1)  - [csprice7_av]0 + [csprice7_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -12.49805   7.263942    -1.72   0.086    -26.76932    1.773219
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice8_av |        186    2429.888    485.2609   1895.257    3742.87

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 csprice8_av |        320    2439.539    491.5538   1895.257   3838.159

Survey mean estimation

pweight:  <none>                                  Number of obs    =       506
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       506
                                                  Population size  =       506

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
csprice8_av    |
   treatcom==0 |   2429.888     35.5204         186
   treatcom==1 |   2439.539    27.46287         320
------------------------------------------------------------------------------

 ( 1)  - [csprice8_av]0 + [csprice8_av]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   9.650428   44.89886     0.21   0.830    -78.56114      97.862
------------------------------------------------------------------------------

. postclose aprices;

. restore;

. *========================================================
>    Community Wages -- Table A2, Panel A
> *========================================================;
. gl cwages up_cwagepm up_cwagepw up_cwagepc;

. preserve;

. keep if wave >=2 & wave <=4;
(89,079 observations deleted)

. bys comuid wave: g counter_comu =_n;

. keep if counter_comu ==1;
(67,387 observations deleted)

.  *one observation per community;
. postfile cwages str20 name obstret treat tstd obscont control cstd tstat using "$out_p/cwages.dta", replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/cwages.dta not fou
> nd)

. foreach var of global cwages {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if treatcom ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var', obs  by(treatcom);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post cwages (name) (N1) (coef1) (std1) (N0) (coef0) (std0)  (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |        514    616.9965    195.0953   3.620742   1508.402

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |        908    605.0948    201.5113   2.828253   1792.267

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1422
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       504
                                                  Population size  =      1422

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
up_cwagepm     |
   treatcom==0 |   616.9965    13.21437         514
   treatcom==1 |   605.0948    10.15573         908
------------------------------------------------------------------------------

 ( 1)  - [up_cwagepm]0 + [up_cwagepm]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -11.90165   16.66609    -0.71   0.475    -44.64536    20.84207
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepw |        514    386.2275    286.5168          0   1131.301

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepw |        908    390.1225    289.5429          0   1301.894

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1422
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       504
                                                  Population size  =      1422

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
up_cwagepw     |
   treatcom==0 |   386.2275    15.76882         514
   treatcom==1 |   390.1225    12.93757         908
------------------------------------------------------------------------------

 ( 1)  - [up_cwagepw]0 + [up_cwagepw]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.894993   20.39697     0.19   0.849    -36.17876    43.96874
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepc |        514     290.347    248.0854          0   1086.222

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepc |        908     311.413    262.7581          0   1303.467

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1422
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       504
                                                  Population size  =      1422

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
up_cwagepc     |
   treatcom==0 |    290.347    12.90009         514
   treatcom==1 |    311.413    10.98193         908
------------------------------------------------------------------------------

 ( 1)  - [up_cwagepc]0 + [up_cwagepc]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   21.06602   16.94152     1.24   0.214    -12.21884    54.35088
------------------------------------------------------------------------------

. postclose cwages;

. restore;

. *========================================
>   Analysis of Attrition
> *========================================;
. ***Flag attriters -- per wave;
. sort state muni local folio wave;

. by state muni local folio: g out0_2 =(wave[_n] ==0 & (wave[_n+1] ==3 | wave[_n+1] ==4 | wave[_n+1] ==5 | wave[
> _n+1] ==6 | wave[_n+1] ==7));

. sort state muni local folio wave;

. by state muni local folio: g out2_3 =(wave[_n] ==2 & (wave[_n+1] ==4 | wave[_n+1] ==5 | wave[_n+1] ==6 | wave[
> _n+1] ==7));

. sort state muni local folio wave;

. by state muni local folio: g out3_4 =(wave[_n] ==3 & (wave[_n+1] ==5 | wave[_n+1] ==6 | wave[_n+1] ==7));

. sort state muni local folio wave;

. by state muni local folio: g out4_5 =(wave[_n] ==4 & (wave[_n+1] ==6 | wave[_n+1] ==7));

. sort state muni local folio wave;

. by state muni local folio: g out5_6 =(wave[_n] ==5 & (wave[_n+1] ==7));

. g byte out_in_temp =(out0_2 ==1 | out2_3 ==1 | out3_4 ==1 | out4_5 ==1 | out5_6 ==1);

. bys state muni local folio: egen out_in =max(out_in_temp);

. label var out_in "(hh) =1 if household leaves the sample and comes back in";

. tab out_in panel_balanced_2;

(hh) =1 if |
 household |
leaves the |  (hh) Balanced panel
sample and | waves 0 through 7 = 1
comes back |   (excludes wave 1)
        in |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,928    100,289 |   119,217 
         1 |    38,754          0 |    38,754 
-----------+----------------------+----------
     Total |    57,682    100,289 |   157,971 

. g byte pureat =(panel_balanced_2 ==0 & out_in ==0);

. label var pureat "(hh) =1 if household is a pure attriter -never comes back in the sample";

. ta pureat if t2_c1_op ~=. & wave ==0;

 (hh) =1 if |
  household |
  is a pure |
   attriter |
     -never |
 comes back |
     in the |
     sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,054       89.86       89.86
          1 |      1,248       10.14      100.00
------------+-----------------------------------
      Total |     12,302      100.00

. ta pureat wave if t2_c1_op ~=. & wave ==0, col;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

(hh) =1 if |
 household |
 is a pure |
  attriter |
    -never |
comes back |
    in the |    Wave
    sample |         0 |     Total
-----------+-----------+----------
         0 |    11,054 |    11,054 
           |     89.86 |     89.86 
-----------+-----------+----------
         1 |     1,248 |     1,248 
           |     10.14 |     10.14 
-----------+-----------+----------
     Total |    12,302 |    12,302 
           |    100.00 |    100.00 

. bys t2_c1_op: ta pureat if wave ==0;

----------------------------------------------------------------------------------------------------------------
-> t2_c1_op = 0

 (hh) =1 if |
  household |
  is a pure |
   attriter |
     -never |
 comes back |
     in the |
     sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,186       90.14       90.14
          1 |        458        9.86      100.00
------------+-----------------------------------
      Total |      4,644      100.00

----------------------------------------------------------------------------------------------------------------
-> t2_c1_op = 1

 (hh) =1 if |
  household |
  is a pure |
   attriter |
     -never |
 comes back |
     in the |
     sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,868       89.68       89.68
          1 |        790       10.32      100.00
------------+-----------------------------------
      Total |      7,658      100.00

----------------------------------------------------------------------------------------------------------------
-> t2_c1_op = .

 (hh) =1 if |
  household |
  is a pure |
   attriter |
     -never |
 comes back |
     in the |
     sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,975       86.71       86.71
          1 |      1,529       13.29      100.00
------------+-----------------------------------
      Total |     11,504      100.00


. reg pureat t2_c1_op if wave ==0, cl(comuid);

Linear regression                               Number of obs     =     12,302
                                                F(1, 500)         =       0.21
                                                Prob > F          =     0.6487
                                                R-squared         =     0.0001
                                                Root MSE          =     .30194

                               (Std. Err. adjusted for 501 clusters in comuid)
------------------------------------------------------------------------------
             |               Robust
      pureat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    t2_c1_op |   .0045382   .0099569     0.46   0.649    -.0150243    .0241008
       _cons |   .0986219   .0086556    11.39   0.000      .081616    .1156277
------------------------------------------------------------------------------

. reg pureat t1_c2_op if wave ==0, cl(comuid);

Linear regression                               Number of obs     =     10,978
                                                F(1, 500)         =       4.83
                                                Prob > F          =     0.0284
                                                R-squared         =     0.0010
                                                Root MSE          =     .23879

                               (Std. Err. adjusted for 501 clusters in comuid)
------------------------------------------------------------------------------
             |               Robust
      pureat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    t1_c2_op |   .0153644   .0069887     2.20   0.028     .0016336    .0290953
       _cons |   .0512142   .0056547     9.06   0.000     .0401043    .0623241
------------------------------------------------------------------------------

. *====================================================================================
>  Covariates & Dependent Vars at Baseline (wave 0): Attriter Households
> *====================================================================================;
. keep if pureat ==0;
(18,928 observations deleted)

. **Covariates;
. postfile nonattriters str20 name obstret treat tstd obscont control cstd tstat using "$out_p/nonattriters.dta"
> , replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/nonattriters.dta n
> ot found)

.         foreach var of global cont_d {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post nonattriters  (name) (N1) (coef1) (std1) (N0) (coef0) (std0)  (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   female_hh |      4,186    .0783564    .2687637          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   female_hh |      6,868    .0774607    .2673405          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11054
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11054

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
female_hh      |
   t2_c1_op==0 |   .0783564    .0049603        4186
   t2_c1_op==1 |   .0774607    .0042851        6868
------------------------------------------------------------------------------

 ( 1)  - [female_hh]0 + [female_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0008957   .0065548    -0.14   0.891    -.0137742    .0119828
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ethnicity_hh |      4,178    .4447104    .4969931          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ethnicity_hh |      6,857    .4258422    .4945061          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11035
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11035

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ethnicity_hh   |
   t2_c1_op==0 |   .4447104    .0442108        4178
   t2_c1_op==1 |   .4258422    .0341984        6857
------------------------------------------------------------------------------

 ( 1)  - [ethnicity_hh]0 + [ethnicity_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0188682   .0558939    -0.34   0.736    -.1286845    .0909481
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_hh |      4,181    .3264769    .4689801          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_hh |      6,845    .3124909    .4635426          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11026
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11026

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ0_hh       |
   t2_c1_op==0 |   .3264769    .0164616        4181
   t2_c1_op==1 |   .3124909    .0146735        6845
------------------------------------------------------------------------------

 ( 1)  - [educ0_hh]0 + [educ0_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0139861   .0220521    -0.63   0.526    -.0573125    .0293404
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_hh |      4,181    .4711791    .4992284          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_hh |      6,845    .4660336    .4988814          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11026
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11026

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ1_hh       |
   t2_c1_op==0 |   .4711791    .0127623        4181
   t2_c1_op==1 |   .4660336    .0113818        6845
------------------------------------------------------------------------------

 ( 1)  - [educ1_hh]0 + [educ1_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0051455   .0171004    -0.30   0.764    -.0387432    .0284521
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_hh |      4,181    .1549868    .3619354          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_hh |      6,845    .1687363    .3745462          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11026
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11026

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ2_hh       |
   t2_c1_op==0 |   .1549868    .0111518        4181
   t2_c1_op==1 |   .1687363    .0086902        6845
------------------------------------------------------------------------------

 ( 1)  - [educ2_hh]0 + [educ2_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0137495    .014138     0.97   0.331    -.0140279    .0415268
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_hh |      4,181    .0473571    .2124269          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_hh |      6,845    .0527392    .2235287          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11026
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11026

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ3_hh       |
   t2_c1_op==0 |   .0473571    .0049409        4181
   t2_c1_op==1 |   .0527392     .004546        6845
------------------------------------------------------------------------------

 ( 1)  - [educ3_hh]0 + [educ3_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0053821   .0067141     0.80   0.423    -.0078093    .0185735
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_sp |      3,711    .3761789    .4844911          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ0_sp |      6,059    .3632613    .4809789          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      9770
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       499
                                                  Population size  =      9770

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ0_sp       |
   t2_c1_op==0 |   .3761789    .0208174        3711
   t2_c1_op==1 |   .3632613    .0186008        6059
------------------------------------------------------------------------------

 ( 1)  - [educ0_sp]0 + [educ0_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0129177   .0279169    -0.46   0.644     -.067767    .0419317
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_sp |      3,711    .4128267    .4924085          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ1_sp |      6,059     .419046    .4934437          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      9770
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       499
                                                  Population size  =      9770

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ1_sp       |
   t2_c1_op==0 |   .4128267    .0155691        3711
   t2_c1_op==1 |    .419046     .012477        6059
------------------------------------------------------------------------------

 ( 1)  - [educ1_sp]0 + [educ1_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0062193   .0199518     0.31   0.755    -.0329808    .0454194
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_sp |      3,711     .165993    .3721245          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ2_sp |      6,059    .1794025    .3837207          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      9770
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       499
                                                  Population size  =      9770

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ2_sp       |
   t2_c1_op==0 |    .165993     .011246        3711
   t2_c1_op==1 |   .1794025     .008849        6059
------------------------------------------------------------------------------

 ( 1)  - [educ2_sp]0 + [educ2_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0134095     .01431     0.94   0.349    -.0147059     .041525
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_sp |      3,711    .0450013     .207335          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    educ3_sp |      6,059    .0382901    .1919117          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      9770
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       499
                                                  Population size  =      9770

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ3_sp       |
   t2_c1_op==0 |   .0450013    .0050521        3711
   t2_c1_op==1 |   .0382901    .0036355        6059
------------------------------------------------------------------------------

 ( 1)  - [educ3_sp]0 + [educ3_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0067112   .0062242    -1.08   0.281    -.0189401    .0055177
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage0_7_97 |      4,184    .7736616    .4185107          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage0_7_97 |      6,857    .7557241    .4296884          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11041
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11041

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage0_7_97     |
   t2_c1_op==0 |   .7736616    .0091641        4184
   t2_c1_op==1 |   .7557241     .008097        6857
------------------------------------------------------------------------------

 ( 1)  - [dage0_7_97]0 + [dage0_7_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0179375   .0122287    -1.47   0.143    -.0419637    .0060887
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dage8_17_97 |      4,184      .70913    .4542179          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dage8_17_97 |      6,857    .7014729    .4576453          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11041
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11041

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage8_17_97    |
   t2_c1_op==0 |     .70913    .0087313        4184
   t2_c1_op==1 |   .7014729    .0075139        6857
------------------------------------------------------------------------------

 ( 1)  - [dage8_17_97]0 + [dage8_17_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0076571   .0115193    -0.66   0.507    -.0302893    .0149752
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dage18_54_97 |      4,184     .957457    .2018486          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
dage18_54_97 |      6,857    .9528949    .2118792          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11041
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11041

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage18_54_97   |
   t2_c1_op==0 |    .957457     .003687        4184
   t2_c1_op==1 |   .9528949    .0033097        6857
------------------------------------------------------------------------------

 ( 1)  - [dage18_54_97]0 + [dage18_54_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0045621   .0049547    -0.92   0.358    -.0142967    .0051724
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage55p_97 |      4,184    .2731836    .4456476          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dage55p_97 |      6,857    .2730057    .4455362          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11041
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11041

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dage55p_97     |
   t2_c1_op==0 |   .2731836    .0098356        4184
   t2_c1_op==1 |   .2730057    .0066821        6857
------------------------------------------------------------------------------

 ( 1)  - [dage55p_97]0 + [dage55p_97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0001779   .0118907    -0.01   0.988    -.0235399    .0231842
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   homeown97 |      4,185    .9292712    .2564019          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   homeown97 |      6,866    .9397029    .2380538          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11051
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11051

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
homeown97      |
   t2_c1_op==0 |   .9292712    .0072127        4185
   t2_c1_op==1 |   .9397029     .004513        6866
------------------------------------------------------------------------------

 ( 1)  - [homeown97]0 + [homeown97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0104317   .0085082     1.23   0.221    -.0062847     .027148
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dirtfloor97 |      4,173    .7531752    .4312156          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 dirtfloor97 |      6,856    .7317678    .4430715          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11029
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11029

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
dirtfloor97    |
   t2_c1_op==0 |   .7531752    .0204153        4173
   t2_c1_op==1 |   .7317678    .0159549        6856
------------------------------------------------------------------------------

 ( 1)  - [dirtfloor97]0 + [dirtfloor97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0214074   .0259103    -0.83   0.409    -.0723142    .0294994
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
electrici~97 |      4,184    .6147228    .4867189          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
electrici~97 |      6,864    .5852273    .4927187          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11048
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11048

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
electricity97  |
   t2_c1_op==0 |   .6147228     .032062        4184
   t2_c1_op==1 |   .5852273    .0286427        6864
------------------------------------------------------------------------------

 ( 1)  - [electricity97]0 + [electricity97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0294955   .0429928    -0.69   0.493    -.1139646    .0549737
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       no497 |      4,174    .1109248    .3140766          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       no497 |      6,848    .0974007    .2965243          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11022
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11022

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
no497          |
   t2_c1_op==0 |   .1109248    .0107495        4174
   t2_c1_op==1 |   .0974007    .0071313        6848
------------------------------------------------------------------------------

 ( 1)  - [no497]0 + [no497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0135241   .0128998    -1.05   0.295    -.0388688    .0118206
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    small497 |      4,174    .6621945    .4730185          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    small497 |      6,848    .7016647    .4575608          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11022
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11022

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
small497       |
   t2_c1_op==0 |   .6621945    .0152895        4174
   t2_c1_op==1 |   .7016647    .0110245        6848
------------------------------------------------------------------------------

 ( 1)  - [small497]0 + [small497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0394702   .0188496     2.09   0.037     .0024359    .0765045
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      big497 |      4,174    .2268807     .418865          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      big497 |      6,848    .2009346    .4007285          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11022
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11022

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
big497         |
   t2_c1_op==0 |   .2268807    .0151349        4174
   t2_c1_op==1 |   .2009346     .011846        6848
------------------------------------------------------------------------------

 ( 1)  - [big497]0 + [big497]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0259461   .0192196    -1.35   0.178    -.0637073    .0118151
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  org_faenas |      4,186    .8757764    .3298759          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  org_faenas |      6,868    .8762376    .3293342          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11054
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11054

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
org_faenas     |
   t2_c1_op==0 |   .8757764     .036813        4186
   t2_c1_op==1 |   .8762376    .0292185        6868
------------------------------------------------------------------------------

 ( 1)  - [org_faenas]0 + [org_faenas]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0004612   .0469991     0.01   0.992    -.0918793    .0928017
------------------------------------------------------------------------------

.         foreach var of global cont_c {;
  2.         gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if `var' >0 & wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if `var' >0 & wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post nonattriters  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_hh |      4,185    42.49797    14.32977         15         88

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_hh |      6,867    42.02985    13.89566         14         88

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11052
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11052

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_hh         |
   t2_c1_op==0 |   42.49797    .3427033        4185
   t2_c1_op==1 |   42.02985     .234484        6867
------------------------------------------------------------------------------

 ( 1)  - [age_hh]0 + [age_hh]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.468116   .4152449    -1.13   0.260     -1.28396    .3477279
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_sp |      3,717    36.44095    12.08227         14         85

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      age_sp |      6,071    36.51194    12.16722         14         88

Survey mean estimation

pweight:  <none>                                  Number of obs    =      9788
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       499
                                                  Population size  =      9788

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_sp         |
   t2_c1_op==0 |   36.44095    .2866305        3717
   t2_c1_op==1 |   36.51194    .2110544        6071
------------------------------------------------------------------------------

 ( 1)  - [age_sp]0 + [age_sp]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .070995   .3559508     0.20   0.842    -.6283555    .7703455
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    hhsize97 |      4,186    6.047301    2.399653          1         17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    hhsize97 |      6,868    5.986605    2.414665          1         24

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11054
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11054

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
hhsize97       |
   t2_c1_op==0 |   6.047301    .0569851        4186
   t2_c1_op==1 |   5.986605    .0478424        6868
------------------------------------------------------------------------------

 ( 1)  - [hhsize97]0 + [hhsize97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.060696   .0744056    -0.82   0.415    -.2068829     .085491
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    min_dist |      4,186    104.5713    44.04889   9.465392   169.3153

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    min_dist |      6,868    108.1667    41.37338   13.31589   170.4576

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11054
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11054

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
min_dist       |
   t2_c1_op==0 |   104.5713    4.086624        4186
   t2_c1_op==1 |   108.1667    3.025338        6868
------------------------------------------------------------------------------

 ( 1)  - [min_dist]0 + [min_dist]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.595383     5.0846     0.71   0.480    -6.394481    13.58525
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |      2,507    582.6019    172.8591        360       1440

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  up_cwagepm |      3,996    571.6583    171.2453   303.1579       1200

Survey mean estimation

pweight:  <none>                                  Number of obs    =      6503
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       331
                                                  Population size  =      6503

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
up_cwagepm     |
   t2_c1_op==0 |   582.6019    19.67614        2507
   t2_c1_op==1 |   571.6583    15.57165        3996
------------------------------------------------------------------------------

 ( 1)  - [up_cwagepm]0 + [up_cwagepm]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -10.94364   25.09236    -0.44   0.663     -60.3048    38.41752
------------------------------------------------------------------------------

. ***Characteristics entrepreneur -- use info in wave ==2 (Oct 98) because there is no infomration availabel at 
> baseline;
.         foreach var of global cont_ent {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==2 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if wave ==2, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post nonattriters  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    age_ent1 |        308     40.4026    13.86323          4         82

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    age_ent1 |        766    40.43864    13.92785          0         81

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1074
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       299
                                                  Population size  =      1074

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
age_ent1       |
   t2_c1_op==0 |    40.4026    .8737202         308
   t2_c1_op==1 |   40.43864    .6080843         766
------------------------------------------------------------------------------

 ( 1)  - [age_ent1]0 + [age_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0360449   1.064497     0.03   0.973    -2.058839    2.130928
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   educ_ent1 |        305    2.609836    2.535323          0         12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   educ_ent1 |        762    2.729003    2.710831          0         13

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1067
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       298
                                                  Population size  =      1067

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
educ_ent1      |
   t2_c1_op==0 |   2.609836    .1862522         305
   t2_c1_op==1 |   2.729003    .1704942         762
------------------------------------------------------------------------------

 ( 1)  - [educ_ent1]0 + [educ_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1191666   .2525038     0.47   0.637    -.3777567    .6160898
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 female_ent1 |        308    .5162338    .5005496          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 female_ent1 |        766    .5234987    .4997738          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1074
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       299
                                                  Population size  =      1074

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
female_ent1    |
   t2_c1_op==0 |   .5162338    .0636469         308
   t2_c1_op==1 |   .5234987    .0305697         766
------------------------------------------------------------------------------

 ( 1)  - [female_ent1]0 + [female_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0072649   .0706076     0.10   0.918    -.1316877    .1462175
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  benef_ent1 |        306    .3496732    .4776478          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  benef_ent1 |        762     .343832    .4752978          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =      1068
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       297
                                                  Population size  =      1068

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
benef_ent1     |
   t2_c1_op==0 |   .3496732    .0425232         306
   t2_c1_op==1 |    .343832    .0245117         762
------------------------------------------------------------------------------

 ( 1)  - [benef_ent1]0 + [benef_ent1]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0058412   .0490821    -0.12   0.905    -.1024353    .0907529
------------------------------------------------------------------------------

. ***Dependent Variables;
.         foreach var of global dep97_d {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post nonattriters  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani197 |      4,186     .328237    .4696277          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani197 |      6,868    .3507571    .4772418          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11054
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11054

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ani197         |
   t2_c1_op==0 |    .328237     .017562        4186
   t2_c1_op==1 |   .3507571    .0160686        6868
------------------------------------------------------------------------------

 ( 1)  - [ani197]0 + [ani197]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0225202   .0238039     0.95   0.345     -.024248    .0692883
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani297 |      4,185    .8241338    .3807518          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ani297 |      6,867    .8178244    .3860173          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11052
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11052

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ani297         |
   t2_c1_op==0 |   .8241338    .0137375        4185
   t2_c1_op==1 |   .8178244    .0115186        6867
------------------------------------------------------------------------------

 ( 1)  - [ani297]0 + [ani297]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0063094   .0179276    -0.35   0.725    -.0415323    .0289134
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      land97 |      4,186    .5735786    .4946156          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      land97 |      6,868    .6023588    .4894462          0          1

Survey mean estimation

pweight:  <none>                                  Number of obs    =     11054
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =     11054

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
land97         |
   t2_c1_op==0 |   .5735786      .02294        4186
   t2_c1_op==1 |   .6023588    .0180267        6868
------------------------------------------------------------------------------

 ( 1)  - [land97]0 + [land97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0287802   .0291754     0.99   0.324    -.0285416    .0861019
------------------------------------------------------------------------------

.         foreach var of global dep97_c {;
  2.                 gen str20 name="`var'" ;
  3.                 foreach y in 0 1 {;
  4.                         sum `var' if `var' >0 & wave ==0 & t2_c1_op ==`y';
  5.                         scalar coef`y' =r(mean);
  6.                         scalar std`y' =r(sd);
  7.                         scalar N`y' =r(N);
  8.                 };
  9.                 svymean  `var' if  `var' >0 & wave ==0, obs  by(t2_c1_op);
 10.                 svylc [`var']1 - [`var']0;
 11.                 gen difttest=r(est)/r(se);
 12.                 post nonattriters  (name) (N1) (coef1) (std1) (N0) (coef0) (std0) (difttest);
 13.                 drop difttest name;
 14.                 scalar drop _all;
 15.         };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani197 |      1,371    1641.403    2298.068   173.7144   50688.73

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani197 |      2,402     1691.42    2230.875    107.433   37905.14

Survey mean estimation

pweight:  <none>                                  Number of obs    =      3773
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       461
                                                  Population size  =      3773

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
vani197        |
   t2_c1_op==0 |   1641.403    110.4415        1371
   t2_c1_op==1 |    1691.42    82.47216        2402
------------------------------------------------------------------------------

 ( 1)  - [vani197]0 + [vani197]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   50.01669   137.8368     0.36   0.717    -220.8512    320.8846
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani297 |      3,441    2237.305    4406.473   19.19079   63729.17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     vani297 |      5,609    2246.037    4349.552   15.19086   61180.48

Survey mean estimation

pweight:  <none>                                  Number of obs    =      9050
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       500
                                                  Population size  =      9050

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
vani297        |
   t2_c1_op==0 |   2237.305    159.7635        3441
   t2_c1_op==1 |   2246.037     124.105        5609
------------------------------------------------------------------------------

 ( 1)  - [vani297]0 + [vani297]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   8.732048   202.3028     0.04   0.966    -388.7382    406.2023
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ha97 |      2,350    3.034894    2.944003          1         24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ha97 |      4,048    2.700099    2.760514          1         24

Survey mean estimation

pweight:  <none>                                  Number of obs    =      6398
Strata:   <one>                                   Number of strata =         1
PSU:      comuid                                  Number of PSUs   =       485
                                                  Population size  =      6398

------------------------------------------------------------------------------
Mean   Subpop. |   Estimate    Std. Err.        Obs
---------------+--------------------------------------------------------------
ha97           |
   t2_c1_op==0 |   3.034894    .1403635        2350
   t2_c1_op==1 |   2.700099    .1003413        4048
------------------------------------------------------------------------------

 ( 1)  - [ha97]0 + [ha97]1 = 0

------------------------------------------------------------------------------
        Mean |   Estimate   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3347948   .1725407    -1.94   0.053    -.6738161    .0042265
------------------------------------------------------------------------------

. postclose nonattriters;

. log close;
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/investments_
> des.log
  log type:  text
 closed on:  29 Nov 2019, 13:16:35
----------------------------------------------------------------------------------------------------------------
