-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/production_income_credit.
> log
  log type:  text
 opened on:  29 Nov 2019, 15:31:23

. use "$data/investments_data.dta";
(Complete Investments Data Base)

. *==============================
>  Estimation Sample: keep hh with non-missing info on any of the dependent vars (draft animals, prod animals, land & micro-e
> nterprise)
> *==============================;
. keep if wave ==2 | wave ==3 | wave ==4;
(89,079 observations deleted)

. replace land =. if ha ==.;
(403 real changes made, 403 to missing)

. g byte all =(ani1 ~=. & ani2 ~=. & land ~=. & me~=.);

. keep if all ==1;
(420 observations deleted)

. *=================================
>  Wave Dummies & Other Variables
> *=================================;
. ***Wave Dummies;
. foreach x in 2 3 4 {;
  2.         g byte wave`x' =(wave ==`x');
  3. };

. foreach x in farm cons emerg {;
  2.         replace credit_`x' =0 if credit ==0 & credit_`x' ==.;
  3. };
(43,908 real changes made)
(43,908 real changes made)
(43,908 real changes made)

. ***Total Value Home Production -- i.e. Total Agricultural Income (monthly) =
>         = value of home produced consumption (monthly) + value of crop sales (crop_sales/12) 
>         + value of animal sales (animal_sales_a/6) +
>         + value of animal derivatives sold (animal_prod_sales_amount -- monthly & only available for 98o -- so narrow def);
. g crop_sales_m   = crop_sales/12;
(64,149 missing values generated)

. g ani_sales_a_m  = ani_sales_a/6;
(66,740 missing values generated)

. egen home_prod_tot_w3           =rsum(crop_sales_m ani_sales_a_m homeprod ani_prod_sales_a);

. replace home_prod_tot_w3        =. if (crop_sales_m ==. & ani_sales_a_m ==. & homeprod ==. & ani_prod_sales_a ==.);
(22,851 real changes made, 22,851 to missing)

. egen home_prod_tot              =rsum(crop_sales_m ani_sales_a_m homeprod);

. replace home_prod_tot   =. if (crop_sales_m ==. & ani_sales_a_m ==. & homeprod ==.);
(22,851 real changes made, 22,851 to missing)

. foreach x in crop_sales_m ani_sales_a_m ani_prod_sales_a home_prod_tot home_prod_tot_w3 ag_exp {;
  2.         g `x'_pp_ae = `x'/hhsize_ae;
  3.         g `x'_pp_ae2 = `x'/hhsize_ae2;
  4. };
(64,154 missing values generated)
(64,154 missing values generated)
(66,742 missing values generated)
(66,742 missing values generated)
(44,872 missing values generated)
(44,872 missing values generated)
(22,922 missing values generated)
(22,922 missing values generated)
(22,922 missing values generated)
(22,922 missing values generated)
(48,639 missing values generated)
(48,639 missing values generated)

. lab var home_prod_tot                   "Total Farm Income - home prod + crop sales + ani sales (monthly)";

. lab var home_prod_tot_pp_ae             "Total Farm Income - home prod + crop sales + ani sales (monthly pp ae - original)"
> ;
note: label truncated to 80 characters

. lab var home_prod_tot_pp_ae2    "Total Farm Income - home prod + crop sales + ani sales (monthly pp ae - Di Maro)";

. lab var home_prod_tot_w3                "Total Farm Income - home prod + crop sales + ani sales + ani prod sales (monthly)
>                                                                 only for wave 3";
note: label truncated to 80 characters

. lab var home_prod_tot_w3_pp_ae  "Total Farm Income - home prod + crop sales + ani sales + ani prod sales (monthly pp ae 
>                                                                 - original) only for wave 3";
note: label truncated to 80 characters

. lab var home_prod_tot_w3_pp_ae2 "Total Farm Income - home prod + crop sales + ani sales + ani prod sales (monthly pp ae
>                                                                 - Di Maro) only for wave 3";
note: label truncated to 80 characters

. **Trim Outliers;
. foreach x in homeprod home_prod_tot home_prod_tot_w3
> homeprod_pp_ae home_prod_tot_pp_ae home_prod_tot_w3_pp_ae
> homeprod_pp_ae2 home_prod_tot_pp_ae2 home_prod_tot_w3_pp_ae2 {;
  2.         xtile `x'_tile =`x', nq(100);
  3.         sum `x' if `x'_tile <=95;
  4. };

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    homeprod |     43,340    92.98799    106.2541          0    407.539

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~t |     43,341    113.9767     132.209          0   590.4396

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~3 |     43,340    114.9702    133.4923          0   598.8663

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
homeprod_~ae |     43,279    22.93049    25.12798          0   95.01327

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home~t_pp_ae |     43,273    28.06625    31.52204          0   144.0752

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home~3_pp_ae |     43,273    28.31125    31.84841          0   145.9233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
homeprod_p~2 |     43,273     21.7005    23.81862          0   91.40667

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hom~t_pp_ae2 |     43,273    26.61274     30.0333          0   137.4805

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hom~3_pp_ae2 |     43,273    26.84599    30.34944          0   139.8886

. *==============================
>   Define Globals 
> ===============================;
. gl dep_d        maiz frijol ani_prod credit_farm;

. gl credit       credit credit_cons credit_farm trans_t trans_out;

. gl home         home_prod_tot home_prod_tot_pp_ae home_prod_tot_pp_ae2;

. gl home3        home_prod_tot_w3 home_prod_tot_w3_pp_ae home_prod_tot_w3_pp_ae2;

. gl treatcom1 t2_c1_op;

. gl treatcom2 treatcom;

. gl basic                nbani197 nbani297 ha97;

. gl controls             no497 big497
>                                 age_hh age_hh2 female_hh educ1_hh ethnicity_hh 
>                                 age_sp age_sp2 educ1_sp                         
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p hhsize97
>                                 homeown97 dirtfloor97  electricity97 
>                                 org_faenas min_dist lnup_cwagepm up2_mcwagepm
>                                 dummy_age_hh dummy_educ_hh dummy_ethnicity_hh dummy_age_sp dummy_educ_sp
>                                 dummy_dage0_7_97 dummy_dirtfloor97 dummy_electricity97;

. gl controls_ae  no497 big497
>                                 age_hh age_hh2 female_hh educ1_hh ethnicity_hh 
>                                 age_sp age_sp2 educ1_sp                         
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p hhsize_ae
>                                 homeown97 dirtfloor97  electricity97 
>                                 org_faenas min_dist lnup_cwagepm up2_mcwagepm
>                                 dummy_age_hh dummy_educ_hh dummy_ethnicity_hh dummy_age_sp dummy_educ_sp
>                                 dummy_dage0_7_97 dummy_dirtfloor97 dummy_electricity97;

. gl controls_ae2 no497 big497
>                                 age_hh age_hh2 female_hh educ1_hh ethnicity_hh 
>                                 age_sp age_sp2 educ1_sp                         
>                                 dage0_7_97 dage8_17_97 dage18_54_97 dage55p hhsize_ae2
>                                 homeown97 dirtfloor97  electricity97 
>                                 org_faenas min_dist lnup_cwagepm up2_mcwagepm
>                                 dummy_age_hh dummy_educ_hh dummy_ethnicity_hh dummy_age_sp dummy_educ_sp
>                                 dummy_dage0_7_97 dummy_dirtfloor97 dummy_electricity97;

.                                 *=====================================================
> Supporting Evidence - Total Agricultural Income B (wave 3) -- Table 4 
> *=====================================================;
. foreach x of global home3 {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' $basic $controls if home_prod_tot_w3_tile <=95 & wave ==3, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         scalar std =r(sd);
  8.         estadd scalar std;
  9.         est store `x'_c, title (`x');
 10. };
 11. };

Linear regression                               Number of obs     =     10,461
                                                F(33, 495)        =      17.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0735
                                                Root MSE          =      129.6

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
   home_prod_tot_w3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   11.26784   7.611507     1.48   0.139    -3.687004    26.22269
           nbani197 |    6.18514   2.362437     2.62   0.009       1.5435    10.82678
           nbani297 |   2.302299   1.008407     2.28   0.023     .3210137    4.283585
               ha97 |   2.474531    1.01697     2.43   0.015     .4764208    4.472641
              no497 |   -28.8803   4.586711    -6.30   0.000    -37.89212   -19.86848
             big497 |   5.153457   6.371679     0.81   0.419    -7.365413    17.67233
             age_hh |   2.927259   .7611144     3.85   0.000     1.431846    4.422672
            age_hh2 |  -.0266899   .0071509    -3.73   0.000    -.0407397   -.0126401
          female_hh |  -10.59573   6.627727    -1.60   0.111    -23.61768    2.426217
           educ1_hh |    -5.5032   4.459853    -1.23   0.218    -14.26578    3.259377
       ethnicity_hh |  -6.306954   7.925766    -0.80   0.427    -21.87925    9.265338
             age_sp |   .2124119   .7822307     0.27   0.786     -1.32449    1.749314
            age_sp2 |  -.0054536   .0080684    -0.68   0.499    -.0213063     .010399
           educ1_sp |   .8457399   4.198372     0.20   0.840    -7.403087    9.094567
         dage0_7_97 |   1.862422   3.966023     0.47   0.639    -5.929893    9.654737
        dage8_17_97 |    8.08107   3.672656     2.20   0.028     .8651541    15.29699
       dage18_54_97 |   6.208185   5.700425     1.09   0.277    -4.991828     17.4082
         dage55p_97 |  -2.851032   4.411926    -0.65   0.518    -11.51944    5.817379
           hhsize97 |   6.380417   1.026154     6.22   0.000     4.364263    8.396571
          homeown97 |   3.972094   5.854033     0.68   0.498    -7.529723    15.47391
        dirtfloor97 |   1.294091   4.576698     0.28   0.777    -7.698059    10.28624
      electricity97 |   3.854905   5.870951     0.66   0.512    -7.680152    15.38996
         org_faenas |  -6.323794   10.72923    -0.59   0.556    -27.40424    14.75665
           min_dist |  -.3161787   .1036449    -3.05   0.002    -.5198169   -.1125405
       lnup_cwagepm |   7.129255   9.308748     0.77   0.444    -11.16027    25.41879
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |  -89.77861   24.29196    -3.70   0.000    -137.5067   -42.05054
      dummy_educ_hh |   26.27038   26.58154     0.99   0.323    -25.95618    78.49693
 dummy_ethnicity_hh |   17.32777   36.48386     0.47   0.635    -54.35455    89.01009
       dummy_age_sp |  -21.66155   18.80811    -1.15   0.250    -58.61512    15.29202
      dummy_educ_sp |   14.73119   18.71865     0.79   0.432    -22.04661      51.509
   dummy_dage0_7_97 |   94.40167   35.99979     2.62   0.009     23.67043    165.1329
  dummy_dirtfloor97 |   15.31112   24.80903     0.62   0.537    -33.43288    64.05511
dummy_electricity97 |   27.00723   64.25245     0.42   0.674    -99.23393    153.2484
              _cons |  -22.59014   62.86704    -0.36   0.720    -146.1093     100.929
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~3 |      3,894    109.3085    132.6383          0   598.4106

added scalar:
               e(mean) =  109.30846

added scalar:
                e(std) =  132.6383

Linear regression                               Number of obs     =     10,458
                                                F(33, 495)        =      13.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0356
                                                Root MSE          =     31.101

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_w3~ae |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   3.196567   1.772029     1.80   0.072    -.2850591    6.678194
           nbani197 |    1.00963   .4524461     2.23   0.026     .1206779    1.898581
           nbani297 |    .427551   .2097672     2.04   0.042     .0154071    .8396949
               ha97 |   .5354247   .2229999     2.40   0.017     .0972816    .9735678
              no497 |  -7.206378   1.261332    -5.71   0.000    -9.684602   -4.728154
             big497 |   1.390101   1.411424     0.98   0.325    -1.383021    4.163223
             age_hh |   .8428234   .2245689     3.75   0.000     .4015976    1.284049
            age_hh2 |  -.0076342    .002184    -3.50   0.001    -.0119253   -.0033431
          female_hh |   -.140878   1.968194    -0.07   0.943    -4.007923    3.726167
           educ1_hh |   -1.16881   1.073036    -1.09   0.277    -3.277078    .9394572
       ethnicity_hh |  -1.778975   1.876276    -0.95   0.344    -5.465422    1.907472
             age_sp |  -.2213231    .238355    -0.93   0.354    -.6896353    .2469892
            age_sp2 |   .0015144   .0025832     0.59   0.558    -.0035609    .0065897
           educ1_sp |  -.6615999   1.030965    -0.64   0.521    -2.687206    1.364007
         dage0_7_97 |   1.879669   .9239542     2.03   0.042     .0643134    3.695024
        dage8_17_97 |  -.0880894   .9695822    -0.09   0.928    -1.993093    1.816915
       dage18_54_97 |  -1.488121   2.112957    -0.70   0.482    -5.639591     2.66335
         dage55p_97 |  -.1840318   .9406146    -0.20   0.845    -2.032121    1.664058
           hhsize97 |  -1.773737   .2009989    -8.82   0.000    -2.168653   -1.378821
          homeown97 |   .9668301   1.513858     0.64   0.523     -2.00755     3.94121
        dirtfloor97 |   .4352127   .9990785     0.44   0.663    -1.527745     2.39817
      electricity97 |  -.0728874    1.34944    -0.05   0.957    -2.724223    2.578448
         org_faenas |  -1.078178    2.47468    -0.44   0.663    -5.940349    3.783994
           min_dist |  -.0675866     .02432    -2.78   0.006    -.1153698   -.0198034
       lnup_cwagepm |   1.540537   2.098619     0.73   0.463    -2.582762    5.663836
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |  -24.29792   4.175496    -5.82   0.000     -32.5018   -16.09404
      dummy_educ_hh |   6.624909   5.606654     1.18   0.238    -4.390866    17.64068
 dummy_ethnicity_hh |   6.944525   10.72064     0.65   0.517    -14.11905     28.0081
       dummy_age_sp |  -1.191933   4.655804    -0.26   0.798    -10.33951     7.95564
      dummy_educ_sp |   .8837377   4.497913     0.20   0.844    -7.953618    9.721093
   dummy_dage0_7_97 |   14.54604   7.913565     1.84   0.067    -1.002277    30.09436
  dummy_dirtfloor97 |   6.030692   4.951434     1.22   0.224    -3.697728    15.75911
dummy_electricity97 |   23.88177   14.35992     1.66   0.097    -4.332147    52.09568
              _cons |   19.15242   14.37531     1.33   0.183    -9.091728    47.39656
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home~3_pp_ae |      3,894    24.77795    30.20778          0   261.2865

added scalar:
               e(mean) =  24.777948

added scalar:
                e(std) =  30.207777

Linear regression                               Number of obs     =     10,458
                                                F(33, 495)        =      23.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0401
                                                Root MSE          =     28.901

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_w3_~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   2.807544   1.635447     1.72   0.087    -.4057295    6.020817
           nbani197 |   1.039351   .4298305     2.42   0.016     .1948337    1.883868
           nbani297 |   .4055527   .1933372     2.10   0.036     .0256899    .7854154
               ha97 |   .5475333   .2091651     2.62   0.009     .1365724    .9584942
              no497 |  -6.413962   1.144207    -5.61   0.000    -8.662064    -4.16586
             big497 |    1.25505    1.33899     0.94   0.349    -1.375755    3.885855
             age_hh |   .8980541   .2107856     4.26   0.000     .4839093    1.312199
            age_hh2 |  -.0081479    .002078    -3.92   0.000    -.0122306   -.0040652
          female_hh |  -.1420725    1.88344    -0.08   0.940    -3.842595    3.558449
           educ1_hh |  -1.087413    .957143    -1.14   0.256    -2.967977    .7931511
       ethnicity_hh |  -1.772504   1.733443    -1.02   0.307    -5.178318    1.633309
             age_sp |  -.0986626   .2251139    -0.44   0.661    -.5409591     .343634
            age_sp2 |   .0006147   .0024792     0.25   0.804    -.0042564    .0054857
           educ1_sp |  -.4851698   .9120065    -0.53   0.595    -2.277051    1.306711
         dage0_7_97 |  -.9305127   .8795525    -1.06   0.291    -2.658629    .7976039
        dage8_17_97 |   .4889281   .8722518     0.56   0.575    -1.224844    2.202701
       dage18_54_97 |  -1.128675   2.092651    -0.54   0.590    -5.240248    2.982898
         dage55p_97 |  -.0591249   .9064916    -0.07   0.948     -1.84017    1.721921
           hhsize97 |  -1.649986   .1871232    -8.82   0.000     -2.01764   -1.282333
          homeown97 |   .8287131   1.358504     0.61   0.542    -1.840431    3.497858
        dirtfloor97 |   .4429344   .9233923     0.48   0.632    -1.371317    2.257186
      electricity97 |  -.1237811   1.255149    -0.10   0.921    -2.589858    2.342296
         org_faenas |   -1.02849   2.289133    -0.45   0.653    -5.526106    3.469125
           min_dist |  -.0610459   .0224682    -2.72   0.007    -.1051906   -.0169012
       lnup_cwagepm |   1.256133   1.978891     0.63   0.526    -2.631929    5.144196
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |  -23.78373   3.825222    -6.22   0.000    -31.29941   -16.26806
      dummy_educ_hh |   5.329361   5.052735     1.05   0.292    -4.598091    15.25681
 dummy_ethnicity_hh |   5.484691   9.822197     0.56   0.577    -13.81365    24.78303
       dummy_age_sp |  -.3851598   4.274195    -0.09   0.928    -8.782961    8.012642
      dummy_educ_sp |   .5058986   4.103474     0.12   0.902    -7.556475    8.568272
   dummy_dage0_7_97 |   12.21439   7.440929     1.64   0.101    -2.405308    26.83409
  dummy_dirtfloor97 |   5.646573   4.711437     1.20   0.231    -3.610308    14.90345
dummy_electricity97 |   21.79932    13.3288     1.64   0.103    -4.388682    47.98733
              _cons |   14.32339   13.51236     1.06   0.290    -12.22527    40.87204
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hom~3_pp_ae2 |      3,894    22.98044    28.21367          0   261.2865

added scalar:
               e(mean) =  22.98044

added scalar:
                e(std) =  28.213666

. foreach x in home_prod_tot_w3 {;
  2. foreach y of global treatcom1 {;
  3. reg  `x' `y' $basic $controls_ae if home_prod_tot_w3_tile <=95 & wave ==3, cl(comuid);
  4. sum `x' if e(sample) & `y' ==0;
  5. scalar mean =r(mean);
  6. estadd scalar mean;
  7. scalar std =r(sd);
  8. estadd scalar std;
  9. est store `x'_ae, title (`x');
 10. reg `x' `y' $basic $controls_ae2 if home_prod_tot_w3_tile <=95 & wave ==3, cl(comuid);
 11. sum `x' if e(sample) & `y' ==0;
 12. scalar mean =r(mean);
 13. estadd scalar mean;
 14. scalar std =r(sd);
 15. estadd scalar std;
 16. est store `x'_ae2, title (`x');
 17. };
 18. };

Linear regression                               Number of obs     =     10,458
                                                F(33, 495)        =      17.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0758
                                                Root MSE          =     129.46

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
   home_prod_tot_w3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    11.8863   7.624836     1.56   0.120    -3.094732    26.86734
           nbani197 |   6.056134   2.331835     2.60   0.010      1.47462    10.63765
           nbani297 |   2.243631   1.003433     2.24   0.026     .2721185    4.215143
               ha97 |   2.593436   1.026052     2.53   0.012     .5774815     4.60939
              no497 |  -28.48234   4.557079    -6.25   0.000    -37.43594   -19.52873
             big497 |   4.660693   6.380777     0.73   0.465    -7.876053    17.19744
             age_hh |    2.83869   .7633031     3.72   0.000     1.338977    4.338403
            age_hh2 |   -.025845   .0071727    -3.60   0.000    -.0399378   -.0117523
          female_hh |   -10.0877   6.577983    -1.53   0.126    -23.01191    2.836514
           educ1_hh |  -5.793399   4.472557    -1.30   0.196    -14.58094    2.994137
       ethnicity_hh |  -6.626272   7.936148    -0.83   0.404    -22.21896    8.966418
             age_sp |   .1700311   .7726334     0.22   0.826    -1.348014    1.688076
            age_sp2 |  -.0049551   .0079877    -0.62   0.535     -.020649    .0107388
           educ1_sp |   .0804519    4.20415     0.02   0.985    -8.179728    8.340631
         dage0_7_97 |   7.103279   3.547646     2.00   0.046     .1329782    14.07358
        dage8_17_97 |    8.75447    3.44918     2.54   0.011     1.977632    15.53131
       dage18_54_97 |   5.179446   5.646374     0.92   0.359    -5.914369    16.27326
         dage55p_97 |  -2.355251   4.356027    -0.54   0.589    -10.91383    6.203331
          hhsize_ae |   8.995677    1.12423     8.00   0.000     6.786826    11.20453
          homeown97 |   3.677721   5.853436     0.63   0.530    -7.822923    15.17837
        dirtfloor97 |   1.216412   4.588896     0.27   0.791    -7.799704    10.23253
      electricity97 |   3.385921   5.897279     0.57   0.566    -8.200864    14.97271
         org_faenas |  -5.691015   10.86809    -0.52   0.601    -27.04429    15.66226
           min_dist |  -.3147488   .1037247    -3.03   0.003    -.5185437   -.1109538
       lnup_cwagepm |   7.417794    9.29138     0.80   0.425    -10.83761     25.6732
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |  -95.37554   26.09604    -3.65   0.000    -146.6482   -44.10287
      dummy_educ_hh |   29.88467    26.9069     1.11   0.267    -22.98114    82.75049
 dummy_ethnicity_hh |   18.16979   36.81713     0.49   0.622    -54.16733    90.50691
       dummy_age_sp |  -12.25035   18.30243    -0.67   0.504    -48.21039    23.70968
      dummy_educ_sp |   6.495895   18.08425     0.36   0.720    -29.03546    42.02725
   dummy_dage0_7_97 |   95.49296    34.5534     2.76   0.006     27.60356    163.3824
  dummy_dirtfloor97 |   14.52938   24.75817     0.59   0.558    -34.11468    63.17345
dummy_electricity97 |   27.12517   65.21601     0.42   0.678    -101.0092    155.2595
              _cons |  -28.08042   63.00793    -0.45   0.656    -151.8764    95.71554
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~3 |      3,894    109.3085    132.6383          0   598.4106

added scalar:
               e(mean) =  109.30846

added scalar:
                e(std) =  132.6383

Linear regression                               Number of obs     =     10,458
                                                F(33, 495)        =      16.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0761
                                                Root MSE          =     129.44

                                      (Std. Err. adjusted for 496 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
   home_prod_tot_w3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    11.8408   7.637726     1.55   0.122    -3.165561    26.84716
           nbani197 |   6.095549   2.343774     2.60   0.010     1.490577    10.70052
           nbani297 |   2.254952   1.004134     2.25   0.025     .2820623    4.227842
               ha97 |   2.581665   1.026463     2.52   0.012     .5649039    4.598426
              no497 |     -28.51   4.561916    -6.25   0.000     -37.4731   -19.54689
             big497 |   4.813879   6.377973     0.75   0.451    -7.717359    17.34512
             age_hh |     2.9616   .7638619     3.88   0.000     1.460788    4.462411
            age_hh2 |  -.0268809   .0071742    -3.75   0.000    -.0409766   -.0127852
          female_hh |  -9.901751    6.56141    -1.51   0.132     -22.7934    2.989897
           educ1_hh |  -5.793512   4.470292    -1.30   0.196     -14.5766    2.989574
       ethnicity_hh |   -6.81398   7.940435    -0.86   0.391    -22.41509    8.787133
             age_sp |   .3167998   .7676856     0.41   0.680    -1.191524    1.825124
            age_sp2 |  -.0060875   .0079395    -0.77   0.444    -.0216869    .0095118
           educ1_sp |    .149089   4.196881     0.04   0.972    -8.096809    8.394987
         dage0_7_97 |   2.743479   3.652975     0.75   0.453     -4.43377    9.920727
        dage8_17_97 |   9.301454   3.427522     2.71   0.007     2.567169    16.03574
       dage18_54_97 |   5.689611    5.62501     1.01   0.312    -5.362228    16.74145
         dage55p_97 |  -2.663522   4.365439    -0.61   0.542     -11.2406    5.913553
         hhsize_ae2 |   8.800909   1.123236     7.84   0.000     6.594012    11.00781
          homeown97 |   3.599024    5.85363     0.61   0.539    -7.902001    15.10005
        dirtfloor97 |   1.219377   4.592181     0.27   0.791    -7.803193    10.24195
      electricity97 |   3.582641   5.909981     0.61   0.545      -8.0291    15.19438
         org_faenas |  -5.535072   10.90184    -0.51   0.612    -26.95465    15.88451
           min_dist |  -.3132577   .1038327    -3.02   0.003    -.5172649   -.1092505
       lnup_cwagepm |   7.350327   9.310918     0.79   0.430    -10.94347    25.64412
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |  -94.27961   25.27067    -3.73   0.000    -143.9306   -44.62861
      dummy_educ_hh |    29.3042   26.92241     1.09   0.277    -23.59209     82.2005
 dummy_ethnicity_hh |   18.37187   36.69611     0.50   0.617    -53.72747    90.47122
       dummy_age_sp |  -11.54874   17.89641    -0.65   0.519    -46.71103    23.61355
      dummy_educ_sp |   6.240831   17.65292     0.35   0.724    -28.44307    40.92473
   dummy_dage0_7_97 |     93.299     34.901     2.67   0.008     24.72663    161.8714
  dummy_dirtfloor97 |   14.14253   24.72519     0.57   0.568    -34.43673     62.7218
dummy_electricity97 |   27.89266   66.16031     0.42   0.674     -102.097    157.8823
              _cons |  -34.86646   63.10149    -0.55   0.581    -158.8462    89.11332
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~3 |      3,894    109.3085    132.6383          0   598.4106

added scalar:
               e(mean) =  109.30846

added scalar:
                e(std) =  132.6383

. *=====================================================
> Supporting Evidence - Crops Production, Animal Production Sales, Productive Loans and Agricultural Income A (waves 2 and 3)
>   -- Table 4 
> *=====================================================;
. foreach x of global dep_d {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' wave3 $basic $controls, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         scalar std =r(sd);
  8.         estadd scalar std;
  9.         est store `x'_c, title (`x');
 10. };
 11. };

Linear regression                               Number of obs     =     22,369
                                                F(35, 500)        =      69.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1315
                                                Root MSE          =     .46622

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               maiz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0227621   .0208676     1.09   0.276    -.0182368    .0637611
              wave3 |  -.1061973   .0112936    -9.40   0.000    -.1283861   -.0840084
           nbani197 |   .0390893    .006282     6.22   0.000     .0267468    .0514317
           nbani297 |   .0140541   .0021355     6.58   0.000     .0098585    .0182497
               ha97 |   .0227833   .0032519     7.01   0.000     .0163941    .0291724
              no497 |  -.1779187   .0134171   -13.26   0.000    -.2042794   -.1515579
             big497 |    .046848    .017786     2.63   0.009     .0119035    .0817925
             age_hh |   .0070226   .0021729     3.23   0.001     .0027535    .0112918
            age_hh2 |  -.0000656   .0000203    -3.23   0.001    -.0001055   -.0000257
          female_hh |  -.0771893   .0201276    -3.84   0.000    -.1167343   -.0376442
           educ1_hh |   .0310992   .0119762     2.60   0.010     .0075692    .0546292
       ethnicity_hh |   .0786374   .0205949     3.82   0.000     .0381741    .1191007
             age_sp |  -.0013251   .0023118    -0.57   0.567    -.0058671     .003217
            age_sp2 |   8.71e-06   .0000243     0.36   0.720    -.0000391    .0000565
           educ1_sp |   .0321991   .0127902     2.52   0.012     .0070699    .0573283
         dage0_7_97 |   -.017577   .0110436    -1.59   0.112    -.0392746    .0041206
        dage8_17_97 |   .0241449   .0101771     2.37   0.018     .0041498      .04414
       dage18_54_97 |   .0158604   .0203762     0.78   0.437    -.0241732    .0558939
         dage55p_97 |    .030006   .0115302     2.60   0.010     .0073523    .0526597
           hhsize97 |   .0080385   .0023144     3.47   0.001     .0034913    .0125857
          homeown97 |   .1186337   .0151583     7.83   0.000     .0888518    .1484156
        dirtfloor97 |   .0261365   .0110835     2.36   0.019     .0043606    .0479125
      electricity97 |   .0143652   .0158211     0.91   0.364    -.0167188    .0454492
         org_faenas |  -.0519076   .0380943    -1.36   0.174    -.1267522     .022937
           min_dist |   .0004148   .0002446     1.70   0.091    -.0000657    .0008954
       lnup_cwagepm |  -.0366297   .0300061    -1.22   0.223    -.0955833    .0223239
       up2_mcwagepm |   .0444111   .1917687     0.23   0.817    -.3323606    .4211828
       dummy_age_hh |   .1361702   .0813906     1.67   0.095    -.0237396      .29608
      dummy_educ_hh |   .0503518   .0651751     0.77   0.440    -.0776991    .1784026
 dummy_ethnicity_hh |  -.0279213   .0834113    -0.33   0.738    -.1918013    .1359586
       dummy_age_sp |  -.0631369   .0461606    -1.37   0.172    -.1538295    .0275558
      dummy_educ_sp |   .0373126   .0454046     0.82   0.412    -.0518947    .1265199
   dummy_dage0_7_97 |   .1257097   .1049746     1.20   0.232     -.080536    .3319555
  dummy_dirtfloor97 |   .1869569   .0732486     2.55   0.011      .043044    .3308699
dummy_electricity97 |   .2982111   .1828181     1.63   0.103    -.0609752    .6573974
              _cons |   .2802121   .2027309     1.38   0.168    -.1180973    .6785215
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        maiz |      8,361    .4755412    .4994313          0          1

added scalar:
               e(mean) =  .4755412

added scalar:
                e(std) =  .49943128

Linear regression                               Number of obs     =     22,369
                                                F(35, 500)        =       7.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0441
                                                Root MSE          =     .28138

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             frijol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0197243   .0115777     1.70   0.089    -.0030226    .0424711
              wave3 |  -.0316928   .0060817    -5.21   0.000    -.0436416    -.019744
           nbani197 |   .0177241   .0048721     3.64   0.000     .0081518    .0272963
           nbani297 |   .0050415    .001864     2.70   0.007     .0013792    .0087037
               ha97 |   .0092378   .0028314     3.26   0.001     .0036749    .0148007
              no497 |  -.0238641   .0059355    -4.02   0.000    -.0355257   -.0122026
             big497 |   .0237917   .0128762     1.85   0.065    -.0015063    .0490898
             age_hh |   .0001401     .00113     0.12   0.901      -.00208    .0023603
            age_hh2 |   3.49e-06   .0000112     0.31   0.756    -.0000185    .0000255
          female_hh |  -.0089713   .0104856    -0.86   0.393    -.0295726    .0116301
           educ1_hh |   .0168515   .0061155     2.76   0.006     .0048363    .0288667
       ethnicity_hh |  -.0282321   .0117804    -2.40   0.017    -.0513772    -.005087
             age_sp |  -.0003847   .0012544    -0.31   0.759    -.0028493    .0020799
            age_sp2 |   7.00e-06   .0000139     0.50   0.614    -.0000203    .0000343
           educ1_sp |   .0043038   .0059265     0.73   0.468    -.0073402    .0159478
         dage0_7_97 |   .0026893   .0071248     0.38   0.706    -.0113089    .0166874
        dage8_17_97 |  -.0043547   .0054079    -0.81   0.421    -.0149796    .0062703
       dage18_54_97 |   .0025367   .0112083     0.23   0.821    -.0194844    .0245578
         dage55p_97 |  -.0047346   .0063504    -0.75   0.456    -.0172114    .0077421
           hhsize97 |   .0029192   .0014498     2.01   0.045     .0000706    .0057677
          homeown97 |    .026723   .0061453     4.35   0.000     .0146492    .0387968
        dirtfloor97 |  -.0106903   .0078093    -1.37   0.172    -.0260334    .0046529
      electricity97 |   .0035454   .0100876     0.35   0.725    -.0162738    .0233647
         org_faenas |  -.0122271   .0194098    -0.63   0.529    -.0503618    .0259076
           min_dist |   .0002966   .0001556     1.91   0.057    -9.08e-06    .0006023
       lnup_cwagepm |  -.0199162   .0115884    -1.72   0.086    -.0426841    .0028517
       up2_mcwagepm |   .0838886   .0926421     0.91   0.366     -.098127    .2659043
       dummy_age_hh |  -.1093711   .0536921    -2.04   0.042     -.214861   -.0038812
      dummy_educ_hh |   .0361665   .0481997     0.75   0.453    -.0585323    .1308654
 dummy_ethnicity_hh |   .0758258   .0723893     1.05   0.295    -.0663989    .2180506
       dummy_age_sp |  -.0119883   .0246054    -0.49   0.626     -.060331    .0363544
      dummy_educ_sp |  -.0032664   .0237122    -0.14   0.890    -.0498543    .0433215
   dummy_dage0_7_97 |   .0182833   .0451012     0.41   0.685    -.0703279    .1068944
  dummy_dirtfloor97 |  -.0037813   .0449593    -0.08   0.933    -.0921138    .0845512
dummy_electricity97 |  -.0492609    .024594    -2.00   0.046    -.0975812   -.0009405
              _cons |   .1203558   .0857326     1.40   0.161    -.0480848    .2887964
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      frijol |      8,361    .0786987    .2692841          0          1

added scalar:
               e(mean) =  .07869872

added scalar:
                e(std) =  .26928406

Linear regression                               Number of obs     =     22,369
                                                F(35, 500)        =      17.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0473
                                                Root MSE          =     .32976

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
           ani_prod |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0165788   .0094336     1.76   0.079    -.0019556    .0351132
              wave3 |  -.0044822   .0071242    -0.63   0.530    -.0184792    .0095148
           nbani197 |   .0188728   .0037633     5.01   0.000     .0114789    .0262667
           nbani297 |    .015696   .0019618     8.00   0.000     .0118415    .0195504
               ha97 |  -.0005141    .001888    -0.27   0.785    -.0042236    .0031953
              no497 |  -.0731702   .0068186   -10.73   0.000    -.0865668   -.0597736
             big497 |   .0188993   .0114475     1.65   0.099    -.0035919    .0413904
             age_hh |   .0031294   .0012923     2.42   0.016     .0005903    .0056684
            age_hh2 |  -.0000305   .0000124    -2.46   0.014    -.0000549   -6.09e-06
          female_hh |   .0040563   .0124591     0.33   0.745    -.0204223    .0285349
           educ1_hh |  -.0023049   .0072392    -0.32   0.750    -.0165278    .0119181
       ethnicity_hh |    -.03694   .0098079    -3.77   0.000    -.0562098   -.0176703
             age_sp |   .0035716   .0014757     2.42   0.016     .0006722     .006471
            age_sp2 |   -.000029   .0000161    -1.80   0.072    -.0000607    2.64e-06
           educ1_sp |  -.0240852   .0078678    -3.06   0.002    -.0395432   -.0086273
         dage0_7_97 |   .0035703   .0075879     0.47   0.638    -.0113378    .0184783
        dage8_17_97 |   .0012543    .006869     0.18   0.855    -.0122414    .0147501
       dage18_54_97 |   .0161428   .0133698     1.21   0.228     -.010125    .0424107
         dage55p_97 |   .0009958   .0076777     0.13   0.897    -.0140887    .0160802
           hhsize97 |  -.0030129   .0016541    -1.82   0.069    -.0062628    .0002369
          homeown97 |   .0184455   .0091862     2.01   0.045     .0003971    .0364939
        dirtfloor97 |  -.0168869   .0075136    -2.25   0.025    -.0316489   -.0021248
      electricity97 |  -.0098888   .0083837    -1.18   0.239    -.0263605    .0065829
         org_faenas |   .0093675   .0155591     0.60   0.547    -.0212019    .0399368
           min_dist |  -.0005973   .0001508    -3.96   0.000    -.0008935    -.000301
       lnup_cwagepm |   .0270284   .0223536     1.21   0.227    -.0168901     .070947
       up2_mcwagepm |   .0912788   .1434505     0.64   0.525    -.1905612    .3731188
       dummy_age_hh |  -.1111159   .0259878    -4.28   0.000    -.1621746   -.0600572
      dummy_educ_hh |   .0264165   .0443026     0.60   0.551    -.0606257    .1134586
 dummy_ethnicity_hh |   -.037311   .0565022    -0.66   0.509     -.148322       .0737
       dummy_age_sp |   .0039514   .0251633     0.16   0.875    -.0454874    .0533902
      dummy_educ_sp |  -.0071596   .0251647    -0.28   0.776    -.0566012     .042282
   dummy_dage0_7_97 |   .1575854   .0837119     1.88   0.060     -.006885    .3220558
  dummy_dirtfloor97 |   .0017409   .0439873     0.04   0.968    -.0846818    .0881636
dummy_electricity97 |   .0123056   .1013733     0.12   0.903    -.1868645    .2114757
              _cons |  -.1322841   .1402508    -0.94   0.346    -.4078377    .1432696
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ani_prod |      8,361    .1204401     .325495          0          1

added scalar:
               e(mean) =  .12044014

added scalar:
                e(std) =  .32549498

Linear regression                               Number of obs     =     22,350
                                                F(35, 500)        =       2.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0099
                                                Root MSE          =     .09261

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
        credit_farm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0041342   .0018002     2.30   0.022     .0005973    .0076711
              wave3 |  -.0006642   .0015275    -0.43   0.664    -.0036653    .0023369
           nbani197 |   .0022233    .001278     1.74   0.083    -.0002877    .0047342
           nbani297 |   .0018089   .0007558     2.39   0.017     .0003239    .0032939
               ha97 |  -.0002974   .0004355    -0.68   0.495    -.0011529    .0005582
              no497 |  -.0025513   .0015978    -1.60   0.111    -.0056905    .0005879
             big497 |   .0094598   .0033244     2.85   0.005     .0029282    .0159914
             age_hh |   .0001657   .0004026     0.41   0.681    -.0006254    .0009568
            age_hh2 |  -9.56e-07   4.12e-06    -0.23   0.816    -9.04e-06    7.13e-06
          female_hh |   -.001465    .003631    -0.40   0.687    -.0085989    .0056688
           educ1_hh |   .0001674   .0017028     0.10   0.922    -.0031782     .003513
       ethnicity_hh |  -.0024621   .0017048    -1.44   0.149    -.0058115    .0008873
             age_sp |   .0005891   .0004458     1.32   0.187    -.0002869     .001465
            age_sp2 |  -6.01e-06   4.69e-06    -1.28   0.201    -.0000152    3.21e-06
           educ1_sp |  -.0053276   .0023957    -2.22   0.027    -.0100345   -.0006207
         dage0_7_97 |   .0019414   .0017696     1.10   0.273    -.0015353    .0054181
        dage8_17_97 |   .0009328   .0017223     0.54   0.588    -.0024511    .0043166
       dage18_54_97 |    .001352   .0029688     0.46   0.649    -.0044809    .0071849
         dage55p_97 |  -.0028715   .0020461    -1.40   0.161    -.0068916    .0011486
           hhsize97 |  -.0003332   .0004117    -0.81   0.419    -.0011421    .0004756
          homeown97 |   .0010803   .0026422     0.41   0.683    -.0041109    .0062715
        dirtfloor97 |   .0008982   .0018344     0.49   0.625     -.002706    .0045023
      electricity97 |   -.001611   .0018026    -0.89   0.372    -.0051526    .0019306
         org_faenas |    .001144   .0018294     0.63   0.532    -.0024502    .0047383
           min_dist |  -.0000829   .0000259    -3.20   0.001    -.0001338   -.0000319
       lnup_cwagepm |   .0060076   .0024321     2.47   0.014     .0012292     .010786
       up2_mcwagepm |   .0418852   .0200279     2.09   0.037      .002536    .0812345
       dummy_age_hh |  -.0007588   .0068672    -0.11   0.912    -.0142508    .0127333
      dummy_educ_hh |   .0071003   .0167222     0.42   0.671    -.0257541    .0399546
 dummy_ethnicity_hh |  -.0116703   .0028913    -4.04   0.000    -.0173509   -.0059896
       dummy_age_sp |  -.0053724   .0107446    -0.50   0.617    -.0264826    .0157378
      dummy_educ_sp |   .0078017   .0104541     0.75   0.456    -.0127376     .028341
   dummy_dage0_7_97 |  -.0059245   .0046072    -1.29   0.199    -.0149764    .0031274
  dummy_dirtfloor97 |  -.0063942   .0027026    -2.37   0.018    -.0117041   -.0010843
dummy_electricity97 |  -.0072316   .0023953    -3.02   0.003    -.0119378   -.0025255
              _cons |  -.0413989   .0158966    -2.60   0.009    -.0726313   -.0101666
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 credit_farm |      8,357    .0064616     .080129          0          1

added scalar:
               e(mean) =  .00646165

added scalar:
                e(std) =  .08012905

. foreach x of global home {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' wave3 if home_prod_tot_tile <=95, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         scalar std =r(sd);
  8.         estadd scalar std;
  9.         est store `x'_nc, title (`x');
 10.         reg `x' `y' wave3 $basic $controls if home_prod_tot_tile <=95, cl(comuid);
 11.         sum `x' if e(sample) & `y' ==0;
 12.         scalar mean =r(mean);
 13.         estadd scalar mean;
 14.         scalar std =r(sd);
 15.         estadd scalar std;
 16.         est store `x'_c, title (`x');
 17. };
 18. };

Linear regression                               Number of obs     =     21,503
                                                F(2, 500)         =       6.45
                                                Prob > F          =     0.0017
                                                R-squared         =     0.0035
                                                Root MSE          =     135.08

                               (Std. Err. adjusted for 501 clusters in comuid)
------------------------------------------------------------------------------
             |               Robust
home_prod_~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    t2_c1_op |   7.810385   5.664889     1.38   0.169    -3.319535    18.94031
       wave3 |  -14.17868   4.218388    -3.36   0.001    -22.46663   -5.890728
       _cons |   124.9081    4.44763    28.08   0.000     116.1697    133.6464
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~t |      8,039    118.0278    134.1307          0   590.4396

added scalar:
               e(mean) =  118.02775

added scalar:
                e(std) =  134.13065

Linear regression                               Number of obs     =     21,445
                                                F(35, 500)        =      31.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0725
                                                Root MSE          =     130.33

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
      home_prod_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   8.643399   5.295448     1.63   0.103    -1.760673    19.04747
              wave3 |  -15.14131   4.221878    -3.59   0.000    -23.43611   -6.846498
           nbani197 |   5.596715   1.819653     3.08   0.002     2.021608    9.171823
           nbani297 |    3.40428   .8022546     4.24   0.000     1.828074    4.980485
               ha97 |   3.653629   .7985777     4.58   0.000     2.084648    5.222611
              no497 |  -30.31313   3.198096    -9.48   0.000    -36.59649   -24.02977
             big497 |  -1.642087   4.915598    -0.33   0.738    -11.29986    8.015686
             age_hh |   1.701891   .5600335     3.04   0.002     .6015823      2.8022
            age_hh2 |  -.0148199   .0053772    -2.76   0.006    -.0253845   -.0042553
          female_hh |  -11.72374    4.95047    -2.37   0.018    -21.45003   -1.997452
           educ1_hh |  -3.098556   3.309735    -0.94   0.350    -9.601259    3.404146
       ethnicity_hh |   1.827382   5.643906     0.32   0.746    -9.261313    12.91608
             age_sp |   .7308656     .56587     1.29   0.197    -.3809105    1.842642
            age_sp2 |  -.0101979   .0059886    -1.70   0.089     -.021964    .0015681
           educ1_sp |   4.867555   2.983257     1.63   0.103    -.9937094    10.72882
         dage0_7_97 |  -1.121486   3.006692    -0.37   0.709    -7.028794    4.785821
        dage8_17_97 |   6.310341   2.488332     2.54   0.012     1.421466    11.19922
       dage18_54_97 |   10.68857   4.648328     2.30   0.022     1.555907    19.82123
         dage55p_97 |  -1.110296   3.406414    -0.33   0.745    -7.802945    5.582354
           hhsize97 |   7.436028   .7472036     9.95   0.000     5.967982    8.904073
          homeown97 |   4.362813   4.403622     0.99   0.322    -4.289071     13.0147
        dirtfloor97 |   3.110293   3.215331     0.97   0.334    -3.206932    9.427518
      electricity97 |    3.53673   4.197068     0.84   0.400    -4.709333    11.78279
         org_faenas |  -11.31013   9.049562    -1.25   0.212    -29.08999    6.469722
           min_dist |  -.1267288   .0709492    -1.79   0.075    -.2661241    .0126665
       lnup_cwagepm |   9.207119   8.202037     1.12   0.262    -6.907586    25.32182
       up2_mcwagepm |   51.69773   60.03136     0.86   0.390    -66.24708    169.6425
       dummy_age_hh |  -14.84268   31.75045    -0.47   0.640    -77.22343    47.53807
      dummy_educ_hh |   30.43504   17.53723     1.74   0.083    -4.020695    64.89078
 dummy_ethnicity_hh |    8.59855   20.82328     0.41   0.680    -32.31337    49.51047
       dummy_age_sp |  -19.92899   16.07006    -1.24   0.216    -51.50216    11.64418
      dummy_educ_sp |   14.30753   16.15242     0.89   0.376    -17.42746    46.04251
   dummy_dage0_7_97 |   60.89715   29.13275     2.09   0.037      3.65945    118.1348
  dummy_dirtfloor97 |   12.17957   17.75706     0.69   0.493    -22.70807    47.06722
dummy_electricity97 |   43.19556   41.95179     1.03   0.304    -39.22797    125.6191
              _cons |  -37.98142    53.5932    -0.71   0.479    -143.2771    67.31421
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~t |      8,020    117.8549    133.9548          0   590.4396

added scalar:
               e(mean) =  117.85492

added scalar:
                e(std) =  133.95478

Linear regression                               Number of obs     =     21,472
                                                F(2, 500)         =       7.44
                                                Prob > F          =     0.0007
                                                R-squared         =     0.0040
                                                Root MSE          =     32.781

                               (Std. Err. adjusted for 501 clusters in comuid)
------------------------------------------------------------------------------
             |               Robust
home~t_pp_ae |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    t2_c1_op |   2.700245   1.311248     2.06   0.040     .1240104    5.276479
       wave3 |  -3.227827   .9655884    -3.34   0.001    -5.124938   -1.330716
       _cons |   28.16892   1.005211    28.02   0.000     26.19396    30.14388
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home~t_pp_ae |      8,030    26.60083    30.84912          0   261.2865

added scalar:
               e(mean) =  26.600832

added scalar:
                e(std) =  30.849116

Linear regression                               Number of obs     =     21,414
                                                F(35, 500)        =      11.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0331
                                                Root MSE          =     32.335

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_pp_ae |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |    2.71868   1.245709     2.18   0.030     .2712098     5.16615
              wave3 |  -3.287573   .9643536    -3.41   0.001    -5.182258   -1.392888
           nbani197 |   .8589975   .3890661     2.21   0.028     .0945916    1.623404
           nbani297 |   .6749966   .1751995     3.85   0.000     .3307786    1.019215
               ha97 |   .7967011   .1779561     4.48   0.000     .4470672    1.146335
              no497 |   -8.35781   .8930038    -9.36   0.000    -10.11231   -6.603308
             big497 |  -.3263721   1.149186    -0.28   0.777      -2.5842    1.931456
             age_hh |   .5336471   .1673381     3.19   0.002     .2048746    .8624196
            age_hh2 |  -.0047064   .0016416    -2.87   0.004    -.0079317   -.0014812
          female_hh |   -2.55126   1.516558    -1.68   0.093    -5.530872    .4283514
           educ1_hh |  -.7115664   .8210056    -0.87   0.387    -2.324612    .9014796
       ethnicity_hh |  -.0911559   1.343188    -0.07   0.946    -2.730143    2.547831
             age_sp |  -.0071618   .1619501    -0.04   0.965    -.3253484    .3110247
            age_sp2 |    -.00093   .0017549    -0.53   0.596    -.0043778    .0025178
           educ1_sp |   .7920251   .7402339     1.07   0.285     -.662327    2.246377
         dage0_7_97 |   .9526696   .7066757     1.35   0.178    -.4357501    2.341089
        dage8_17_97 |  -.7028957   .6780312    -1.04   0.300    -2.035037    .6292457
       dage18_54_97 |  -2.425247   1.721858    -1.41   0.160    -5.808217    .9577224
         dage55p_97 |  -.1863074   .7382082    -0.25   0.801     -1.63668    1.264065
           hhsize97 |   -1.80129   .1566498   -11.50   0.000    -2.109063   -1.493517
          homeown97 |   .9605687   1.231149     0.78   0.436    -1.458295    3.379432
        dirtfloor97 |   .4655446   .7487424     0.62   0.534    -1.005524    1.936614
      electricity97 |  -.3703586   .9836115    -0.38   0.707     -2.30288    1.562162
         org_faenas |  -2.444619   2.128468    -1.15   0.251    -6.626462    1.737224
           min_dist |   -.027339   .0167704    -1.63   0.104    -.0602882    .0056101
       lnup_cwagepm |   2.181581   1.863622     1.17   0.242    -1.479914    5.843075
       up2_mcwagepm |    13.4149   13.38397     1.00   0.317    -12.88085    39.71064
       dummy_age_hh |  -7.988103   7.377535    -1.08   0.279    -22.48289    6.506686
      dummy_educ_hh |    7.32714   3.788768     1.93   0.054    -.1167264    14.77101
 dummy_ethnicity_hh |   .8101444   6.781347     0.12   0.905     -12.5133    14.13359
       dummy_age_sp |   2.445481   3.276021     0.75   0.456    -3.990983    8.881944
      dummy_educ_sp |  -1.433643   3.200131    -0.45   0.654    -7.721003    4.853716
   dummy_dage0_7_97 |   10.83091   9.588657     1.13   0.259    -8.008115    29.66993
  dummy_dirtfloor97 |   5.762159    4.74825     1.21   0.225    -3.566822    15.09114
dummy_electricity97 |   22.73787   9.800455     2.32   0.021     3.482721    41.99302
              _cons |   18.58219    12.3383     1.51   0.133    -5.659116    42.82349
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home~t_pp_ae |      8,011    26.58728    30.85114          0   261.2865

added scalar:
               e(mean) =  26.587276

added scalar:
                e(std) =  30.851142

Linear regression                               Number of obs     =     21,472
                                                F(2, 500)         =       7.07
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0037
                                                Root MSE          =     30.299

                               (Std. Err. adjusted for 501 clusters in comuid)
------------------------------------------------------------------------------
             |               Robust
hom~t_pp_ae2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    t2_c1_op |   2.383732   1.215248     1.96   0.050    -.0038898    4.771355
       wave3 |  -2.911342   .8911211    -3.27   0.001    -4.662145   -1.160539
       _cons |   26.05161   .9358697    27.84   0.000     24.21288    27.89033
------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hom~t_pp_ae2 |      8,030    24.63727    28.76094          0   261.2865

added scalar:
               e(mean) =  24.637266

added scalar:
                e(std) =  28.760941

Linear regression                               Number of obs     =     21,414
                                                F(35, 500)        =      13.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0409
                                                Root MSE          =     29.758

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_pp_~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   2.357787   1.150217     2.05   0.041     .0979329     4.61764
              wave3 |  -3.024632   .8896085    -3.40   0.001    -4.772464     -1.2768
           nbani197 |   .8940887   .3699091     2.42   0.016      .167321    1.620856
           nbani297 |   .6478588   .1585175     4.09   0.000     .3364163    .9593013
               ha97 |    .752025   .1638232     4.59   0.000     .4301584    1.073892
              no497 |  -7.550034   .8099997    -9.32   0.000    -9.141457   -5.958612
             big497 |  -.1625295   1.074238    -0.15   0.880    -2.273106    1.948047
             age_hh |   .6098456   .1564379     3.90   0.000     .3024889    .9172022
            age_hh2 |  -.0053618   .0015559    -3.45   0.001    -.0084186    -.002305
          female_hh |  -2.516043   1.466661    -1.72   0.087    -5.397621    .3655348
           educ1_hh |  -.6425655   .7210999    -0.89   0.373    -2.059325    .7741938
       ethnicity_hh |  -.1595194   1.239819    -0.13   0.898    -2.595417    2.276378
             age_sp |    .092854   .1517903     0.61   0.541    -.2053715    .3910794
            age_sp2 |  -.0016194   .0016722    -0.97   0.333    -.0049047    .0016659
           educ1_sp |   .7275419    .646241     1.13   0.261    -.5421406    1.997224
         dage0_7_97 |  -1.981116   .6694507    -2.96   0.003    -3.296399   -.6658327
        dage8_17_97 |  -.0921312   .6100159    -0.15   0.880    -1.290641    1.106379
       dage18_54_97 |  -2.154886   1.709267    -1.26   0.208    -5.513116    1.203344
         dage55p_97 |  -.0775122   .7060573    -0.11   0.913    -1.464717    1.309692
           hhsize97 |  -1.700943   .1411821   -12.05   0.000    -1.978326   -1.423559
          homeown97 |     .81871   1.118611     0.73   0.465    -1.379047    3.016467
        dirtfloor97 |   .5013748   .6819265     0.74   0.463    -.8384198    1.841169
      electricity97 |   -.363852   .9070232    -0.40   0.688    -2.145898    1.418194
         org_faenas |  -2.283523   1.960721    -1.16   0.245    -6.135792    1.568745
           min_dist |  -.0230346   .0153843    -1.50   0.135    -.0532605    .0071913
       lnup_cwagepm |   1.922281   1.752226     1.10   0.273    -1.520352    5.364913
       up2_mcwagepm |   11.48235   12.57025     0.91   0.361    -13.21467    36.17937
       dummy_age_hh |  -7.772209   7.919081    -0.98   0.327    -23.33098    7.786567
      dummy_educ_hh |   6.351804   3.400081     1.87   0.062    -.3284026    13.03201
 dummy_ethnicity_hh |   .8215699   6.136599     0.13   0.894    -11.23513    12.87827
       dummy_age_sp |   3.334492   2.923321     1.14   0.255    -2.409015    9.077999
      dummy_educ_sp |  -1.944839   2.788668    -0.70   0.486    -7.423791    3.534113
   dummy_dage0_7_97 |   7.921666   8.505135     0.93   0.352    -8.788542    24.63187
  dummy_dirtfloor97 |   5.684693   4.536415     1.25   0.211    -3.228092    14.59748
dummy_electricity97 |   20.77189   9.097724     2.28   0.023     2.897413    38.64637
              _cons |   13.89526   11.58862     1.20   0.231    -8.873137    36.66366
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hom~t_pp_ae2 |      8,011    24.62439    28.76271          0   261.2865

added scalar:
               e(mean) =  24.624389

added scalar:
                e(std) =  28.762712

. foreach x in home_prod_tot {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' wave3 $basic $controls_ae if home_prod_tot_tile <=95, cl(comuid);
  4.                 sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         scalar std =r(sd);
  8.         estadd scalar std;
  9.         est store `x'_ae, title (`x');
 10.                 reg `x' `y' wave3 $basic $controls_ae2 if home_prod_tot_tile <=95, cl(comuid);
 11.         sum `x' if e(sample) & `y' ==0;
 12.         scalar mean =r(mean);
 13.         estadd scalar mean;
 14.         scalar std =r(sd);
 15.         estadd scalar std;
 16.         est store `x'_ae2, title (`x');
 17. };
 18. };

Linear regression                               Number of obs     =     21,414
                                                F(35, 500)        =      32.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0741
                                                Root MSE          =     130.22

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
      home_prod_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   9.262361   5.313716     1.74   0.082    -1.177601    19.70232
              wave3 |  -14.43322   4.228147    -3.41   0.001    -22.74034   -6.126094
           nbani197 |   5.374796   1.810187     2.97   0.003     1.818284    8.931307
           nbani297 |   3.363434   .7979642     4.22   0.000     1.795658     4.93121
               ha97 |   3.788218   .8012381     4.73   0.000     2.214009    5.362426
              no497 |  -30.43021      3.197    -9.52   0.000    -36.71141     -24.149
             big497 |  -2.377062   4.949181    -0.48   0.631    -12.10082    7.346693
             age_hh |    1.62464   .5621891     2.89   0.004     .5200957    2.729184
            age_hh2 |  -.0140609   .0053958    -2.61   0.009    -.0246621   -.0034596
          female_hh |  -11.81849   4.923271    -2.40   0.017    -21.49134   -2.145643
           educ1_hh |  -3.276409   3.321368    -0.99   0.324    -9.801967     3.24915
       ethnicity_hh |   1.376976   5.644329     0.24   0.807     -9.71255     12.4665
             age_sp |   .6959231   .5574922     1.25   0.213    -.3993929    1.791239
            age_sp2 |  -.0100944   .0059329    -1.70   0.089    -.0217508    .0015621
           educ1_sp |   4.167775   2.986065     1.40   0.163    -1.699005    10.03455
         dage0_7_97 |   5.441148   2.697193     2.02   0.044     .1419193    10.74038
        dage8_17_97 |   7.901604   2.410023     3.28   0.001     3.166585    12.63662
       dage18_54_97 |   9.225271   4.718039     1.96   0.051    -.0443542     18.4949
         dage55p_97 |  -.8898355   3.335928    -0.27   0.790    -7.443999    5.664328
          hhsize_ae |   9.739218    .843261    11.55   0.000     8.082446    11.39599
          homeown97 |   4.151878   4.408027     0.94   0.347    -4.508659    12.81242
        dirtfloor97 |   3.164369   3.223718     0.98   0.327    -3.169334    9.498072
      electricity97 |   3.204267    4.21159     0.76   0.447    -5.070328    11.47886
         org_faenas |  -10.91675   9.209789    -1.19   0.236     -29.0114    7.177906
           min_dist |  -.1280736   .0708645    -1.81   0.071    -.2673025    .0111553
       lnup_cwagepm |   9.341329   8.144488     1.15   0.252    -6.660308    25.34297
       up2_mcwagepm |   55.61527   59.39001     0.94   0.349    -61.06946       172.3
       dummy_age_hh |  -16.04099   28.35749    -0.57   0.572    -71.75551    39.67354
      dummy_educ_hh |    33.1372   17.80715     1.86   0.063     -1.84885    68.12325
 dummy_ethnicity_hh |   8.772357   20.90489     0.42   0.675    -32.29989     49.8446
       dummy_age_sp |  -9.532921   14.83011    -0.64   0.521    -38.66994    19.60409
      dummy_educ_sp |   4.986897   14.75677     0.34   0.736    -24.00601    33.97981
   dummy_dage0_7_97 |   64.30857    29.0675     2.21   0.027     7.199074    121.4181
  dummy_dirtfloor97 |   13.23728   17.69729     0.75   0.455    -21.53294    48.00749
dummy_electricity97 |   43.29229   43.00472     1.01   0.315    -41.19993    127.7845
              _cons |  -41.13604   53.36296    -0.77   0.441    -145.9793    63.70722
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~t |      8,011    117.8995    133.9981          0   590.4396

added scalar:
               e(mean) =  117.89947

added scalar:
                e(std) =  133.99812

Linear regression                               Number of obs     =     21,414
                                                F(35, 500)        =      31.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0746
                                                Root MSE          =     130.19

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
      home_prod_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   9.166709   5.324214     1.72   0.086    -1.293879     19.6273
              wave3 |  -14.29471   4.228241    -3.38   0.001    -22.60201   -5.987396
           nbani197 |   5.432741   1.817879     2.99   0.003     1.861119    9.004364
           nbani297 |    3.37443   .7977562     4.23   0.000     1.807062    4.941797
               ha97 |   3.766202   .7997689     4.71   0.000      2.19488    5.337524
              no497 |  -30.38951   3.196862    -9.51   0.000    -36.67045   -24.10857
             big497 |  -2.138721   4.940682    -0.43   0.665    -11.84578    7.568335
             age_hh |   1.750561   .5614147     3.12   0.002     .6475383    2.853584
            age_hh2 |  -.0151328   .0053855    -2.81   0.005    -.0257138   -.0045517
          female_hh |   -11.5638   4.915867    -2.35   0.019    -21.22211   -1.905503
           educ1_hh |  -3.259378   3.323833    -0.98   0.327    -9.789779    3.271023
       ethnicity_hh |   1.180759   5.651255     0.21   0.835    -9.922373    12.28389
             age_sp |    .839384    .554228     1.51   0.131    -.2495186    1.928287
            age_sp2 |  -.0111605   .0058964    -1.89   0.059    -.0227452    .0004243
           educ1_sp |   4.180238   2.974799     1.41   0.161    -1.664407    10.02488
         dage0_7_97 |   .4409104   2.769366     0.16   0.874    -5.000118    5.881939
        dage8_17_97 |   8.124982   2.400055     3.39   0.001     3.409546    12.84042
       dage18_54_97 |   9.714777   4.675996     2.08   0.038     .5277549     18.9018
         dage55p_97 |  -1.265758   3.339249    -0.38   0.705    -7.826447     5.29493
         hhsize_ae2 |   9.628711   .8514901    11.31   0.000     7.955771    11.30165
          homeown97 |    4.08712   4.411738     0.93   0.355    -4.580709    12.75495
        dirtfloor97 |   3.179344   3.222656     0.99   0.324    -3.152271     9.51096
      electricity97 |   3.362894   4.216559     0.80   0.426    -4.921464    11.64725
         org_faenas |  -10.75382   9.224891    -1.17   0.244    -28.87815    7.370506
           min_dist |  -.1258106   .0709142    -1.77   0.077    -.2651371     .013516
       lnup_cwagepm |   9.276438    8.15552     1.14   0.256    -6.746873    25.29975
       up2_mcwagepm |   54.81264    59.3842     0.92   0.356    -61.86067     171.486
       dummy_age_hh |  -15.09338   29.44466    -0.51   0.608    -72.94389    42.75713
      dummy_educ_hh |   32.82087   17.66239     1.86   0.064    -1.880782    67.52252
 dummy_ethnicity_hh |   9.094398   21.03436     0.43   0.666    -32.23222    50.42102
       dummy_age_sp |  -8.512342   14.36274    -0.59   0.554     -36.7311    19.70641
      dummy_educ_sp |   4.396802    14.2411     0.31   0.758    -23.58296    32.37657
   dummy_dage0_7_97 |   61.57361   29.12379     2.11   0.035     4.353518    118.7937
  dummy_dirtfloor97 |   12.86693    17.7316     0.73   0.468     -21.9707    47.70456
dummy_electricity97 |   44.14325   44.04697     1.00   0.317     -42.3967    130.6832
              _cons |  -48.09221   53.43087    -0.90   0.369    -153.0689    56.88448
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~t |      8,011    117.8995    133.9981          0   590.4396

added scalar:
               e(mean) =  117.89947

added scalar:
                e(std) =  133.99812

.         ***Output for Table 4;
. estout home_prod_tot_pp_ae2_c home_prod_tot_w3_pp_ae2_c maiz_c frijol_c ani_prod_c credit_farm_c
>         using "$out_p/supporting.text", stats(N mean std, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)" 
>         "SD Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Income - Eligibles) replace;
(note: file C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/supporting.text not found)
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/supporting.text)

. ***Appendix -- Output for Table A3;
. estout home_prod_tot_pp_ae2_c home_prod_tot_pp_ae_c home_prod_tot_c home_prod_tot_ae2 home_prod_tot_ae 
>          home_prod_tot_w3_pp_ae2_c home_prod_tot_w3_pp_ae_c home_prod_tot_w3_c home_prod_tot_w3_ae2 home_prod_tot_w3_ae 
>         using "$out_p/supporting.text", stats(N mean std, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)" 
>         "SD Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Income pp ae Appendix) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/supporting.text)

. *=====================================================
> Supporting Evidence - Credit (Waves 2 & 3), Transfers from Friends, Transfers to Friends (waves 2 and 4) -- Eligibles -- Ta
> ble 6
> *=====================================================;
. foreach x of global credit {;
  2. foreach y of global treatcom1 {;
  3.         reg `x' `y' $basic $controls, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         scalar std =r(sd);
  8.         estadd scalar std;
  9.         est store `x'_c, title (`x');
 10. };
 11. };

Linear regression                               Number of obs     =     22,357
                                                F(34, 500)        =       6.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0112
                                                Root MSE          =     .19075

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             credit |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0003198   .0046574     0.07   0.945    -.0088307    .0094703
           nbani197 |   .0037881   .0021722     1.74   0.082    -.0004797    .0080559
           nbani297 |    .001583   .0010787     1.47   0.143    -.0005363    .0037023
               ha97 |    .000862   .0008983     0.96   0.338    -.0009029    .0026269
              no497 |  -.0045764   .0043513    -1.05   0.293    -.0131256    .0039727
             big497 |    .008256   .0051448     1.60   0.109    -.0018521    .0183642
             age_hh |   .0002631     .00086     0.31   0.760    -.0014266    .0019528
            age_hh2 |  -6.72e-07   8.23e-06    -0.08   0.935    -.0000168    .0000155
          female_hh |    .007924   .0067306     1.18   0.240    -.0052998    .0211479
           educ1_hh |   .0004253   .0041221     0.10   0.918    -.0076736    .0085241
       ethnicity_hh |   -.007527   .0045522    -1.65   0.099    -.0164708    .0014168
             age_sp |   .0005253   .0008288     0.63   0.526     -.001103    .0021536
            age_sp2 |  -8.27e-06   8.29e-06    -1.00   0.319    -.0000245    8.01e-06
           educ1_sp |  -.0092523   .0045442    -2.04   0.042    -.0181804   -.0003243
         dage0_7_97 |   .0041073   .0040353     1.02   0.309    -.0038209    .0120355
        dage8_17_97 |   .0009649     .00355     0.27   0.786      -.00601    .0079397
       dage18_54_97 |   .0074937   .0053956     1.39   0.165    -.0031071    .0180945
         dage55p_97 |  -.0084244   .0041622    -2.02   0.043    -.0166021   -.0002468
           hhsize97 |  -.0002131   .0008105    -0.26   0.793    -.0018056    .0013794
          homeown97 |   .0057343    .005266     1.09   0.277    -.0046119    .0160805
        dirtfloor97 |   .0018806   .0036453     0.52   0.606    -.0052814    .0090427
      electricity97 |   .0035032   .0043318     0.81   0.419    -.0050075    .0120138
         org_faenas |  -.0017294   .0058214    -0.30   0.767    -.0131668     .009708
           min_dist |  -.0002372   .0000622    -3.81   0.000    -.0003593    -.000115
       lnup_cwagepm |   .0183101   .0067241     2.72   0.007      .005099    .0315211
       up2_mcwagepm |   .1168893   .0437147     2.67   0.008     .0310021    .2027764
       dummy_age_hh |  -.0110791    .011526    -0.96   0.337    -.0337244    .0115662
      dummy_educ_hh |   .0649428     .04242     1.53   0.126    -.0184006    .1482862
 dummy_ethnicity_hh |  -.0427999   .0051293    -8.34   0.000    -.0528775   -.0327223
       dummy_age_sp |  -.0157177   .0162502    -0.97   0.334    -.0476448    .0162093
      dummy_educ_sp |    .009934    .015322     0.65   0.517    -.0201694    .0400374
   dummy_dage0_7_97 |   .0201542   .0425559     0.47   0.636    -.0634562    .1037647
  dummy_dirtfloor97 |  -.0153121   .0166892    -0.92   0.359    -.0481017    .0174774
dummy_electricity97 |  -.0372142   .0078118    -4.76   0.000    -.0525622   -.0218662
              _cons |  -.0781624   .0460423    -1.70   0.090    -.1686226    .0122979
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      credit |      8,358    .0388849    .1933322          0          1

added scalar:
               e(mean) =  .0388849

added scalar:
                e(std) =  .19333219

Linear regression                               Number of obs     =     22,350
                                                F(34, 500)        =       5.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0019
                                                Root MSE          =     .12621

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
        credit_cons |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0010752   .0026674    -0.40   0.687    -.0063158    .0041655
           nbani197 |   .0001637   .0011476     0.14   0.887    -.0020911    .0024184
           nbani297 |   -.000372   .0004374    -0.85   0.395    -.0012314    .0004874
               ha97 |   .0007852   .0006107     1.29   0.199    -.0004147    .0019851
              no497 |  -.0050251   .0027048    -1.86   0.064    -.0103393    .0002891
             big497 |  -.0006032   .0037774    -0.16   0.873    -.0080247    .0068182
             age_hh |   -.000163   .0005174    -0.32   0.753    -.0011795    .0008535
            age_hh2 |   1.67e-06   4.81e-06     0.35   0.728    -7.77e-06    .0000111
          female_hh |   .0050519   .0042398     1.19   0.234     -.003278    .0133819
           educ1_hh |   .0007834   .0025914     0.30   0.763    -.0043079    .0058748
       ethnicity_hh |   -.001404    .002765    -0.51   0.612    -.0068364    .0040284
             age_sp |  -.0001917   .0005321    -0.36   0.719    -.0012371    .0008538
            age_sp2 |   3.13e-07   5.41e-06     0.06   0.954    -.0000103    .0000109
           educ1_sp |   .0029256   .0028785     1.02   0.310    -.0027299    .0085811
         dage0_7_97 |  -.0005327   .0026913    -0.20   0.843    -.0058204     .004755
        dage8_17_97 |   .0006395   .0022974     0.28   0.781    -.0038743    .0051532
       dage18_54_97 |   .0050083   .0036594     1.37   0.172    -.0021813     .012198
         dage55p_97 |  -.0025066   .0025782    -0.97   0.331     -.007572    .0025589
           hhsize97 |   .0000123   .0004977     0.02   0.980    -.0009656    .0009901
          homeown97 |   .0014704   .0035967     0.41   0.683    -.0055961    .0085369
        dirtfloor97 |   .0019855   .0019493     1.02   0.309    -.0018443    .0058152
      electricity97 |   .0022168   .0027416     0.81   0.419    -.0031698    .0076034
         org_faenas |   .0038975   .0028644     1.36   0.174    -.0017303    .0095253
           min_dist |  -.0000243   .0000334    -0.73   0.467    -.0000898    .0000413
       lnup_cwagepm |   .0051713   .0022666     2.28   0.023     .0007181    .0096245
       up2_mcwagepm |   .0407891   .0156896     2.60   0.010     .0099635    .0716148
       dummy_age_hh |  -.0110795   .0069433    -1.60   0.111    -.0247212    .0025623
      dummy_educ_hh |     .01988   .0232754     0.85   0.393    -.0258497    .0656096
 dummy_ethnicity_hh |  -.0152616   .0024058    -6.34   0.000    -.0199883   -.0105349
       dummy_age_sp |   .0090605   .0066653     1.36   0.175    -.0040349    .0221559
      dummy_educ_sp |  -.0109945   .0063896    -1.72   0.086    -.0235482    .0015592
   dummy_dage0_7_97 |   .0388149   .0416884     0.93   0.352    -.0430911     .120721
  dummy_dirtfloor97 |   .0049547   .0183295     0.27   0.787    -.0310576    .0409671
dummy_electricity97 |  -.0158177     .00309    -5.12   0.000    -.0218887   -.0097467
              _cons |  -.0173097   .0210135    -0.82   0.410    -.0585953     .023976
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 credit_cons |      8,357    .0171114    .1296943          0          1

added scalar:
               e(mean) =  .0171114

added scalar:
                e(std) =  .12969432

Linear regression                               Number of obs     =     22,350
                                                F(34, 500)        =       2.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0099
                                                Root MSE          =     .09261

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
        credit_farm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |   .0041345   .0018001     2.30   0.022     .0005979    .0076711
           nbani197 |   .0022233    .001278     1.74   0.083    -.0002876    .0047341
           nbani297 |    .001809   .0007558     2.39   0.017      .000324     .003294
               ha97 |  -.0002978   .0004356    -0.68   0.494    -.0011537    .0005581
              no497 |  -.0025499   .0015975    -1.60   0.111    -.0056885    .0005888
             big497 |   .0094638   .0033251     2.85   0.005     .0029309    .0159967
             age_hh |   .0001635   .0004028     0.41   0.685    -.0006279    .0009549
            age_hh2 |  -9.43e-07   4.12e-06    -0.23   0.819    -9.04e-06    7.15e-06
          female_hh |  -.0014601   .0036323    -0.40   0.688    -.0085966    .0056764
           educ1_hh |   .0001739    .001702     0.10   0.919    -.0031701    .0035179
       ethnicity_hh |  -.0024677   .0017054    -1.45   0.149    -.0058184     .000883
             age_sp |   .0005857   .0004467     1.31   0.190     -.000292    .0014634
            age_sp2 |  -5.98e-06   4.70e-06    -1.27   0.204    -.0000152    3.26e-06
           educ1_sp |  -.0053207   .0023938    -2.22   0.027     -.010024   -.0006175
         dage0_7_97 |   .0019241   .0017681     1.09   0.277    -.0015497     .005398
        dage8_17_97 |   .0009378   .0017206     0.55   0.586    -.0024428    .0043183
       dage18_54_97 |   .0013462   .0029731     0.45   0.651     -.004495    .0071875
         dage55p_97 |  -.0028583   .0020445    -1.40   0.163    -.0068752    .0011585
           hhsize97 |  -.0003311   .0004128    -0.80   0.423    -.0011421      .00048
          homeown97 |   .0010835   .0026429     0.41   0.682     -.004109    .0062759
        dirtfloor97 |   .0008971   .0018342     0.49   0.625    -.0027067    .0045008
      electricity97 |  -.0016102   .0018028    -0.89   0.372    -.0051522    .0019318
         org_faenas |   .0011479   .0018289     0.63   0.531    -.0024454    .0047413
           min_dist |  -.0000828   .0000259    -3.19   0.001    -.0001338   -.0000319
       lnup_cwagepm |   .0060111   .0024184     2.49   0.013     .0012597    .0107626
       up2_mcwagepm |   .0422341   .0199876     2.11   0.035     .0029639    .0815042
       dummy_age_hh |   -.000787   .0068704    -0.11   0.909    -.0142854    .0127115
      dummy_educ_hh |   .0070973   .0167207     0.42   0.671    -.0257541    .0399487
 dummy_ethnicity_hh |   -.011676   .0028894    -4.04   0.000     -.017353   -.0059991
       dummy_age_sp |  -.0053367   .0107544    -0.50   0.620    -.0264662    .0157928
      dummy_educ_sp |   .0077739    .010465     0.74   0.458    -.0127869    .0283347
   dummy_dage0_7_97 |  -.0058962   .0045868    -1.29   0.199     -.014908    .0031156
  dummy_dirtfloor97 |  -.0063965      .0027    -2.37   0.018    -.0117012   -.0010918
dummy_electricity97 |  -.0072419   .0023903    -3.03   0.003    -.0119383   -.0025456
              _cons |  -.0416177   .0157907    -2.64   0.009     -.072642   -.0105934
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 credit_farm |      8,357    .0064616     .080129          0          1

added scalar:
               e(mean) =  .00646165

added scalar:
                e(std) =  .08012905

Linear regression                               Number of obs     =     22,245
                                                F(34, 500)        =      16.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0545
                                                Root MSE          =     .24888

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
            trans_t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0049336   .0056331    -0.88   0.382    -.0160011    .0061339
           nbani197 |   .0031654   .0024126     1.31   0.190    -.0015748    .0079056
           nbani297 |   .0013518   .0009686     1.40   0.163    -.0005511    .0032547
               ha97 |  -.0004225   .0013365    -0.32   0.752    -.0030484    .0022034
              no497 |   .0013204   .0059385     0.22   0.824     -.010347    .0129879
             big497 |  -.0058175   .0083211    -0.70   0.485    -.0221661    .0105311
             age_hh |  -.0015244   .0012893    -1.18   0.238    -.0040575    .0010086
            age_hh2 |   .0000283   .0000135     2.10   0.037     1.77e-06    .0000549
          female_hh |   .0455907   .0134041     3.40   0.001     .0192554    .0719259
           educ1_hh |  -.0087185   .0046604    -1.87   0.062    -.0178749     .000438
       ethnicity_hh |  -.0194771   .0055315    -3.52   0.000    -.0303449   -.0086093
             age_sp |   .0043125   .0014264     3.02   0.003       .00151    .0071151
            age_sp2 |  -.0000365   .0000167    -2.18   0.030    -.0000693   -3.63e-06
           educ1_sp |   .0059353   .0040017     1.48   0.139    -.0019269    .0137975
         dage0_7_97 |  -.0202941   .0063063    -3.22   0.001    -.0326841    -.007904
        dage8_17_97 |  -.0034789    .004745    -0.73   0.464    -.0128014    .0058437
       dage18_54_97 |  -.1283622   .0150692    -8.52   0.000     -.157969   -.0987554
         dage55p_97 |  -.0145754   .0061062    -2.39   0.017    -.0265724   -.0025784
           hhsize97 |   .0033904   .0012808     2.65   0.008      .000874    .0059067
          homeown97 |   .0073587   .0069227     1.06   0.288    -.0062424    .0209598
        dirtfloor97 |  -.0035333   .0041975    -0.84   0.400    -.0117802    .0047136
      electricity97 |   .0098407   .0047584     2.07   0.039     .0004918    .0191896
         org_faenas |   .0116885   .0083151     1.41   0.160    -.0046483    .0280253
           min_dist |  -.0000143   .0000628    -0.23   0.820    -.0001377     .000109
       lnup_cwagepm |   .0207739   .0037189     5.59   0.000     .0134673    .0280805
       up2_mcwagepm |   .1144215   .0238314     4.80   0.000     .0675996    .1612434
       dummy_age_hh |  -.0420291   .0312037    -1.35   0.179    -.1033356    .0192773
      dummy_educ_hh |   .0158374   .0432636     0.37   0.714    -.0691635    .1008382
 dummy_ethnicity_hh |  -.0492843    .026033    -1.89   0.059    -.1004318    .0018632
       dummy_age_sp |   .1050894   .0177027     5.94   0.000     .0703085    .1398703
      dummy_educ_sp |  -.0614722    .014941    -4.11   0.000     -.090827   -.0321174
   dummy_dage0_7_97 |  -.0372762   .0806624    -0.46   0.644    -.1957553    .1212029
  dummy_dirtfloor97 |   .0707447   .0468216     1.51   0.131    -.0212468    .1627361
dummy_electricity97 |   .1933411   .1081103     1.79   0.074    -.0190655    .4057476
              _cons |  -.0486324   .0365684    -1.33   0.184    -.1204791    .0232143
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     trans_t |      8,441    .0726217    .2595299          0          1

added scalar:
               e(mean) =  .07262173

added scalar:
                e(std) =  .25952994

Linear regression                               Number of obs     =     22,243
                                                F(34, 500)        =       1.64
                                                Prob > F          =     0.0139
                                                R-squared         =     0.0026
                                                Root MSE          =     .06238

                                      (Std. Err. adjusted for 501 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
          trans_out |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           t2_c1_op |  -.0009663    .001124    -0.86   0.390    -.0031747    .0012421
           nbani197 |  -.0000684   .0004766    -0.14   0.886    -.0010047     .000868
           nbani297 |   .0002759   .0002192     1.26   0.209    -.0001548    .0007066
               ha97 |   -.000268   .0002937    -0.91   0.362     -.000845     .000309
              no497 |  -.0016195   .0014215    -1.14   0.255    -.0044123    .0011733
             big497 |   .0022978   .0016692     1.38   0.169    -.0009818    .0055773
             age_hh |    .000125   .0002478     0.50   0.614    -.0003618    .0006117
            age_hh2 |  -1.98e-06   2.16e-06    -0.92   0.359    -6.22e-06    2.26e-06
          female_hh |  -.0024921    .001895    -1.32   0.189    -.0062152     .001231
           educ1_hh |  -.0016944   .0013392    -1.27   0.206    -.0043256    .0009368
       ethnicity_hh |  -.0014877   .0012013    -1.24   0.216    -.0038479    .0008725
             age_sp |   .0001221   .0002359     0.52   0.605    -.0003414    .0005856
            age_sp2 |  -9.91e-07   2.31e-06    -0.43   0.668    -5.53e-06    3.55e-06
           educ1_sp |  -.0005722   .0015688    -0.36   0.715    -.0036544      .00251
         dage0_7_97 |   .0003718   .0011989     0.31   0.757    -.0019837    .0027272
        dage8_17_97 |    .000462   .0011699     0.39   0.693    -.0018365    .0027605
       dage18_54_97 |  -.0009047   .0016506    -0.55   0.584    -.0041476    .0023382
         dage55p_97 |  -.0001959   .0011228    -0.17   0.862    -.0024019    .0020102
           hhsize97 |  -.0001778    .000244    -0.73   0.467    -.0006573    .0003017
          homeown97 |  -.0004255   .0018902    -0.23   0.822    -.0041393    .0032882
        dirtfloor97 |  -.0019959   .0011777    -1.69   0.091    -.0043097     .000318
      electricity97 |   .0005224   .0010292     0.51   0.612    -.0014997    .0025445
         org_faenas |  -.0010691   .0019714    -0.54   0.588    -.0049423    .0028041
           min_dist |   -.000028   .0000122    -2.29   0.022    -.0000521   -4.00e-06
       lnup_cwagepm |   .0017214   .0011015     1.56   0.119    -.0004427    .0038856
       up2_mcwagepm |   .0077325   .0070199     1.10   0.271    -.0060597    .0215247
       dummy_age_hh |    .001932   .0020011     0.97   0.335    -.0019996    .0058636
      dummy_educ_hh |  -.0023746   .0007146    -3.32   0.001    -.0037786   -.0009705
 dummy_ethnicity_hh |  -.0042343    .000894    -4.74   0.000    -.0059906   -.0024779
       dummy_age_sp |   .0048471    .001693     2.86   0.004     .0015208    .0081734
      dummy_educ_sp |  -.0033027   .0010542    -3.13   0.002    -.0053739   -.0012315
   dummy_dage0_7_97 |  -.0031489   .0024225    -1.30   0.194    -.0079085    .0016108
  dummy_dirtfloor97 |   .0136783   .0187182     0.73   0.465    -.0230976    .0504543
dummy_electricity97 |  -.0031575   .0014147    -2.23   0.026    -.0059369    -.000378
              _cons |  -.0012256   .0086393    -0.14   0.887    -.0181995    .0157482
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   trans_out |      8,441    .0043834    .0660656          0          1

added scalar:
               e(mean) =  .00438337

added scalar:
                e(std) =  .06606565

. ***Output for Table 6;
. estout credit_c credit_cons_c credit_farm_c trans_t_c trans_out_c
>         using "$out_p/supporting.text", stats(N mean std, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)" 
>         "SD Dep Var Unconditional Sample (Control Households)")) 
>         keep(t2_c1_op) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Credit - Eligibles) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/supporting.text)

. *=====================================================
> Supporting Evidence - Crops Production, Animal Production Sales, Productive Loans and Agricultural Income A & B)  -- Table 
> A7 INELIGIBLES
> *=====================================================;
. estimates clear;

. preserve;

. keep if ineligible ==1;
(53,796 observations deleted)

. foreach y of global treatcom2 {;
  2. foreach x of global home3 {;
  3.         reg `x' `y' $basic $controls if home_prod_tot_w3_tile <=95 & wave ==3, cl(comuid);
  4.         sum `x' if e(sample) & `y' ==0;
  5.         scalar mean =r(mean);
  6.         estadd scalar mean;
  7.         scalar std =r(sd);
  8.         estadd scalar std;
  9.         est store `x'_c, title (`x');
 10. };
 11. foreach x of global dep_d {;
 12.         reg `x' `y' wave3 $basic $controls, cl(comuid);
 13.         sum `x' if e(sample) & `y' ==0;
 14.         scalar mean =r(mean);
 15.         estadd scalar mean;
 16.         scalar std =r(sd);
 17.         estadd scalar std;
 18.         est store `x'_c, title (`x');
 19. };
 20. foreach x of global home {;
 21.         reg `x' `y' wave3 $basic $controls if home_prod_tot_tile <=95, cl(comuid);
 22.         sum `x' if e(sample) & `y' ==0;
 23.         scalar mean =r(mean);
 24.         estadd scalar mean;
 25.         scalar std =r(sd);
 26.         estadd scalar std;
 27.         est store `x'_c, title (`x');
 28. };
 29. };

Linear regression                               Number of obs     =      4,025
                                                F(32, 433)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0662
                                                Root MSE          =     130.36

                                      (Std. Err. adjusted for 434 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
   home_prod_tot_w3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |  -2.738144   8.841065    -0.31   0.757    -20.11488     14.6386
           nbani197 |    3.19255   2.197753     1.45   0.147    -1.127041    7.512142
           nbani297 |  -.8150268   .7644683    -1.07   0.287    -2.317557    .6875033
               ha97 |   1.919891   .9424509     2.04   0.042     .0675431    3.772238
              no497 |  -25.87753   7.476458    -3.46   0.001     -40.5722   -11.18287
             big497 |   23.63511   7.417488     3.19   0.002     9.056354    38.21387
             age_hh |   .7624117   1.321659     0.58   0.564    -1.835254    3.360077
            age_hh2 |  -.0067596   .0115363    -0.59   0.558    -.0294338    .0159145
          female_hh |   2.405875   8.353145     0.29   0.773    -14.01188    18.82363
           educ1_hh |  -5.823623   6.600862    -0.88   0.378    -18.79734    7.150092
       ethnicity_hh |  -9.144253   9.543741    -0.96   0.339    -27.90207    9.613567
             age_sp |   .7041982   1.476503     0.48   0.634    -2.197806    3.606203
            age_sp2 |  -.0109603   .0146874    -0.75   0.456    -.0398279    .0179072
           educ1_sp |   2.254859   7.361794     0.31   0.760    -12.21443    16.72415
         dage0_7_97 |  -18.15579   5.920274    -3.07   0.002    -29.79183   -6.519736
        dage8_17_97 |  -6.117435   5.568974    -1.10   0.273    -17.06302    4.828147
       dage18_54_97 |   16.79677   6.614562     2.54   0.011     3.796124    29.79741
         dage55p_97 |   4.780691   6.936529     0.69   0.491    -8.852764    18.41415
           hhsize97 |   7.817434   1.647465     4.75   0.000     4.579412    11.05546
          homeown97 |   3.863061   9.959468     0.39   0.698    -15.71185    23.43797
        dirtfloor97 |   5.743634    5.62949     1.02   0.308     -5.32089    16.80816
      electricity97 |   7.899986   8.412526     0.94   0.348    -8.634477    24.43445
         org_faenas |  -6.594485    10.7481    -0.61   0.540    -27.71942    14.53045
           min_dist |   -.112794   .1069048    -1.06   0.292    -.3229108    .0973229
       lnup_cwagepm |   24.69631   11.28437     2.19   0.029     2.517355    46.87526
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |   13.26546   65.71746     0.20   0.840    -115.8994    142.4303
      dummy_educ_hh |    .487607   22.67925     0.02   0.983     -44.0875    45.06271
 dummy_ethnicity_hh |   31.97139   34.76701     0.92   0.358    -36.36169    100.3045
       dummy_age_sp |   -87.9816   20.44204    -4.30   0.000    -128.1596   -47.80365
      dummy_educ_sp |   74.11868   20.17361     3.67   0.000      34.4683    113.7691
   dummy_dage0_7_97 |   -93.8291   14.26492    -6.58   0.000    -121.8662   -65.79201
  dummy_dirtfloor97 |  -45.94711   24.43249    -1.88   0.061    -93.96814    2.073927
dummy_electricity97 |  -36.71269   13.36712    -2.75   0.006    -62.98519   -10.44018
              _cons |  -121.7828   77.52888    -1.57   0.117    -274.1625    30.59698
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~3 |      1,542    112.6469    138.3873          0   594.7755

added scalar:
               e(mean) =  112.6469

added scalar:
                e(std) =  138.38734

Linear regression                               Number of obs     =      4,024
                                                F(32, 433)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0542
                                                Root MSE          =     41.661

                                      (Std. Err. adjusted for 434 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_w3~ae |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |  -.4634686   2.480248    -0.19   0.852     -5.33829    4.411353
           nbani197 |   .7143262    .585107     1.22   0.223    -.4356769    1.864329
           nbani297 |  -.0927448   .2155646    -0.43   0.667    -.5164279    .3309383
               ha97 |   .4022544   .2684481     1.50   0.135     -.125369    .9298778
              no497 |  -3.282599   3.498087    -0.94   0.349    -10.15794    3.592744
             big497 |   8.085063    2.40384     3.36   0.001     3.360417    12.80971
             age_hh |    .289459   .4763697     0.61   0.544    -.6468256    1.225744
            age_hh2 |  -.0032336   .0043127    -0.75   0.454      -.01171    .0052428
          female_hh |  -3.381469   3.968303    -0.85   0.395      -11.181    4.418063
           educ1_hh |  -.5002077   2.070812    -0.24   0.809    -4.570302    3.569887
       ethnicity_hh |  -3.749537   2.564758    -1.46   0.144    -8.790461    1.291386
             age_sp |     .44065   .5046211     0.87   0.383    -.5511615    1.432462
            age_sp2 |  -.0056005    .005212    -1.07   0.283    -.0158446    .0046436
           educ1_sp |   .4853962   2.015678     0.24   0.810    -3.476334    4.447126
         dage0_7_97 |  -2.292507   1.543163    -1.49   0.138    -5.325528    .7405133
        dage8_17_97 |  -4.211702   1.640058    -2.57   0.011    -7.435166   -.9882383
       dage18_54_97 |   -3.65064   3.139643    -1.16   0.246    -9.821477    2.520196
         dage55p_97 |   1.501784   1.969371     0.76   0.446    -2.368932      5.3725
           hhsize97 |  -2.037945   .3776251    -5.40   0.000    -2.780151   -1.295739
          homeown97 |   .1107124   3.733035     0.03   0.976     -7.22641    7.447835
        dirtfloor97 |   2.054099   1.849593     1.11   0.267    -1.581198    5.689396
      electricity97 |   2.127459   2.746341     0.77   0.439    -3.270359    7.525276
         org_faenas |   -1.70508   3.723278    -0.46   0.647    -9.023025    5.612865
           min_dist |  -.0118666   .0307393    -0.39   0.700    -.0722834    .0485502
       lnup_cwagepm |   7.309268   3.439482     2.13   0.034     .5491121    14.06942
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |   10.15435   32.84657     0.31   0.757     -54.4042    74.71289
      dummy_educ_hh |  -.3336102   7.062013    -0.05   0.962     -14.2137    13.54648
 dummy_ethnicity_hh |   23.58102   23.13516     1.02   0.309    -21.89015    69.05219
       dummy_age_sp |  -1.728127   8.145741    -0.21   0.832    -17.73824    14.28198
      dummy_educ_sp |   7.189107   7.926937     0.91   0.365    -8.390952    22.76917
   dummy_dage0_7_97 |  -45.14178   6.259552    -7.21   0.000    -57.44466   -32.83889
  dummy_dirtfloor97 |   -8.96515    7.75391    -1.16   0.248    -24.20513    6.274832
dummy_electricity97 |  -28.19399   4.537732    -6.21   0.000    -37.11271   -19.27527
              _cons |  -17.75323    23.2779    -0.76   0.446    -63.50495    27.99849
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home~3_pp_ae |      1,541    30.68432    42.92354          0   435.8463

added scalar:
               e(mean) =  30.684323

added scalar:
                e(std) =  42.923541

Linear regression                               Number of obs     =      4,024
                                                F(32, 433)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0579
                                                Root MSE          =     41.124

                                      (Std. Err. adjusted for 434 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_w3_~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |  -.2173536   2.431199    -0.09   0.929    -4.995773    4.561066
           nbani197 |   .6611228   .5738232     1.15   0.250    -.4667026    1.788948
           nbani297 |  -.0913857   .2099097    -0.44   0.664    -.5039544     .321183
               ha97 |   .3962236   .2672252     1.48   0.139    -.1289963    .9214435
              no497 |  -2.822695   3.472856    -0.81   0.417    -9.648446    4.003057
             big497 |   8.102911   2.369719     3.42   0.001     3.445328    12.76049
             age_hh |   .3300239    .466086     0.71   0.479    -.5860485    1.246096
            age_hh2 |  -.0035721   .0042403    -0.84   0.400    -.0119063    .0047621
          female_hh |  -3.393084    3.96802    -0.86   0.393    -11.19206    4.405893
           educ1_hh |  -.3918537   2.022856    -0.19   0.846    -4.367692    3.583985
       ethnicity_hh |  -3.771037   2.520803    -1.50   0.135     -8.72557    1.183495
             age_sp |   .5824143   .4924278     1.18   0.238    -.3854317     1.55026
            age_sp2 |  -.0067601    .005115    -1.32   0.187    -.0168133    .0032932
           educ1_sp |   .6272486   1.936955     0.32   0.746    -3.179754    4.434251
         dage0_7_97 |  -4.103464   1.500993    -2.73   0.007    -7.053603   -1.153326
        dage8_17_97 |  -3.184985   1.587969    -2.01   0.046    -6.306071   -.0638995
       dage18_54_97 |  -3.834417   3.140643    -1.22   0.223    -10.00722    2.338384
         dage55p_97 |    1.30273    1.95015     0.67   0.504    -2.530207    5.135668
           hhsize97 |  -1.961616   .3736654    -5.25   0.000     -2.69604   -1.227193
          homeown97 |   -.296104   3.669205    -0.08   0.936    -7.507771    6.915563
        dirtfloor97 |   2.164811   1.839591     1.18   0.240    -1.450827     5.78045
      electricity97 |   2.067793   2.718054     0.76   0.447    -3.274428    7.410014
         org_faenas |  -1.813067   3.740928    -0.48   0.628    -9.165703    5.539569
           min_dist |  -.0109082   .0303453    -0.36   0.719    -.0705506    .0487342
       lnup_cwagepm |   7.500686   3.409598     2.20   0.028     .7992659    14.20211
       up2_mcwagepm |          0  (omitted)
       dummy_age_hh |   10.21689   32.75828     0.31   0.755    -54.16813    74.60191
      dummy_educ_hh |  -.0923253   7.082255    -0.01   0.990     -14.0122    13.82755
 dummy_ethnicity_hh |   22.37741   22.79464     0.98   0.327     -22.4245    67.17931
       dummy_age_sp |  -1.475964   8.158275    -0.18   0.857    -17.51071    14.55878
      dummy_educ_sp |   7.632114   7.924538     0.96   0.336     -7.94323    23.20746
   dummy_dage0_7_97 |  -44.84516   6.420894    -6.98   0.000    -57.46516   -32.22517
  dummy_dirtfloor97 |  -8.479539    7.79544    -1.09   0.277    -23.80115    6.842068
dummy_electricity97 |  -28.24744   4.484784    -6.30   0.000    -37.06209   -19.43279
              _cons |  -24.48659   22.85474    -1.07   0.285    -69.40662    20.43344
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hom~3_pp_ae2 |      1,541    30.02455    42.19234          0   435.8463

added scalar:
               e(mean) =  30.024545

added scalar:
                e(std) =  42.192336

Linear regression                               Number of obs     =      9,086
                                                F(34, 441)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1213
                                                Root MSE          =     .46927

                                      (Std. Err. adjusted for 442 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
               maiz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0299055   .0284885     1.05   0.294    -.0260846    .0858955
              wave3 |  -.0664211    .013074    -5.08   0.000    -.0921162   -.0407261
           nbani197 |   .0417623   .0075385     5.54   0.000     .0269464    .0565782
           nbani297 |   .0035308   .0018678     1.89   0.059      -.00014    .0072017
               ha97 |  -.0005931   .0027898    -0.21   0.832    -.0060761    .0048899
              no497 |   -.241523   .0195379   -12.36   0.000    -.2799221    -.203124
             big497 |   .1334516   .0218382     6.11   0.000     .0905316    .1763715
             age_hh |    .001358    .003365     0.40   0.687    -.0052555    .0079715
            age_hh2 |  -.0000147   .0000308    -0.48   0.634    -.0000752    .0000458
          female_hh |  -.0661385   .0228451    -2.90   0.004    -.1110373   -.0212396
           educ1_hh |   .0226461    .018147     1.25   0.213    -.0130192    .0583113
       ethnicity_hh |   .0597706   .0265721     2.25   0.025      .007547    .1119943
             age_sp |   .0037985   .0034615     1.10   0.273    -.0030046    .0106016
            age_sp2 |  -.0000168   .0000361    -0.47   0.641    -.0000878    .0000541
           educ1_sp |   .0521543   .0193754     2.69   0.007     .0140747    .0902338
         dage0_7_97 |  -.0276439   .0159302    -1.74   0.083    -.0589525    .0036646
        dage8_17_97 |  -.0111906   .0152594    -0.73   0.464    -.0411808    .0187995
       dage18_54_97 |   .0040474   .0220039     0.18   0.854    -.0391982     .047293
         dage55p_97 |   .0251929   .0177288     1.42   0.156    -.0096505    .0600363
           hhsize97 |   .0090161   .0040329     2.24   0.026     .0010901    .0169422
          homeown97 |   .0779198   .0280596     2.78   0.006     .0227726    .1330669
        dirtfloor97 |   .0137985   .0151166     0.91   0.362     -.015911     .043508
      electricity97 |  -.0208344   .0255821    -0.81   0.416    -.0711124    .0294436
         org_faenas |   -.043302   .0450916    -0.96   0.337    -.1319231    .0453191
           min_dist |   .0000615   .0003677     0.17   0.867    -.0006611    .0007841
       lnup_cwagepm |  -.0162139   .0372514    -0.44   0.664    -.0894263    .0569984
       up2_mcwagepm |   .0654485   .3283664     0.20   0.842    -.5799089    .7108059
       dummy_age_hh |   .1646777   .1530107     1.08   0.282     -.136043    .4653984
      dummy_educ_hh |   .0118787   .0719357     0.17   0.869    -.1295007     .153258
 dummy_ethnicity_hh |   .2440703   .0813978     3.00   0.003     .0840946    .4040461
       dummy_age_sp |  -.1028342   .0426811    -2.41   0.016    -.1867178   -.0189506
      dummy_educ_sp |   .0648077   .0406308     1.60   0.111    -.0150463    .1446616
   dummy_dage0_7_97 |  -.0149535   .1320759    -0.11   0.910      -.27453     .244623
  dummy_dirtfloor97 |  -.0628399   .1437842    -0.44   0.662    -.3454272    .2197475
dummy_electricity97 |   .4381545   .0390427    11.22   0.000     .3614216    .5148875
              _cons |   .2388231   .2631127     0.91   0.365    -.2782876    .7559338
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        maiz |      3,539    .4628426    .4986879          0          1

added scalar:
               e(mean) =  .46284261

added scalar:
                e(std) =  .49868788

Linear regression                               Number of obs     =      9,086
                                                F(34, 441)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0424
                                                Root MSE          =     .30403

                                      (Std. Err. adjusted for 442 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
             frijol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0101375   .0175946     0.58   0.565    -.0244421    .0447172
              wave3 |  -.0135911   .0081006    -1.68   0.094    -.0295117    .0023295
           nbani197 |   .0142191   .0042858     3.32   0.001      .005796    .0226422
           nbani297 |   .0024778   .0013182     1.88   0.061    -.0001129    .0050686
               ha97 |  -.0009017   .0022031    -0.41   0.683    -.0052317    .0034282
              no497 |  -.0374013   .0089198    -4.19   0.000    -.0549318   -.0198708
             big497 |   .0400366   .0173465     2.31   0.021     .0059446    .0741287
             age_hh |   .0049808   .0018776     2.65   0.008     .0012906    .0086709
            age_hh2 |  -.0000472   .0000174    -2.72   0.007    -.0000813    -.000013
          female_hh |  -.0368705   .0139335    -2.65   0.008    -.0642549   -.0094861
           educ1_hh |   .0065193   .0104097     0.63   0.531    -.0139396    .0269781
       ethnicity_hh |  -.0260166   .0172231    -1.51   0.132    -.0598662     .007833
             age_sp |  -.0042801   .0022576    -1.90   0.059     -.008717    .0001568
            age_sp2 |   .0000546   .0000244     2.24   0.026     6.69e-06    .0001026
           educ1_sp |   .0026278   .0103659     0.25   0.800     -.017745    .0230005
         dage0_7_97 |  -.0154758   .0086408    -1.79   0.074    -.0324581    .0015065
        dage8_17_97 |  -.0274249   .0101721    -2.70   0.007    -.0474167    -.007433
       dage18_54_97 |  -.0303157   .0138096    -2.20   0.029    -.0574564   -.0031749
         dage55p_97 |   .0112182    .011887     0.94   0.346    -.0121439    .0345804
           hhsize97 |    .012581   .0023426     5.37   0.000      .007977    .0171849
          homeown97 |   .0207832   .0136733     1.52   0.129    -.0060897    .0476561
        dirtfloor97 |  -.0241452   .0098336    -2.46   0.014    -.0434717   -.0048186
      electricity97 |  -.0111329   .0193656    -0.57   0.566    -.0491933    .0269275
         org_faenas |   -.001595   .0218699    -0.07   0.942    -.0445771    .0413871
           min_dist |   .0004031   .0002571     1.57   0.118    -.0001022    .0009084
       lnup_cwagepm |   -.018782    .026625    -0.71   0.481    -.0711096    .0335457
       up2_mcwagepm |  -.0749943   .1747423    -0.43   0.668    -.4184255    .2684369
       dummy_age_hh |  -.1029297   .0413227    -2.49   0.013    -.1841436   -.0217159
      dummy_educ_hh |   .0629164   .0484588     1.30   0.195    -.0323225    .1581553
 dummy_ethnicity_hh |  -.0092666   .0537956    -0.17   0.863    -.1149943    .0964611
       dummy_age_sp |     .02713   .0313642     0.86   0.388    -.0345119    .0887718
      dummy_educ_sp |  -.0236572   .0309981    -0.76   0.446    -.0845797    .0372652
   dummy_dage0_7_97 |  -.1207377   .0381278    -3.17   0.002    -.1956725    -.045803
  dummy_dirtfloor97 |  -.0369392   .0651017    -0.57   0.571    -.1648873    .0910089
dummy_electricity97 |  -.1600783   .0296779    -5.39   0.000     -.218406   -.1017505
              _cons |   .0969518   .1821774     0.53   0.595     -.261092    .4549955
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      frijol |      3,539    .1028539    .3038109          0          1

added scalar:
               e(mean) =  .10285391

added scalar:
                e(std) =  .30381091

Linear regression                               Number of obs     =      9,086
                                                F(34, 441)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0496
                                                Root MSE          =     .36809

                                      (Std. Err. adjusted for 442 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
           ani_prod |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |  -.0026526   .0152958    -0.17   0.862    -.0327143    .0274091
              wave3 |  -.0228487   .0107746    -2.12   0.035    -.0440247   -.0016727
           nbani197 |   .0086491   .0047459     1.82   0.069    -.0006783    .0179764
           nbani297 |   .0114843   .0018623     6.17   0.000     .0078241    .0151444
               ha97 |  -.0018614   .0019918    -0.93   0.351     -.005776    .0020532
              no497 |  -.0835948   .0133416    -6.27   0.000    -.1098158   -.0573738
             big497 |   .0119406   .0145915     0.82   0.414    -.0167369    .0406181
             age_hh |    .002261     .00273     0.83   0.408    -.0031044    .0076264
            age_hh2 |  -.0000144    .000024    -0.60   0.548    -.0000616    .0000327
          female_hh |   .0039075   .0169233     0.23   0.818    -.0293528    .0371679
           educ1_hh |  -.0187432   .0134719    -1.39   0.165    -.0452202    .0077338
       ethnicity_hh |  -.0248871   .0177536    -1.40   0.162    -.0597793     .010005
             age_sp |   .0003395   .0028529     0.12   0.905    -.0052675    .0059464
            age_sp2 |   3.76e-06   .0000287     0.13   0.896    -.0000526    .0000601
           educ1_sp |  -.0096942   .0143086    -0.68   0.498    -.0378156    .0184273
         dage0_7_97 |  -.0125032   .0116685    -1.07   0.285    -.0354359    .0104295
        dage8_17_97 |  -.0052449   .0108621    -0.48   0.629    -.0265928     .016103
       dage18_54_97 |   .0084526   .0139535     0.61   0.545    -.0189711    .0358762
         dage55p_97 |   .0100005   .0123106     0.81   0.417    -.0141943    .0341953
           hhsize97 |   .0035919   .0027305     1.32   0.189    -.0017746    .0089583
          homeown97 |  -.0222857   .0205793    -1.08   0.279    -.0627313      .01816
        dirtfloor97 |   .0002204   .0100086     0.02   0.982    -.0194501    .0198909
      electricity97 |   -.006356   .0155381    -0.41   0.683    -.0368939    .0241818
         org_faenas |   .0229642   .0239788     0.96   0.339    -.0241627    .0700912
           min_dist |  -.0004993   .0001939    -2.58   0.010    -.0008804   -.0001183
       lnup_cwagepm |   .1019346   .0241682     4.22   0.000     .0544354    .1494338
       up2_mcwagepm |    .558923   .1518282     3.68   0.000     .2605263    .8573197
       dummy_age_hh |     .10192   .1115295     0.91   0.361    -.1172754    .3211154
      dummy_educ_hh |  -.0599456   .0496989    -1.21   0.228    -.1576216    .0377305
 dummy_ethnicity_hh |   .1163022   .0831194     1.40   0.162    -.0470572    .2796615
       dummy_age_sp |  -.0580194   .0477486    -1.22   0.225    -.1518625    .0358237
      dummy_educ_sp |   .0361963   .0470535     0.77   0.442    -.0562806    .1286733
   dummy_dage0_7_97 |  -.0115124   .1597243    -0.07   0.943    -.3254277    .3024029
  dummy_dirtfloor97 |   .1934585    .106804     1.81   0.071    -.0164496    .4033665
dummy_electricity97 |  -.1076714    .025281    -4.26   0.000    -.1573576   -.0579852
              _cons |  -.5326492   .1615391    -3.30   0.001    -.8501314    -.215167
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ani_prod |      3,539     .174343    .3794578          0          1

added scalar:
               e(mean) =  .17434303

added scalar:
                e(std) =  .37945781

Linear regression                               Number of obs     =      9,075
                                                F(34, 441)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0055
                                                Root MSE          =     .11129

                                      (Std. Err. adjusted for 442 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
        credit_farm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0076669   .0025431     3.01   0.003     .0026687     .012665
              wave3 |   .0009885   .0022906     0.43   0.666    -.0035134    .0054904
           nbani197 |  -.0006955   .0006894    -1.01   0.314    -.0020503    .0006594
           nbani297 |   .0002588   .0003928     0.66   0.510    -.0005131    .0010308
               ha97 |    .000209   .0005008     0.42   0.677    -.0007753    .0011933
              no497 |  -.0016932   .0038167    -0.44   0.658    -.0091943     .005808
             big497 |    .005668   .0040151     1.41   0.159    -.0022232    .0135592
             age_hh |   .0016194   .0006149     2.63   0.009     .0004109    .0028278
            age_hh2 |  -.0000119   5.47e-06    -2.18   0.030    -.0000227   -1.17e-06
          female_hh |  -.0046531   .0060445    -0.77   0.442    -.0165327    .0072265
           educ1_hh |  -.0052057   .0035022    -1.49   0.138    -.0120888    .0016774
       ethnicity_hh |  -.0030165    .002374    -1.27   0.205    -.0076822    .0016491
             age_sp |  -.0003002   .0008178    -0.37   0.714    -.0019076    .0013071
            age_sp2 |   3.20e-06   8.94e-06     0.36   0.721    -.0000144    .0000208
           educ1_sp |  -.0071421   .0044098    -1.62   0.106    -.0158089    .0015247
         dage0_7_97 |     .00392   .0031242     1.25   0.210    -.0022203    .0100602
        dage8_17_97 |   .0020667   .0031649     0.65   0.514    -.0041536    .0082869
       dage18_54_97 |   .0039277   .0044679     0.88   0.380    -.0048533    .0127086
         dage55p_97 |  -.0023592   .0034897    -0.68   0.499    -.0092177    .0044994
           hhsize97 |  -.0005219   .0008545    -0.61   0.542    -.0022014    .0011575
          homeown97 |   .0066743   .0034609     1.93   0.054    -.0001275    .0134762
        dirtfloor97 |   .0006854   .0029666     0.23   0.817     -.005145    .0065157
      electricity97 |  -.0001182   .0034389    -0.03   0.973    -.0068768    .0066405
         org_faenas |  -.0024101    .004409    -0.55   0.585    -.0110753    .0062551
           min_dist |  -.0000459   .0000279    -1.65   0.100    -.0001007    8.91e-06
       lnup_cwagepm |   .0061936    .005006     1.24   0.217    -.0036449    .0160322
       up2_mcwagepm |   .0359364   .0324196     1.11   0.268    -.0277798    .0996526
       dummy_age_hh |  -.0246092    .024191    -1.02   0.310    -.0721532    .0229349
      dummy_educ_hh |   .0114819   .0245753     0.47   0.641    -.0368173    .0597812
 dummy_ethnicity_hh |   .0211667   .0336738     0.63   0.530    -.0450144    .0873478
       dummy_age_sp |   .0142472   .0046617     3.06   0.002     .0050852    .0234092
      dummy_educ_sp |  -.0091785   .0034517    -2.66   0.008    -.0159624   -.0023946
   dummy_dage0_7_97 |   -.007796    .007545    -1.03   0.302    -.0226246    .0070326
  dummy_dirtfloor97 |  -.0132388   .0035177    -3.76   0.000    -.0201524   -.0063253
dummy_electricity97 |  -.0024144   .0052095    -0.46   0.643    -.0126529    .0078241
              _cons |  -.0709777   .0347764    -2.04   0.042    -.1393258   -.0026297
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 credit_farm |      3,534     .008206    .0902273          0          1

added scalar:
               e(mean) =  .008206

added scalar:
                e(std) =  .09022729

Linear regression                               Number of obs     =      8,339
                                                F(34, 441)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0659
                                                Root MSE          =     131.31

                                      (Std. Err. adjusted for 442 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
      home_prod_tot |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   -1.50278   5.988613    -0.25   0.802    -13.27255    10.26699
              wave3 |  -9.817432   4.636824    -2.12   0.035    -18.93045   -.7044129
           nbani197 |   4.117436   1.725163     2.39   0.017     .7268729    7.507999
           nbani297 |   -.418006   .5188612    -0.81   0.421    -1.437754    .6017418
               ha97 |   .4554444    .708766     0.64   0.521    -.9375344    1.848423
              no497 |  -30.02132   5.454496    -5.50   0.000    -40.74136   -19.30129
             big497 |   25.35704     5.5191     4.59   0.000     14.51003    36.20404
             age_hh |   1.602805   .9633648     1.66   0.097    -.2905518    3.496161
            age_hh2 |  -.0148214   .0086707    -1.71   0.088    -.0318624    .0022196
          female_hh |   1.874166   5.773699     0.32   0.746    -9.473218    13.22155
           educ1_hh |  -2.363068   4.773387    -0.50   0.621    -11.74448    7.018346
       ethnicity_hh |  -4.941138   6.239285    -0.79   0.429    -17.20357     7.32129
             age_sp |   .5076764   1.082257     0.47   0.639    -1.619346    2.634699
            age_sp2 |   -.005291   .0110608    -0.48   0.633    -.0270295    .0164475
           educ1_sp |   3.295222   5.286553     0.62   0.533    -7.094747    13.68519
         dage0_7_97 |  -12.00846   4.390569    -2.74   0.006     -20.6375   -3.379421
        dage8_17_97 |  -2.914554   4.370642    -0.67   0.505    -11.50443    5.675322
       dage18_54_97 |   14.10506   4.741961     2.97   0.003     4.785412    23.42471
         dage55p_97 |   5.794584   4.808647     1.21   0.229    -3.656128     15.2453
           hhsize97 |   7.190445   1.153671     6.23   0.000     4.923068    9.457821
          homeown97 |   12.10694   6.825857     1.77   0.077    -1.308313    25.52219
        dirtfloor97 |   12.60431   4.101881     3.07   0.002     4.542644    20.66597
      electricity97 |  -.2481903   6.175318    -0.04   0.968     -12.3849    11.88852
         org_faenas |  -6.530673   8.867377    -0.74   0.462    -23.95824     10.8969
           min_dist |  -.0891744   .0737755    -1.21   0.227    -.2341696    .0558208
       lnup_cwagepm |    25.7694   8.587899     3.00   0.003      8.89111     42.6477
       up2_mcwagepm |   252.3966   67.37167     3.75   0.000     119.9872     384.806
       dummy_age_hh |   56.01915   43.81371     1.28   0.202    -30.09046    142.1288
      dummy_educ_hh |  -3.358699   18.51494    -0.18   0.856    -39.74718    33.02978
 dummy_ethnicity_hh |   5.787751   27.41142     0.21   0.833     -48.0855      59.661
       dummy_age_sp |  -70.66457   16.63412    -4.25   0.000    -103.3566   -37.97258
      dummy_educ_sp |   49.34721   16.36918     3.01   0.003      17.1759    81.51851
   dummy_dage0_7_97 |   -62.8645   16.59116    -3.79   0.000    -95.47206   -30.25695
  dummy_dirtfloor97 |  -24.93397   35.60542    -0.70   0.484    -94.91137    45.04343
dummy_electricity97 |  -64.69945   8.774889    -7.37   0.000    -81.94525   -47.45365
              _cons |   -149.102   57.41861    -2.60   0.010    -261.9501   -36.25391
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home_prod_~t |      3,194    115.6232    138.0301          0   590.4396

added scalar:
               e(mean) =  115.62315

added scalar:
                e(std) =  138.03012

Linear regression                               Number of obs     =      8,328
                                                F(34, 441)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0555
                                                Root MSE          =     41.481

                                      (Std. Err. adjusted for 442 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_pp_ae |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .0688458   1.716492     0.04   0.968    -3.304675    3.442367
              wave3 |  -1.040089   1.312998    -0.79   0.429    -3.620601    1.540422
           nbani197 |   1.074558   .4412439     2.44   0.015     .2073553     1.94176
           nbani297 |  -.0278621   .1522674    -0.18   0.855    -.3271221    .2713978
               ha97 |   .0820193   .2010976     0.41   0.684    -.3132094     .477248
              no497 |  -6.561102   2.438439    -2.69   0.007    -11.35351   -1.768696
             big497 |   7.389993   1.755968     4.21   0.000     3.938887     10.8411
             age_hh |    .461914   .3680109     1.26   0.210    -.2613592    1.185187
            age_hh2 |  -.0045428   .0033803    -1.34   0.180    -.0111864    .0021007
          female_hh |  -3.850522   3.023799    -1.27   0.204    -9.793369    2.092325
           educ1_hh |    .609204    1.44942     0.42   0.674    -2.239425    3.457833
       ethnicity_hh |  -1.915626   1.815882    -1.05   0.292    -5.484484    1.653232
             age_sp |   .3483817   .3892112     0.90   0.371    -.4165576    1.113321
            age_sp2 |  -.0043195   .0040707    -1.06   0.289    -.0123199     .003681
           educ1_sp |   .7781515    1.35651     0.57   0.567    -1.887876    3.444179
         dage0_7_97 |  -1.292967   1.091642    -1.18   0.237    -3.438434    .8525008
        dage8_17_97 |    -3.7816   1.257566    -3.01   0.003    -6.253167   -1.310034
       dage18_54_97 |  -5.523219   2.259645    -2.44   0.015     -9.96423   -1.082207
         dage55p_97 |   .8788458   1.337987     0.66   0.512    -1.750777    3.508469
           hhsize97 |  -2.487518   .2762906    -9.00   0.000    -3.030528   -1.944508
          homeown97 |   2.901118   2.385129     1.22   0.225    -1.786514    7.588749
        dirtfloor97 |   3.086514   1.345197     2.29   0.022     .4427211    5.730307
      electricity97 |  -.7411616   2.056614    -0.36   0.719    -4.783143     3.30082
         org_faenas |  -.9023955   2.772468    -0.33   0.745    -6.351287    4.546496
           min_dist |   -.003676   .0216372    -0.17   0.865    -.0462008    .0388489
       lnup_cwagepm |   8.386723   2.665826     3.15   0.002     3.147421    13.62602
       up2_mcwagepm |   69.43422   17.96426     3.87   0.000     34.12802    104.7404
       dummy_age_hh |   27.26213    26.3625     1.03   0.302    -24.54962    79.07388
      dummy_educ_hh |  -3.683651   5.239778    -0.70   0.482    -13.98169    6.614389
 dummy_ethnicity_hh |   11.00663   15.98733     0.69   0.492    -20.41421    42.42746
       dummy_age_sp |   2.392297   4.915226     0.49   0.627    -7.267881    12.05248
      dummy_educ_sp |  -.4983733   4.489012    -0.11   0.912    -9.320889    8.324142
   dummy_dage0_7_97 |  -39.76714   6.274605    -6.34   0.000    -52.09898   -27.43529
  dummy_dirtfloor97 |   -3.18415   10.60533    -0.30   0.764    -24.02742    17.65912
dummy_electricity97 |  -38.57793   3.238439   -11.91   0.000    -44.94263   -32.21324
              _cons |  -25.99322   17.40604    -1.49   0.136    -60.20233    8.215882
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
home~t_pp_ae |      3,186    30.66064    42.13029          0   537.1648

added scalar:
               e(mean) =  30.660645

added scalar:
                e(std) =  42.130289

Linear regression                               Number of obs     =      8,328
                                                F(34, 441)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0599
                                                Root MSE          =     41.085

                                      (Std. Err. adjusted for 442 clusters in comuid)
-------------------------------------------------------------------------------------
                    |               Robust
home_prod_tot_pp_~2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
           treatcom |   .2226634   1.679211     0.13   0.895    -3.077587    3.522914
              wave3 |  -1.162031   1.287739    -0.90   0.367    -3.692899    1.368836
           nbani197 |   1.037635   .4369965     2.37   0.018     .1787807     1.89649
           nbani297 |  -.0202963   .1510278    -0.13   0.893    -.3171201    .2765274
               ha97 |   .0816575   .1993186     0.41   0.682    -.3100748    .4733899
              no497 |  -6.130384   2.422639    -2.53   0.012    -10.89174   -1.369032
             big497 |   7.430785   1.737604     4.28   0.000     4.015771     10.8458
             age_hh |    .503143   .3590515     1.40   0.162    -.2025218    1.208808
            age_hh2 |  -.0048724   .0033151    -1.47   0.142    -.0113877     .001643
          female_hh |  -3.834861   3.019922    -1.27   0.205    -9.770089    2.100368
           educ1_hh |   .6678921   1.410433     0.47   0.636    -2.104114    3.439898
       ethnicity_hh |  -2.013023   1.785185    -1.13   0.260     -5.52155    1.495505
             age_sp |   .4956578   .3813261     1.30   0.194    -.2537845      1.2451
            age_sp2 |  -.0056097   .0040174    -1.40   0.163    -.0135054    .0022859
           educ1_sp |   .9068941   1.303921     0.70   0.487    -1.655777    3.469565
         dage0_7_97 |  -3.180215   1.055388    -3.01   0.003     -5.25443   -1.105999
        dage8_17_97 |  -2.764549   1.236969    -2.23   0.026    -5.195636    -.333462
       dage18_54_97 |  -5.633857   2.257913    -2.50   0.013    -10.07146   -1.196251
         dage55p_97 |   .7420133   1.330455     0.56   0.577    -1.872807    3.356833
           hhsize97 |   -2.44698   .2718534    -9.00   0.000    -2.981269   -1.912691
          homeown97 |   2.597945   2.356216     1.10   0.271    -2.032861    7.228752
        dirtfloor97 |   3.057545   1.338391     2.28   0.023     .4271283    5.687961
      electricity97 |  -.6907448   2.029333    -0.34   0.734    -4.679111    3.297621
         org_faenas |  -1.024345   2.785874    -0.37   0.713    -6.499585    4.450894
           min_dist |  -.0027371   .0211928    -0.13   0.897    -.0443886    .0389144
       lnup_cwagepm |   8.556222    2.64264     3.24   0.001     3.362488    13.74996
       up2_mcwagepm |   70.42497   17.95232     3.92   0.000     35.14225    105.7077
       dummy_age_hh |   27.06295   26.07662     1.04   0.300    -24.18695    78.31285
      dummy_educ_hh |  -3.341885   5.398183    -0.62   0.536    -13.95125    7.267476
 dummy_ethnicity_hh |   10.63857   16.05075     0.66   0.508     -20.9069    42.18404
       dummy_age_sp |   2.656723   4.989069     0.53   0.595    -7.148583    12.46203
      dummy_educ_sp |  -.3419928   4.570539    -0.07   0.940    -9.324737    8.640752
   dummy_dage0_7_97 |  -39.69085   6.380472    -6.22   0.000    -52.23076   -27.15094
  dummy_dirtfloor97 |  -4.785518   9.493259    -0.50   0.614    -23.44317    13.87213
dummy_electricity97 |  -38.58251   3.195048   -12.08   0.000    -44.86192    -32.3031
              _cons |  -32.37345   17.10934    -1.89   0.059    -65.99942     1.25252
-------------------------------------------------------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hom~t_pp_ae2 |      3,186     30.1221    41.64302          0   537.1648

added scalar:
               e(mean) =  30.122097

added scalar:
                e(std) =  41.643024

. tab ineligible;

 Ineligible |
 households |
         =1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     14,676      100.00      100.00
------------+-----------------------------------
      Total |     14,676      100.00

. ***Appendix -- Output for Table A7;
. estout home_prod_tot_pp_ae2_c home_prod_tot_w3_pp_ae2_c maiz_c frijol_c ani_prod_c credit_farm_c
>         using "$out_p/supporting.text", stats(N mean std, fmt(%9.0fc %9.3fc %9.3fc) 
>         labels("Number Observations" "Mean Dep Var Unconditional Sample (Control Households)" 
>         "SD Dep Var Unconditional Sample (Control Households)")) 
>         keep(treatcom) cells(b(fmt(%9.3f) star) se(fmt(%9.3f) par(( ))))
>         starl(+ 0.1 * 0.05 ** 0.01) legend label collabels(none) title(ITT Income - Ineligibles) append;
(output written to C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\output/supporting.text)

. restore;

. log close;
      name:  <unnamed>
       log:  C:\Users\Claud\Box\A3SR Social Impact\si_cct\2010-0343_data_modified4class\code\si-cct/production_income_credit.
> log
  log type:  text
 closed on:  29 Nov 2019, 15:31:46
-----------------------------------------------------------------------------------------------------------------------------
